let disciplinyMagList=[{
    shifrProf: "01.04.02.01",
    shifr: 70,
    name: "Актуарная математика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 338,
    name: "Дискретные и вероятностные модели",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 853,
    name: "Математические модели природных систем",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 855,
    name: "Математические модели социально-экономических систем",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 858,
    name: "Математическое и программное обеспечение вычислительных систем",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 878,
    name: "Математическое моделирование сложных систем",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 1212,
    name: "Непрерывные математические модели",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 1254,
    name: "Обработка и анализ изображений",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 1265,
    name: "Общая теория рядов Фурье",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 1283,
    name: "Объектно-ориентированные языки и системы программирования",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 1733,
    name: "Прикладные аспекты теории вычетов",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 1858,
    name: "Прямые методы в математической физике",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 2056,
    name: "Случайные процессы",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 2109,
    name: "Современные проблемы прикладной математики и информатики",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 2124,
    name: "Современные технологии параллельного программирования",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 2131,
    name: "Современные численные методы и прикладные вычисления на ЭВМ",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 2309,
    name: "Телекоммуникационные системы и распределенные вычисления",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 2368,
    name: "Теория игр и ее приложения",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 2373,
    name: "Теория информации и обеспечение информационной безопасности",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 2386,
    name: "Теория оптимального управления",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "01.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 134,
    name: "Аэроакустика больших скоростей",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 136,
    name: "Аэродинамика вентиляционных систем",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 227,
    name: "Волны в сплошных средах",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 323,
    name: "Динамика вязкого газа",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 518,
    name: "Информационные технологии в отрасли (области знаний)",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 683,
    name: "Компьютерное моделирование кавитации",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 997,
    name: "Методология научных исследований в отрасли (области знаний)",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 1007,
    name: "Методы анализа и синтеза оптимальных конструкций",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 1131,
    name: "Моделирование турбулентности",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 1213,
    name: "Неравновесная термодинамика",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 1833,
    name: "Промышленная аэродинамика",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "01.04.03.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 163,
    name: "Биофизика",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 239,
    name: "Вычислительные методы в физики",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 352,
    name: "Дополнительные разделы физики",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 579,
    name: "История и методология физики",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 686,
    name: "Компьютерное моделирования физических процессов",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 1009,
    name: "Методы анализа экспериментальных данных",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 1011,
    name: "Методы диагностики плазмы",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 1137,
    name: "Модуль проектной деятельности",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 1490,
    name: "Основы СТО и ОТО",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 2099,
    name: "Современные проблемы астрономии",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 2113,
    name: "Современные проблемы физики",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 2719,
    name: "Физика газового разряда",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 2726,
    name: "Физика ускорителей",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "03.04.02.01",
    shifr: 3012,
    name: "Ядерная спектрометрия",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 138,
    name: "Аэрокосмические методы в экологическом мониторинге и охране природы",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 160,
    name: "Биологический мониторинг",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 438,
    name: "Иностранный язык в сфере профессионального общения",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 702,
    name: "Компьютерные технологии и статистические методы в экологии и природопользовании",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 774,
    name: "Ландшафтное планирование",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 914,
    name: "Международное сотрудничество в области охраны окружающей среды",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 1228,
    name: "Нормативная база в области охраны природы и природопользования",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 1426,
    name: "Основы научного исследования",
    shifrKaf: 36,
    nameKaf: "физики"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 1532,
    name: "Оценка состояния и устойчивости экосистем",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 2086,
    name: "Современные методы анализа и контроля компонентов окружающей среды",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 2114,
    name: "Современные проблемы экологии и природопользования",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 2622,
    name: "Управление и обращение с производственными и бытовыми отходами",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 2851,
    name: "Экологические аспекты оптимизации техногенно нарушенных ландшафтов",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 2857,
    name: "Экологический мониторинг, теория и практика",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 2859,
    name: "Экологическое проектирование, экспертиза и контроль окружающей среды",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "05.04.06.06",
    shifr: 2861,
    name: "Экология водных и наземных систем и их охрана",
    shifrKaf: 35,
    nameKaf: "экологии"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 2,
    name: "CASE-технологии создания информационных систем",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 9,
    name: "Web-технологии в разработке информационных систем",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 80,
    name: "Алгоритмы цифровой обработки сигналов",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 240,
    name: "Вычислительные системы",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 376,
    name: "Защита данных в сетях ЭВМ",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 461,
    name: "Интеллектуальные системы",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 484,
    name: "Информационная поддержка процессов жизненного цикла программных систем",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1006,
    name: "Методы администрирования компьютерных сетей",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1012,
    name: "Методы и алгоритмы принятия решений",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1018,
    name: "Методы и средства поиска научно-технической информации",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1034,
    name: "Методы исследования информационных систем и анализ экспериментальных данных",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1050,
    name: "Методы оптимизации",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1595,
    name: "Планирование экспериментов и обработка экспериментальных данных",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1793,
    name: "Проектирование компьютерных сетей",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 2032,
    name: "Системы и сети хранения данных",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 2039,
    name: "Системы обработки изображений и распознавания образов",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 2104,
    name: "Современные проблемы информатики и вычислительной техники",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 2309,
    name: "Телекоммуникационные системы и распределенные вычисления",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 2556,
    name: "Технология разработки программного обеспечения",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "09.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 87,
    name: "Анализ, моделирование и оптимизация бизнес-процессов в корпоративных информационных системах",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 119,
    name: "Архитектура корпоративных приложений SAP",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 122,
    name: "Архитектура распределенных информационных систем",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 694,
    name: "Компьютерные технологии в науке и производстве в области информационных систем",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 838,
    name: "Математические и инструментальные методы поддержки принятия решений",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 852,
    name: "Математические модели методов оптимизации хранения информации",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 862,
    name: "Математическое моделирование в системе MatLab",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 1033,
    name: "Методы исследования и моделирования информационных процессов и технологий",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 2093,
    name: "Современные облачные хранилища данных",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 2116,
    name: "Современные сетевые и телекоммуникационные технологии",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 2222,
    name: "Специальные главы математики",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 2242,
    name: "Средства научной визуализации",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 2243,
    name: "Средства разработки динамических графических объектов интернет приложений",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "09.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 151,
    name: "Безопасность информационных технологий",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 231,
    name: "Встроенные алгоритмические языки",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 332,
    name: "Динамическая теория информации",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 460,
    name: "Интеллектуальные информационные системы в экономике",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 473,
    name: "Интернет-технологии",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 838,
    name: "Математические и инструментальные методы поддержки принятия решений",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 860,
    name: "Математическое моделирование",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 992,
    name: "Методология и технология автоматизированного проектирования информационных систем",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 1025,
    name: "Методы и технологии интеллектуального анализа данных",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 1212,
    name: "Непрерывные математические модели",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 1254,
    name: "Обработка и анализ изображений",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 1283,
    name: "Объектно-ориентированные языки и системы программирования",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 1798,
    name: "Проектирование мобильных приложений и веб-сервисов",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 2009,
    name: "Синергетика и теория самоорганизации",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 2033,
    name: "Системы искусственного интеллекта",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 2124,
    name: "Современные технологии параллельного программирования",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 2373,
    name: "Теория информации и обеспечение информационной безопасности",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 2400,
    name: "Теория систем",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 2761,
    name: "Философия",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "09.04.03.01",
    shifr: 2922,
    name: "Экспертные системы",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 240,
    name: "Вычислительные системы",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 461,
    name: "Интеллектуальные системы",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 649,
    name: "Качество программного обеспечения",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1000,
    name: "Методология программной инженерии",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1115,
    name: "Моделирование и анализ программного обеспечения",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1204,
    name: "Нейронные сети",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1283,
    name: "Объектно-ориентированные языки и системы программирования",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1543,
    name: "Параллельное программирование",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1595,
    name: "Планирование экспериментов и обработка экспериментальных данных",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1599,
    name: "ПО корпоративных систем",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1764,
    name: "Программирование клиент-серверных приложений",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1798,
    name: "Проектирование мобильных приложений и веб-сервисов",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 2021,
    name: "Системный анализ",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 2038,
    name: "Системы обработки данных",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 2520,
    name: "Технология .NET",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 22,
    nameKaf: "информатики и программной инженерии"
  }, {
    shifrProf: "09.04.04.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 64,
    name: "Актуальные проблемы современной электроники и наноэлектроники",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 377,
    name: "Защита интеллектуальной собственности",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 396,
    name: "Импульсно-модуляционные системы",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 575,
    name: "История и методология науки и техники в области электроники",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 631,
    name: "Источники питания ЭВМ",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 689,
    name: "Компьютерные сети и системы",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 695,
    name: "Компьютерные технологии в научных исследованиях",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1039,
    name: "Методы математического моделирования",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1430,
    name: "Основы научных исследований и техника эксперимента",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1546,
    name: "Патентование научно-технических разработок",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1643,
    name: "Полупроводниковые ключи в силовых схемах",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1796,
    name: "Проектирование микропроцессорных и компьютерных систем",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1823,
    name: "Проектирование электронной компонентной базы",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 1987,
    name: "САПР электронных схем",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 2008,
    name: "Силовые цепи устройство в энергетической электронике",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "11.04.04.01",
    shifr: 2949,
    name: "Электромагнитная совместимость электронных устройств",
    shifrKaf: 97,
    nameKaf: "электронного машиностроения и промышленной электроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 212,
    name: "Взаимодействие когерентного излучения с веществом",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 574,
    name: "История и методология науки и техники в области нанотехнологии и актуальные проблемы современной электроники",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 773,
    name: "Лазеры в микро- и наноэлектронике",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 1040,
    name: "Методы математического моделирования и компьютерные технологии в научных исследованиях",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 1207,
    name: "Нелинейные процессы микроволновой, квантовой и оптоэлектроники",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 1305,
    name: "Оптоволоконные системы связи",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 1426,
    name: "Основы научного исследования",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 1738,
    name: "Применение квантовых и оптических приборов",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 1787,
    name: "Проектирование и технология электронной компонентной базы СВЧ",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 2234,
    name: "Спутниковые системы связи",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 2723,
    name: "Физика низкоразмерных систем и процессы микро- и нанотехнологии",
    shifrKaf: 98,
    nameKaf: "микро- и наноэлектроники"
  }, {
    shifrProf: "11.04.04.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 10,
    name: "Автоматизация и контроль среды обитания человека",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 520,
    name: "Информационные технологии в приборостроении",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 876,
    name: "Математическое моделирование сигналов и систем",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 1017,
    name: "Методы и средства неразрушающего контроля крупногабаритных объектов",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 1215,
    name: "Неразрушающий контроль в строительстве",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 1569,
    name: "Передача и обработка информации",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 1591,
    name: "Планирование эксперимента в инженерных и научных исследованиях",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 1718,
    name: "Приборы специального и таможенного контроля",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 2072,
    name: "Современные виброакустические методы контроля",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 2426,
    name: "Тепловой метод неразрушающего контроля",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 10,
    name: "Автоматизация и контроль среды обитания человека",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 317,
    name: "Диагностика информационно-измерительных систем",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 520,
    name: "Информационные технологии в приборостроении",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 876,
    name: "Математическое моделирование сигналов и систем",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 1121,
    name: "Моделирование первичных преобразователей",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 1348,
    name: "Организация передачи, защиты и хранения информации",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 1569,
    name: "Передача и обработка информации",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 1591,
    name: "Планирование эксперимента в инженерных и научных исследованиях",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 1775,
    name: "Программное обеспечение измерительных систем",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 1852,
    name: "Процессорные измерительные системы",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.01.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 10,
    name: "Автоматизация и контроль среды обитания человека",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 92,
    name: "Аналитический контроль биологических объектов и пищевых продуктов",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 520,
    name: "Информационные технологии в приборостроении",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 673,
    name: "Комплексы интенсивной терапии",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 876,
    name: "Математическое моделирование сигналов и систем",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 1569,
    name: "Передача и обработка информации",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 1591,
    name: "Планирование эксперимента в инженерных и научных исследованиях",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 1714,
    name: "Приборы и системы экологического мониторинга",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 2069,
    name: "Современное медицинское оборудование",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 2523,
    name: "Технология и оборудование для изготовления деталей и узлов медицинских приборов",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 55,
    nameKaf: "приборов"
  }, {
    shifrProf: "12.04.04.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 320,
    name: "Диагностика электрооборудования",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 375,
    name: "Защита в системах электроснабжения",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 1023,
    name: "Методы и средства энергосбережения",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 1049,
    name: "Методы обработки и планирования эксперимента",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 1240,
    name: "Обеспечение освещенности на объектах промышленных сооружений, жилых и общественных зданий",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 1644,
    name: "Полупроводниковые преобразователи энергии",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 2679,
    name: "Управление электроснабжением в локальных объектах",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 2680,
    name: "Управление электроснабжением предприятий и учреждений",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 2841,
    name: "Численные методы расчета электромагнитных полей",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 2956,
    name: "Электроника в электромеханике",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 2965,
    name: "Электрооборудование машиностроительных предприятий",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.01",
    shifr: 2973,
    name: "Электротехнические системы потребления предприятий и учреждений",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 24,
    name: "Автоматизированные системы научных исследований",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 604,
    name: "История развития и современные проблемы электротехники",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 1010,
    name: "Методы анализа электромагнитных процессов в электромеханических устройствах",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 1049,
    name: "Методы обработки и планирования эксперимента",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 1091,
    name: "Микропроцессорное управление электрическими машинами",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 1134,
    name: "Моделирование электромеханических систем",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 1921,
    name: "Распределительные системы управления электромеханическими комплексами",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 1963,
    name: "Ресурсо- и энергосберегающие электрические машины",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 2106,
    name: "Современные проблемы науки и производства в электротехнике",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 2451,
    name: "Техническая диагностика электромеханических устройств и систем",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 2555,
    name: "Технология производства электрооборудования",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 2678,
    name: "Управление электромеханическими системами",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 2841,
    name: "Численные методы расчета электромагнитных полей",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.02",
    shifr: 2952,
    name: "Электромагнитные системы железоотделителей",
    shifrKaf: 10,
    nameKaf: "электромеханики"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 13,
    name: "Автоматизация проектирования систем электроснабжения",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 29,
    name: "Автоматизированные системы управления электроснабжением",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 351,
    name: "Дополнительные главы математики",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 650,
    name: "Качество электроэнергии",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 704,
    name: "Компьютерные, сетевые и информационные технологии",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 1198,
    name: "Научный семинар " Математические модели и алгоритмы построения и развития систем электроснабжения "",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 1300,
    name: "Оптимизация проектирования и эксплуатации систем электроснабжения предприятий и городов",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 1302,
    name: "Оптимизация режимов нейтрали электрических сетей",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 1303,
    name: "Оптимизация структур и параметров систем электроснабжения",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 2092,
    name: "Современные научные и прикладные задачи электроэнергетики",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 2107,
    name: "Современные проблемы науки и производства в электроэнергетике",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 2414,
    name: "Теория управления электроэнергией и экономика энергосистем",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 2447,
    name: "Техническая диагностика и надёжность систем электроснабжения",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "13.04.02.03",
    shifr: 2945,
    name: "Электрическое освещение",
    shifrKaf: 93,
    nameKaf: "электротехнических систем электропотребления"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 81,
    name: "Альтернативные источники энергии",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 296,
    name: "Двигатели специального назначения",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 701,
    name: "Компьютерные технологии в энергомашиностроении",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1053,
    name: "Методы подобия физических процессов",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1061,
    name: "Методы улучшения экологических характеристик двигателей внутреннего сгорания",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1122,
    name: "Моделирование процессов в поршневых двигателях",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1125,
    name: "Моделирование процессов топливоподачи современных дизелей",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1383,
    name: "Основы вторичного использования теплоты в двигателях внутреннего сгорания",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1547,
    name: "Патентоведение",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1590,
    name: "Планирование эксперимента",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 1907,
    name: "Работа двигателей на альтернативных топливах",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 2108,
    name: "Современные проблемы науки и производства в энергетическом машиностроении",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 2132,
    name: "Современные энергетические технологии",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 2213,
    name: "Спецглавы конструирования и САПР в энергомашиностроении",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 2391,
    name: "Теория поршневых двигателей",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 40,
    nameKaf: "двигателей внутреннего сгорания"
  }, {
    shifrProf: "13.04.03.01",
    shifr: 2783,
    name: "Философские вопросы технических знаний",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 422,
    name: "Инновационные методы изготовления и контроля литых заготовок",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 517,
    name: "Информационные технологии в отрасли",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 847,
    name: "Математические методы оптимизации литейных процессов",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 877,
    name: "Математическое моделирование систем и процессов",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 1223,
    name: "Новые конструкционные материалы",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 1246,
    name: "Оборудование и технология финишной обработки отливок",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 1247,
    name: "Оборудование и технология художественного литья",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 1431,
    name: "Основы научных исследований, организация и планирование эксперимента",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 1722,
    name: "Прикладная математика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 2048,
    name: "Системы управления литейным процессом",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 2730,
    name: "Физико-механические свойства формовочных материалов",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.01.02",
    shifr: 2820,
    name: "Художественное литье",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 518,
    name: "Информационные технологии в отрасли (области знаний)",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 710,
    name: "Конструирование автоматических и роботизированных машин, модулей и комплексов",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 870,
    name: "Математическое моделирование процессов горячей объемной штамповки",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 871,
    name: "Математическое моделирование процессов листовой штамповки",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 872,
    name: "Математическое моделирование процессов холодной объемной штамповки",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 997,
    name: "Методология научных исследований в отрасли (области знаний)",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 1301,
    name: "Оптимизация процессов обработки давлением",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 1587,
    name: "Планирование и организация эксперимента в обработке давлением",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 1722,
    name: "Прикладная математика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 2320,
    name: "Теоретические основы исследования процессов обработки давлением",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.02.01",
    shifr: 2982,
    name: "Энергетика кузнечно-прессового оборудования",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 427,
    name: "Инновационные технологии и оборудование для упаковки продукции",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 933,
    name: "Мембранная и криогенная техника",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1003,
    name: "Методология создания прогрессивного технологического оборудования перерабатывающих и пищевых производств",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1136,
    name: "Модернизация и сервис оборудования пищевых производств",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1444,
    name: "Основы подготовки диссертации",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1445,
    name: "Основы подготовки научной и учебной литературы",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1590,
    name: "Планирование эксперимента",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1722,
    name: "Прикладная математика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1804,
    name: "Проектирование предприятий с основами САПР",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 2012,
    name: "Система качества перерабатывающих и пищевых производств",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 2563,
    name: "Товароведение сырья, материалов и средств производства пищевой промышленности",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.02.02",
    shifr: 2918,
    name: "Экспертиза качества продовольственных товаров в таможенной деятельности",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 319,
    name: "Диагностика разрушения сварных конструкций",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 519,
    name: "Информационные технологии в отрасли (САПР)",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 875,
    name: "Математическое моделирование сварочных процессов",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 996,
    name: "Методология научных исследований в отрасли",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1062,
    name: "Методы уменьшения сварочных напряжений и деформаций",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1194,
    name: "Научные основы ремонта деталей сваркой",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1222,
    name: "Новые конструкционные и сварочные материалы",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1327,
    name: "Организация и планирование эксперимента",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1328,
    name: "Организация и проектирование сварочного производства",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1572,
    name: "Перспективные методы сварки",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1579,
    name: "Плазменное нанесение покрытий",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1722,
    name: "Прикладная математика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 2323,
    name: "Теоретические основы соединения разнородных и неметаллических материалов",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 2630,
    name: "Управление качеством в сварочном производстве",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 87,
    nameKaf: "обработки металлов давлением и сварки"
  }, {
    shifrProf: "15.04.02.03",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 24,
    name: "Автоматизированные системы научных исследований",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 518,
    name: "Информационные технологии в отрасли (области знаний)",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 869,
    name: "Математическое моделирование приводов машин",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 997,
    name: "Методология научных исследований в отрасли (области знаний)",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1056,
    name: "Методы синтеза и расчета систем гидропневмоавтоматики",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1431,
    name: "Основы научных исследований, организация и планирование эксперимента",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1538,
    name: "Очистка и кондиционирование рабочих жидкостей",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1722,
    name: "Прикладная математика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1809,
    name: "Проектирование СГПП",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 1910,
    name: "Рабочие процессы и характеристики аппаратуры объемных гидроприводов",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 2041,
    name: "Системы приводов технологических и транспортных машин",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 2361,
    name: "Теория и проектирование гидравлического следящего привода",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 20,
    nameKaf: "гидрогазодинамики"
  }, {
    shifrProf: "15.04.02.07",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 14,
    name: "Автоматизация производственных процессов",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 28,
    name: "Автоматизированные системы управления качеством",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 40,
    name: "Адаптивные системы управления",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 76,
    name: "Алгоритмизация управления технологическими процессами",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 393,
    name: "Имитационное моделирование дискретных процессов и производств",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 456,
    name: "Интеллектуальные автоматизированные системы",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 462,
    name: "Интеллектуальные системы в автоматизированных системах управления",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 468,
    name: "Интерактивное моделирование технологических и технических объектов",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 474,
    name: "Интерфейсы интегрированных систем автоматизации технологических процессов",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 510,
    name: "Информационные системы реального времени",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 511,
    name: "Информационные системы средств автоматизации",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 866,
    name: "Математическое моделирование объектов и процессов управления",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 1296,
    name: "Оптимальные системы автоматического управления",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 1343,
    name: "Организация научных и проектных исследований в сфере автоматизации",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 1592,
    name: "Планирование эксперимента и обработка экспериментальных данных",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 1819,
    name: "Проектирование управлений на основе SCADA-систем",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 2045,
    name: "Системы тестирования программных средств управления и диспетчеризации",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 2098,
    name: "Современные проблемы автоматизации и управления технологическими процессами",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 2459,
    name: "Технические средства автоматизации технологических процессов и производств",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 2689,
    name: "Управляющие вычислительные системы производственных процессов",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 96,
    nameKaf: "автоматизации и компьютерно-интегрированных технологий"
  }, {
    shifrProf: "15.04.04.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 42,
    name: "Аддитивные технологии в машиностроении",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 518,
    name: "Информационные технологии в отрасли (области знаний)",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 693,
    name: "Компьютерные технологии в науке и производстве",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 947,
    name: "Металлорежущие станки с компьютерным управлением",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 997,
    name: "Методология научных исследований в отрасли (области знаний)",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 1161,
    name: "Надежность и диагностика технологических систем",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 1193,
    name: "Научные основы повышения эксплуатационных свойств деталей машин",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 1780,
    name: "Прогрессивные технологии изготовления изделий машиностроения",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 1811,
    name: "Проектирование систем технологической оснастки и специального оборудования",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 1817,
    name: "Проектирование технологических процессов сборки изделий",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 2084,
    name: "Современные методы автоматизированного проектирования",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 2103,
    name: "Современные проблемы инструментального обеспечения машиностроительных производств",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 2504,
    name: "Технологическая подготовка машиностроительных производств",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 2515,
    name: "Технологические процессы финишной обработки деталей машин",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 2538,
    name: "Технология контроля и испытаний машин",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.05.01",
    shifr: 2847,
    name: "Эвристические методы проектирования",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 42,
    name: "Аддитивные технологии в машиностроении",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 398,
    name: "Импульсные методы обработки",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 518,
    name: "Информационные технологии в отрасли (области знаний)",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 693,
    name: "Компьютерные технологии в науке и производстве",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 726,
    name: "Контроль качества изделий",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 947,
    name: "Металлорежущие станки с компьютерным управлением",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 997,
    name: "Методология научных исследований в отрасли (области знаний)",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 1127,
    name: "Моделирование технологических процессов в машиностроении",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 1193,
    name: "Научные основы повышения эксплуатационных свойств деталей машин",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 1195,
    name: "Научные основы энергетического воздействия в процессах обработки",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 1800,
    name: "Проектирование оборудования и устройств для специальных технологий",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 1816,
    name: "Проектирование технологий абразивной обработки",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 2084,
    name: "Современные методы автоматизированного проектирования",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 2103,
    name: "Современные проблемы инструментального обеспечения машиностроительных производств",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 2504,
    name: "Технологическая подготовка машиностроительных производств",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 2515,
    name: "Технологические процессы финишной обработки деталей машин",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1,
    name: "CAD/CAM/CAE системы в машиностроении",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 42,
    name: "Аддитивные технологии в машиностроении",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 392,
    name: "Имитационное моделирование автоматизированных технологических комплексов",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 429,
    name: "Инновационные технологии решения нестандартных инженерных проектов",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 698,
    name: "Компьютерные технологии в станкостроении",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 849,
    name: "Математические методы решения научных задач",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 947,
    name: "Металлорежущие станки с компьютерным управлением",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 999,
    name: "Методология научных исследований, организация и планирование эксперимента",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1001,
    name: "Методология проектирования изделий машиностроения",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1013,
    name: "Методы и средства автоматизации инструментального производства",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1179,
    name: "Нанотехнологии в машиностроении",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1499,
    name: "Основы теория трения и изнашивания",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1592,
    name: "Планирование эксперимента и обработка экспериментальных данных",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1710,
    name: "Предохранительные устройства технологического оборудования",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1734,
    name: "Прикладные методы научных исследований",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1857,
    name: "Прочность и надежность узлов и деталей станка",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 1928,
    name: "Расчет моделирования и конструирования оборудования с компьютерным управлением",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 2042,
    name: "Системы программного управления станками",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 2043,
    name: "Системы разработки и постановки продукции на производство",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 2103,
    name: "Современные проблемы инструментального обеспечения машиностроительных производств",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 2122,
    name: "Современные технологии обеспечения работоспособности режущего инструмента",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 2240,
    name: "Средства и методы технологии обработки на станках с ЧПУ",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 2515,
    name: "Технологические процессы финишной обработки деталей машин",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 2517,
    name: "Технологическое обеспечение качества",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.05.03",
    shifr: 2910,
    name: "Экономическое обоснование научных решений",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 42,
    name: "Аддитивные технологии в машиностроении",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 447,
    name: "Инструментальные системы для ГПМ",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 448,
    name: "Инструментальные системы машиностроительных производств",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 690,
    name: "Компьютерные технологии в инструментальном производстве",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 861,
    name: "Математическое моделирование в машиностроении",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 947,
    name: "Металлорежущие станки с компьютерным управлением",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 999,
    name: "Методология научных исследований, организация и планирование эксперимента",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1001,
    name: "Методология проектирования изделий машиностроения",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1013,
    name: "Методы и средства автоматизации инструментального производства",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1044,
    name: "Методы обеспечения надежности инструментальных наладок",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1179,
    name: "Нанотехнологии в машиностроении",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1499,
    name: "Основы теория трения и изнашивания",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1592,
    name: "Планирование эксперимента и обработка экспериментальных данных",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1820,
    name: "Проектирование управляющих программ для ГПМ в ИП",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 1928,
    name: "Расчет моделирования и конструирования оборудования с компьютерным управлением",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2043,
    name: "Системы разработки и постановки продукции на производство",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2103,
    name: "Современные проблемы инструментального обеспечения машиностроительных производств",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2118,
    name: "Современные тенденции развития обработки резанием",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2120,
    name: "Современные технологии нанесения износостойких покрытий на режущие инструментальные материалы",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2122,
    name: "Современные технологии обеспечения работоспособности режущего инструмента",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2515,
    name: "Технологические процессы финишной обработки деталей машин",
    shifrKaf: 32,
    nameKaf: "технологии машиностроения и инженерного консалтинга"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2517,
    name: "Технологическое обеспечение качества",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2532,
    name: "Технология изготовления инструментов и инструментальной оснастки",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2910,
    name: "Экономическое обоснование научных решений",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.05.04",
    shifr: 2977,
    name: "Электрофизические технологии обработки материалов",
    shifrKaf: 26,
    nameKaf: "станков, инструментов и инженерной графики"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 394,
    name: "Имитационное моделирование мехатронных и робототехнических систем",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 500,
    name: "Информационные системы в мехатронике и робототехнике",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 864,
    name: "Математическое моделирование и оптимизация движения многозвенных систем",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1024,
    name: "Методы и теория оптимизации систем управления",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1030,
    name: "Методы искусственного интеллекта в мехатронике и робототехнике",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1051,
    name: "Методы очувствления робототехнических и мехатронных систем",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1087,
    name: "Мехатронные и робототехнические системы специального назначения",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1217,
    name: "Нечеткая логика и нейронные сети в мехатронных и робототехнических системах",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1226,
    name: "Новые технологии в мехатронике и робототехнике",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 1974,
    name: "Робототехнические технологические комплексы",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 2024,
    name: "Системы автоматизированного проектирования",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 2087,
    name: "Современные методы вычислительной математики в решении задач мехатроники и робототехники",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 2383,
    name: "Теория нечетких множеств в управлении",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 2402,
    name: "Теория систем и системный анализ",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 2418,
    name: "Теория эксперимента в исследованиях систем",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 2640,
    name: "Управление манипуляторами в неизвестной среде",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 2690,
    name: "Управляющие системы мехатронных и робототехнических комплексов",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 95,
    nameKaf: "информационных и управляющих систем"
  }, {
    shifrProf: "15.04.06.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 523,
    name: "Информационные технологии в сфере безопасности",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 1008,
    name: "Методы анализа систем производственной автоматики и автоматической пожарной защиты",
    shifrKaf: 89,
    nameKaf: "пожарной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 1145,
    name: "Мониторинг безопасности",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 1234,
    name: "Нормирование оперативно-тактических действий",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 1665,
    name: "Правовое регулирование в области пожарной безопасности",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 1926,
    name: "Расчет и проектирование систем обеспечения безопасности",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 2089,
    name: "Современные методы мониторинга опасных и вредных производственных факторов",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 2090,
    name: "Современные методы обеспечения устойчивости зданий и сооружений в условиях пожара",
    shifrKaf: 89,
    nameKaf: "пожарной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 2394,
    name: "Теория принятия решений по тушению пожара",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 2659,
    name: "Управление рисками, системный анализ и моделирование",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 2669,
    name: "Управление технической службой подразделений ГПС",
    shifrKaf: 89,
    nameKaf: "пожарной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 2869,
    name: "Экономика и менеджмент безопасности",
    shifrKaf: 90,
    nameKaf: "техносферной безопасности"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 3014,
    name: "Языковая коммуникация в профессиональной сфере на иностранном языке",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "20.04.01.01",
    shifr: 3015,
    name: "Языковая коммуникация в профессиональной сфере на русском языке",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 313,
    name: "Деформационно-термическая обработка материалов",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 494,
    name: "Информационные и компьютерные технологии в материаловедении",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 884,
    name: "Материаловедение и технологии современных и перспективных материалов",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 950,
    name: "Методика выбора и разработки материалов с заданными технологическими и функциональными свойствами",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 995,
    name: "Методология научных исследований в материаловедении",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1179,
    name: "Нанотехнологии в машиностроении",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1372,
    name: "Организация эксперимента",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1571,
    name: "Перспективные материалы",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1574,
    name: "Перспективные технологии термической и химикотермической обработки материалов",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1722,
    name: "Прикладная математика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 1856,
    name: "Процессы получения композиционных и порошковых материалов",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 2085,
    name: "Современные методы анализа и исследования структуры и свойств материалов",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 2257,
    name: "Стереологические принципы обработки результатов структурных исследований",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 2734,
    name: "Физико-химические основы моделирования строения и свойств материалов",
    shifrKaf: 31,
    nameKaf: "материаловедения"
  }, {
    shifrProf: "22.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 422,
    name: "Инновационные методы изготовления и контроля литых заготовок",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 518,
    name: "Информационные технологии в отрасли (области знаний)",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 692,
    name: "Компьютерные технологии в металлургии",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 846,
    name: "Математические методы оптимизации",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 877,
    name: "Математическое моделирование систем и процессов",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 997,
    name: "Методология научных исследований в отрасли (области знаний)",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 1246,
    name: "Оборудование и технология финишной обработки отливок",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 1247,
    name: "Оборудование и технология художественного литья",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 1327,
    name: "Организация и планирование эксперимента",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 1428,
    name: "Основы научных исследований",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 1722,
    name: "Прикладная математика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 2730,
    name: "Физико-механические свойства формовочных материалов",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "22.04.02.01",
    shifr: 2821,
    name: "Художественное литье и художественная обработка материалов",
    shifrKaf: 81,
    nameKaf: "промышленного и художественного литья"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 90,
    name: "Аналитические и численные методы в планировании экспериментов и инженерном анализе",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 453,
    name: "Интегрированные транспортные системы",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 798,
    name: "Логистические методы в организации перевозок",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 1119,
    name: "Моделирование интеллектуальных транспортных систем",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 1130,
    name: "Моделирование транспортных систем и оптимизация процессов на транспорте",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 1398,
    name: "Основы и методы научных исследований",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 1547,
    name: "Патентоведение",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 1607,
    name: "Подсистемы интеллектуальных транспортных систем",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 2112,
    name: "Современные проблемы транспортной науки, техники и технологии",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 2310,
    name: "Телекоммуникационные технологии интеллектуальных транспортных систем",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 2410,
    name: "Теория транспортных потоков в приложении к интеллектуальным транспортным системам",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 2466,
    name: "Технические средства организации движения",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 2618,
    name: "Управление грузовыми перевозками и логистика",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 90,
    name: "Аналитические и численные методы в планировании экспериментов и инженерном анализе",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 798,
    name: "Логистические методы в организации перевозок",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 1129,
    name: "Моделирование транспортных систем",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 1130,
    name: "Моделирование транспортных систем и оптимизация процессов на транспорте",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 1398,
    name: "Основы и методы научных исследований",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 1547,
    name: "Патентоведение",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 1607,
    name: "Подсистемы интеллектуальных транспортных систем",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 2112,
    name: "Современные проблемы транспортной науки, техники и технологии",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 2295,
    name: "Таможенная безопасность",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 2311,
    name: "Телекоммуникационные технологии на автотранспорте",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 2410,
    name: "Теория транспортных потоков в приложении к интеллектуальным транспортным системам",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 2466,
    name: "Технические средства организации движения",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 2617,
    name: "Управление грузовыми автоперевозками",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 45,
    nameKaf: "транспортных систем"
  }, {
    shifrProf: "23.04.01.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 25,
    name: "Автоматизированные системы управления безопасным движением",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 91,
    name: "Аналитические и численные методы планирования экспериментов в инженерном анализе",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 147,
    name: "Безопасность движения автомобильного транспорта в рыночных условиях",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 290,
    name: "Грузовые и пассажирские транспортные системы",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 547,
    name: "Исследования и испытания наземных транспортно-технологических машин",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 880,
    name: "Математическое моделирование транспортных потоков",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 1298,
    name: "Оптимизационные процессы в городской транспортной среде",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 1428,
    name: "Основы научных исследований",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 1547,
    name: "Патентоведение",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 1825,
    name: "Проектный анализ",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 2121,
    name: "Современные технологии обеспечения безопасности в транспортном процессе",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 2413,
    name: "Теория транспортных процессов и специальные методы моделирования",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 2478,
    name: "Технологии организации и управления безопасным движением тягового подвижного состава",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 2576,
    name: "Транспортная инфраструктура в решении проблем безопасности дорожного движения",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "23.04.01.08",
    shifr: 2893,
    name: "Экономическая оценка ущерба от дорожно-транспортных происшествий",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 326,
    name: "Динамика грузоподъемных кранов как единых электромеханических систем",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 547,
    name: "Исследования и испытания наземных транспортно-технологических машин",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 548,
    name: "Исследования канатных грейферных механизмов",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 706,
    name: "Компьютерный инженерный анализ объектов подъемно-транспортного, строительного, дорожного машиностроения",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 712,
    name: "Конструирование и расчет подъемно-транспортных, строительных, дорожных машин",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 873,
    name: "Математическое моделирование рабочих процессов подъемно-транспортных, строительных, дорожных машин",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 1022,
    name: "Методы и средства экспериментальных исследований подъемно-транспортных, строительных, дорожных машин",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 1110,
    name: "Многопараметрические исследования динамики грузоподъемных кранов",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 1156,
    name: "Мультимедийные презентационные технологии",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 1428,
    name: "Основы научных исследований",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 1547,
    name: "Патентоведение",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 1594,
    name: "Планирование эксперимента при поиске оптимальных решений в задачах подъемно-транспортного, строительного, дорожного машиностроения (планы первого и второго порядка)",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 2448,
    name: "Техническая диагностика и прогнозирование остаточного ресурса грузоподъемных кранов",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "23.04.02.01",
    shifr: 2843,
    name: "Численные методы решения задач подъемно-транспортного, строительного, дорожного машиностроения",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 541,
    name: "Исследование и испытание автомобилей",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 703,
    name: "Компьютерные технологии на автотранспорте",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 834,
    name: "Математическая обработка результатов экспериментальных исследований",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 865,
    name: "Математическое моделирование на автотранспорте",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1046,
    name: "Методы обеспечения работоспособного технического состояния автотранспортных средств",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1428,
    name: "Основы научных исследований",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1431,
    name: "Основы научных исследований, организация и планирование эксперимента",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1454,
    name: "Основы проектирования и эксплуатации технологического оборудования",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1547,
    name: "Патентоведение",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1722,
    name: "Прикладная математика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 1999,
    name: "Сервис и фирменное обслуживание автотранспортных средств",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 2102,
    name: "Современные проблемы и направления развития эксплуатации автотранспортных средств",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 2513,
    name: "Технологические процессы технического обслуживания и ремонта автомобилей",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 2650,
    name: "Управление предприятиями на автомобильном транспорте",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 92,
    nameKaf: "промышленного и городского транспорта"
  }, {
    shifrProf: "23.04.03.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 187,
    name: "Введение в качество, стандартизацию и сертификацию",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 451,
    name: "Инструменты усовершенствования процессов системы качества",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 573,
    name: "История и методология науки и современные проблемы стандартизации и метрологии",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 922,
    name: "Международные стандарты качества",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1015,
    name: "Методы и средства измерений, испытаний",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1064,
    name: "Метрологическая экспертиза конструкторских и технологических документов",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1065,
    name: "Метрологический контроль и испытание промышленной продукции",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1165,
    name: "Надежность технических систем",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1192,
    name: "Научные основы метрологического обеспечения производства",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1197,
    name: "Научный семинар",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1238,
    name: "Обеспечение качества измерений",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1428,
    name: "Основы научных исследований",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1511,
    name: "Основы учебно-методической работы в вузе",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1547,
    name: "Патентоведение",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 2035,
    name: "Системы качества",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 2557,
    name: "Технология разработки стандартов и нормативной документации",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "27.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 187,
    name: "Введение в качество, стандартизацию и сертификацию",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 451,
    name: "Инструменты усовершенствования процессов системы качества",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 573,
    name: "История и методология науки и современные проблемы стандартизации и метрологии",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 922,
    name: "Международные стандарты качества",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 946,
    name: "Менеджмент стандартов качества",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1015,
    name: "Методы и средства измерений, испытаний",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1165,
    name: "Надежность технических систем",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1197,
    name: "Научный семинар",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1237,
    name: "Обеспечение качества",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1242,
    name: "Обеспечение решений в системах управления качеством",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1428,
    name: "Основы научных исследований",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1511,
    name: "Основы учебно-методической работы в вузе",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1547,
    name: "Патентоведение",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 2003,
    name: "Сертификация",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 2044,
    name: "Системы стандартизации и методы принятия решений",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 2244,
    name: "Стандартизация",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 41,
    nameKaf: "железнодорожного транспорта"
  }, {
    shifrProf: "27.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 400,
    name: "Инвестиции в инновационной деятельности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 415,
    name: "Инновации и интеллектуальная собственность",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 417,
    name: "Инновационное предпринимательство",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 480,
    name: "Информационная безопасность и защита инновационной деятельности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 755,
    name: "Креативный менеджмент",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 818,
    name: "Маркетинг инноваций",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 998,
    name: "Методология научных исследований и история нововведений",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 1118,
    name: "Моделирование инновационного развития",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 1662,
    name: "Правовое обеспечение инновационной деятельности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 1970,
    name: "Риски в инновационной деятельности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 2369,
    name: "Теория инноваций",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 2626,
    name: "Управление инновационным развитием",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 2627,
    name: "Управление инновационными проектами",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 2654,
    name: "Управление процессом разработки и освоения производства инновационной продукции",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "27.04.07.01",
    shifr: 2875,
    name: "Экономика инновационной деятельности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 410,
    name: "Инжиниринг в интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 418,
    name: "Инновационное предпринимательство в сфере интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 444,
    name: "Институционный анализ интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 455,
    name: "Интеллектуальная собственность и инноватика",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 482,
    name: "Информационная безопасность и защита прав интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 755,
    name: "Креативный менеджмент",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 819,
    name: "Маркетинг интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 998,
    name: "Методология научных исследований и история нововведений",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 1534,
    name: "Оценка стоимости прав интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 1545,
    name: "Патентно-конъюнктурные исследования",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 1656,
    name: "Право интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 1739,
    name: "Приобретение прав интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 1920,
    name: "Распоряжение правами интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 2628,
    name: "Управление интеллектуальной собственностью",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "27.04.08.01",
    shifr: 2876,
    name: "Экономика интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 413,
    name: "Инновации в САПР изделий легкой промышленности",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 651,
    name: "Квалиметрия изделий легкой промышленности",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 691,
    name: "Компьютерные технологии в легкой промышленности",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1057,
    name: "Методы создания и продвижения коллекций",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1444,
    name: "Основы подготовки диссертации",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1445,
    name: "Основы подготовки научной и учебной литературы",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1548,
    name: "Патентоведение и защита интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1573,
    name: "Перспективные технологии изготовления швейных изделий различного направления",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1590,
    name: "Планирование эксперимента",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1722,
    name: "Прикладная математика",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 1950,
    name: "Реинжиниринг организации технологических процессов швейных изделий",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 2088,
    name: "Современные методы и средства исследования материалов для изготовления производственной одежды",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 2322,
    name: "Теоретические основы построения и функционирования информационных систем в производстве изделий легкой промышленности",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 66,
    nameKaf: "легкой и пищевой промышленности"
  }, {
    shifrProf: "29.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 424,
    name: "Инновационные психолого-педагогические технологии",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 493,
    name: "Информационные и коммуникационные технологии",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 666,
    name: "Коммуникативные технологии направленной смысловой трансляции и психологические аспекты манипуляции",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 759,
    name: "Кросскультурная психология",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 793,
    name: "Личность в критических ситуациях: психология деформаций",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 981,
    name: "Методологические проблемы психологии и специальная терминология",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1196,
    name: "Научные школы психологии: проблемы теории и практики",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1589,
    name: "Планирование теоретического и практического исследования в психологии",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1695,
    name: "Практикум по социальной психологии",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1713,
    name: "Преподавание психологии в системе высшего и дополнительного образования",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1873,
    name: "Психология высшей школы",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1874,
    name: "Психология девиантного поведения",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1894,
    name: "Психология социализации личности",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1904,
    name: "Психофизиология сознания",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 1995,
    name: "Семейная психотерапия и консультирование в кросскультурном контексте",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.01.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 318,
    name: "Диагностика конфликтных действий и определяющих их факторов",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 582,
    name: "История конфликтологии",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 667,
    name: "Коммуникации в деловом общении",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 731,
    name: "Конфликтологическое консультирование",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1047,
    name: "Методы обоснования принятия решений в конфликте, практика выработки навыков посредника",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1307,
    name: "Организационная конфликтология",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1443,
    name: "Основы переговорного процесса",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1567,
    name: "Переговорный процесс: стратегия и тактика ведения переговоров",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1568,
    name: "Переговоры компромисса и принуждения альтернативные формы разрешения конфликтов",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1647,
    name: "Посредничество в разрешении конфликта",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1873,
    name: "Психология высшей школы",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 1885,
    name: "Психология конфликта",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 2315,
    name: "Теоретико-дисциплинарные подходы анализа конфликта",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 2498,
    name: "Технологии урегулирования конфликтов",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "37.04.02.01",
    shifr: 2917,
    name: "Экспертиза и анализ конфликта",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 419,
    name: "Инновационное развитие предприятия",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 466,
    name: "Интеллектуальный бизнес",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 708,
    name: "Конкурентоспособность предприятия",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 973,
    name: "Методика преподавания экономических дисциплин",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 1100,
    name: "Микроэкономика (продвинутый уровень)",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2271,
    name: "Стратегическое управление предприятием",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2273,
    name: "Стратегия предпринимательской деятельности",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2648,
    name: "Управление потенциалом предприятия",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2685,
    name: "Управленческий учёт",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2696,
    name: "Устойчивое развитие предприятия",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2892,
    name: "Экономическая диагностика",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2902,
    name: "Экономические методы предотвращения ущерба предприятию",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.01",
    shifr: 2908,
    name: "Экономический потенциал региона",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 707,
    name: "Конкурентные стратегии международных компаний",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 904,
    name: "Международная интеграция",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 907,
    name: "Международная экономическая безопасность",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 909,
    name: "Международное движение ресурсов",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 1109,
    name: "Мировые товарные рынки",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 1112,
    name: "Модели рынков труда",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 1329,
    name: "Организация и техника внешнеэкономических операций",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 2058,
    name: "Современная внешнеторговая политика",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 2151,
    name: "Социальная ответственность",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 2261,
    name: "Страновая конкурентоспособность",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 2894,
    name: "Экономическая политика стран мира",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.02",
    shifr: 2899,
    name: "Экономическая теория и макроэкономика (продвинутый уровень)",
    shifrKaf: 7,
    nameKaf: "мировой экономики"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 129,
    name: "Аудит (продвинутый уровень)",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 174,
    name: "Бухгалтерский финансовый учет и отчетность (продвинутый уровень)",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 671,
    name: "Комплексный экономический анализ",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 723,
    name: "Контроллинг",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 968,
    name: "Методика преподавания учетно-аналитических дисциплин",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 1100,
    name: "Микроэкономика (продвинутый уровень)",
    shifrKaf: 33,
    nameKaf: "экономики предприятия"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 1315,
    name: "Организация бухгалтерского учета",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 1325,
    name: "Организация и методика аудита",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 2013,
    name: "Система международных стандартов финансовой отчетности",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 2151,
    name: "Социальная ответственность",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 2288,
    name: "Судебно-бухгалтерская экспертиза",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 2326,
    name: "Теории (концепции) бухгалтерского учета",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 2686,
    name: "Управленческий учет (продвинутый уровень)",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "38.04.01.03",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 747,
    name: "Корпоративные финансы",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 912,
    name: "Международное налогообложение",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 924,
    name: "Международные стандарты финансовой отчетности и стандарты бухгалтерского учета: финансовый учет и отчётность",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1045,
    name: "Методы обеспечения налогового мониторинга",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1169,
    name: "Налоги и предпринимательство",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1170,
    name: "Налоговое администрирование и контроль",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1172,
    name: "Налоговое консультирование",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1174,
    name: "Налоговый менеджмент",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1175,
    name: "Налогообложение финансово-кредитных институтов",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1299,
    name: "Оптимизация налоговых показателей учета и отчетности",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1530,
    name: "Оценка и налогообложение объектов недвижимости и нематериальных активов",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1674,
    name: "Правовые основы налогового законодательства",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 1840,
    name: "Профессиональная этика государственного служащего",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.01.04",
    shifr: 2795,
    name: "Финансовые и денежно-кредитные методы регулирования экономики",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 167,
    name: "Бренд-менеджмент",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 420,
    name: "Инновационные методики преподавания маркетинговых дисциплин",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 431,
    name: "Инновационный маркетинг",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 799,
    name: "Логистический менеджмент",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 820,
    name: "Маркетинг некоммерческих организаций",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 829,
    name: "Маркетинговый аудит",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 830,
    name: "Маркетинговый менеджмент",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 1953,
    name: "Рекламный менеджмент",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 1994,
    name: "Сегментация рынка и позиционирование товара",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 2138,
    name: "Современный стратегический анализ",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 2266,
    name: "Стратегический маркетинг",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 2632,
    name: "Управление качеством и конкурентоспособностью товара",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 2682,
    name: "Управленческая экономика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 401,
    name: "Инвестиционный менеджмент",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 644,
    name: "Кадровый менеджмент",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 745,
    name: "Корпоративное управление",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 942,
    name: "Менеджмент организаций",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 1536,
    name: "Оценка управленческой деятельности",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 2138,
    name: "Современный стратегический анализ",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 2233,
    name: "Способы конкурентной борьбы",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 2356,
    name: "Теория и практика делового администрирования",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 2548,
    name: "Технология принятия управленческих решений",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 2623,
    name: "Управление изменениями",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 2682,
    name: "Управленческая экономика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 2683,
    name: "Управленческий консалтинг",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.02.02",
    shifr: 3007,
    name: "Эффективный менеджмент",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 209,
    name: "Венчурный бизнес: управление и контроль",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 315,
    name: "Диагностика и прогнозирование угроз экономической безопасности",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 637,
    name: "Кадровая безопасность",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 1337,
    name: "Организация и управление информационно-аналитическим обеспечением СЭБ предприятия",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 1338,
    name: "Организация и управление системой ЭБ предприятия",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 1659,
    name: "Правовое обеспечение безопасности предприятий",
    shifrKaf: 50,
    nameKaf: "хозяйственно-правовых дисциплин и процесса"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 2138,
    name: "Современный стратегический анализ",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 2233,
    name: "Способы конкурентной борьбы",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 2548,
    name: "Технология принятия управленческих решений",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 2675,
    name: "Управление экспертизой СЭБ",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 2682,
    name: "Управленческая экономика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 2683,
    name: "Управленческий консалтинг",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.02.04",
    shifr: 3007,
    name: "Эффективный менеджмент",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 401,
    name: "Инвестиционный менеджмент",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 760,
    name: "Кросс-культурный менеджмент",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 801,
    name: "Логистическое управление ВЭД",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 939,
    name: "Менеджмент ВЭД",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 1330,
    name: "Организация и техника внешнеэкономических отношений",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 1341,
    name: "Организация международного бизнеса",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 2138,
    name: "Современный стратегический анализ",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 2233,
    name: "Способы конкурентной борьбы",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 2548,
    name: "Технология принятия управленческих решений",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 2623,
    name: "Управление изменениями",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 2641,
    name: "Управление международной контрактной деятельностью",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 2682,
    name: "Управленческая экономика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 2683,
    name: "Управленческий консалтинг",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.08",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 496,
    name: "Информационные ресурсы и технологии в менеджменте",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 747,
    name: "Корпоративные финансы",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 1500,
    name: "Основы технических средств в таможенном контроле",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 1840,
    name: "Профессиональная этика государственного служащего",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 1997,
    name: "Сервис в околотаможенной сфере",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2022,
    name: "Системный анализ в таможенном деле",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2138,
    name: "Современный стратегический анализ",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2267,
    name: "Стратегический маркетинг таможенных услуг",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2298,
    name: "Таможенное администрирование",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2299,
    name: "Таможенное декларирование и таможенный контроль",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2303,
    name: "Таможенные услуги в международной цепи поставок товаров",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2305,
    name: "Таможенный менеджмент",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2634,
    name: "Управление качеством таможенных услуг",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2667,
    name: "Управление таможенным делом",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.02.09",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 152,
    name: "Безопасность проведения спортивно-зрелищных и массовых мероприятий",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 166,
    name: "Брендинг в сфере спорта",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 273,
    name: "Государственное управление в спорте",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 822,
    name: "Маркетинг спортивных товаров и услуг",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 931,
    name: "Международный опыт менеджмента спортивной индустрии",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 944,
    name: "Менеджмент спортивных мероприятий",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 945,
    name: "Менеджмент спортивных организаций",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 988,
    name: "Методология и методы научных исследований в менеджменте",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 1668,
    name: "Правовое регулирование спорта",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 2138,
    name: "Современный стратегический анализ",
    shifrKaf: 6,
    nameKaf: "маркетинга"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 2665,
    name: "Управление спортивными сооружениями и культурно-оздоровительными комплексами",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 2682,
    name: "Управленческая экономика",
    shifrKaf: 24,
    nameKaf: "менеджмента и экономической безопасности"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 2805,
    name: "Финансовый менеджмент в спортивной организации",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.02.10",
    shifr: 2874,
    name: "Экономика индустрии спорта",
    shifrKaf: 5,
    nameKaf: "истории спорта и спортивной индустрии"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 50,
    name: "Актуальные проблемы в управлении персоналом",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 99,
    name: "Антикризисное управление персоналом",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 443,
    name: "Институциональные основы управления человеческими ресурсами в организации",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 638,
    name: "Кадровая безопасность предприятия",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 640,
    name: "Кадровая стратегия и кадровая политика",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 779,
    name: "Лидерство и руководство в управлении человеческими ресурсами",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 2037,
    name: "Системы мотивации и стимулирования трудовой деятельности",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 2127,
    name: "Современные технологии управления персоналом",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 2151,
    name: "Социальная ответственность",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 2480,
    name: "Технологии оценки человеческих ресурсов",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 2495,
    name: "Технологии управления конфликтами и стрессами",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 2497,
    name: "Технологии управления развитием персонала",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 2646,
    name: "Управление персоналом организаций",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 8,
    nameKaf: "управления персоналом и экономической теории"
  }, {
    shifrProf: "38.04.03.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 299,
    name: "Деловодство и кадровый учет в государственной системе управления",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 639,
    name: "Кадровая политика в органах государственной власти и местного самоуправления",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 724,
    name: "Контроль и надзор в государственном и муниципальном управлении",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 1076,
    name: "Механизмы разрешения конфликтов в системе государственного и муниципального управления",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 1588,
    name: "Планирование и оценка бюджетных расходов",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 1840,
    name: "Профессиональная этика государственного служащего",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 2314,
    name: "Теневая экономика",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 2352,
    name: "Теория и механизмы, правовое обеспечение государственного и муниципального управления",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 2481,
    name: "Технологии планирования и прогнозирования социально-экономического развития территорий",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 2612,
    name: "Управление городским хозяйством",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 2613,
    name: "Управление государственными и муниципальными закупками",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 2624,
    name: "Управление инвестиционными и инновационным развитием региона",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 2658,
    name: "Управление рисками в государственной системе управления",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 2687,
    name: "Управленческое консультирование государственных и некоммерческих организаций",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 49,
    nameKaf: "государственного управления"
  }, {
    shifrProf: "38.04.04.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 39,
    name: "Адаптивные модели в экономике",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 71,
    name: "Актуарные расчеты",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 157,
    name: "Бизнес-анализ",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 402,
    name: "Инженерия знаний и проектирования баз знаний",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 503,
    name: "Информационные системы в управлении производственной деятельностью предприятия",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 844,
    name: "Математические методы и модели рыночной экономики",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 1203,
    name: "Нейро-нечеткие технологии моделирования экономических систем",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 1208,
    name: "Нелинейный анализ и прогнозирование финансовых рынков",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 2017,
    name: "Системно-динамическое моделирование",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 2392,
    name: "Теория принятия решений",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 2608,
    name: "Управление бизнес процессами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 2660,
    name: "Управление риском в реальном секторе экономики",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.05.01",
    shifr: 3006,
    name: "Эффективность информационных систем",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 68,
    name: "Актуальные проблемы финансов",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 83,
    name: "Анализ и прогнозирование финансовых процессов",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 748,
    name: "Корпоративные финансы (продвинутый уровень)",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 1173,
    name: "Налоговое планирование и налоговая оптимизация",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 1916,
    name: "Развитие систем страхования и страхового рынка",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2133,
    name: "Современный банкинг",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2151,
    name: "Социальная ответственность",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2672,
    name: "Управление финансовыми рисками",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2788,
    name: "Финансовая безопасность",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2792,
    name: "Финансовая стратегия",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2795,
    name: "Финансовые и денежно-кредитные методы регулирования экономики",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2798,
    name: "Финансовые рынки и финансово-кредитные институты",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2800,
    name: "Финансовый анализ (продвинутый уровень)",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.01",
    shifr: 2803,
    name: "Финансовый менеджмент (продвинутый уровень)",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 68,
    name: "Актуальные проблемы финансов",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 83,
    name: "Анализ и прогнозирование финансовых процессов",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 143,
    name: "Банковские системы зарубежных стран",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 144,
    name: "Банковский менеджмент",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 1596,
    name: "Платежные системы",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2133,
    name: "Современный банкинг",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2151,
    name: "Социальная ответственность",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2672,
    name: "Управление финансовыми рисками",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2788,
    name: "Финансовая безопасность",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2795,
    name: "Финансовые и денежно-кредитные методы регулирования экономики",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2798,
    name: "Финансовые рынки и финансово-кредитные институты",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2800,
    name: "Финансовый анализ (продвинутый уровень)",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2803,
    name: "Финансовый менеджмент (продвинутый уровень)",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "38.04.08.02",
    shifr: 2804,
    name: "Финансовый менеджмент в коммерческом банке",
    shifrKaf: 57,
    nameKaf: "финансов и кредита"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 840,
    name: "Математические методы в гуманитарных науках",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 966,
    name: "Методика преподавания социологии в высшей школе и сфере дополнительного образования",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 1358,
    name: "Организация работы социологической службы",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 1678,
    name: "Правовые основы управления",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 1866,
    name: "Психологические основы управления",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 1873,
    name: "Психология высшей школы",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2060,
    name: "Современная зарубежная социология",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2091,
    name: "Современные методы социологических исследований",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2182,
    name: "Социологические и психологические модели конфликтов и методы их разрешения",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2183,
    name: "Социологические концепции управления организационным развитием и государственная служба",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2184,
    name: "Социологический анализ социальных сетей",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2186,
    name: "Социологическое обеспечение связей с общественностью",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2187,
    name: "Социологическое сопровождение политических процессов и проектной деятельности",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2189,
    name: "Социология глобальных процессов",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2204,
    name: "Социология пространства и социальная стратификация",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2688,
    name: "Управленческое консультирование и информационно-аналитическая работа",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "39.04.01.01",
    shifr: 2809,
    name: "Фокус-группы: методология, методика, практика",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 430,
    name: "Инновационные технологии социальной работы",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 629,
    name: "История, методология и технологии социальной работы",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 652,
    name: "Квалитология в социальной работе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 736,
    name: "Концептуальные основы современного социального государства и социальное право",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 821,
    name: "Маркетинг социальной сферы и регионального рынка труда",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 840,
    name: "Математические методы в гуманитарных науках",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 991,
    name: "Методология и техника исследований в социальной работе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 1281,
    name: "Объектно- и субъектно-ориентированные CASE-технологии в социальной работе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 1747,
    name: "Проблемы менеджмента в социальной работе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 1873,
    name: "Психология высшей школы",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 1902,
    name: "Психотехнологии в социальной работе в экстремальных и кризисных ситуациях",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 2150,
    name: "Социальная культура",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 2166,
    name: "Социальное моделирование, проектирование, программирование и прогнозирование",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 2173,
    name: "Социально-технологическая культура персонала социального учреждения",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 2359,
    name: "Теория и практика управления в социальной работе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 414,
    name: "Инновации в социальной работе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 629,
    name: "История, методология и технологии социальной работы",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 721,
    name: "Консультирование и посредничество в социальной работе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 733,
    name: "Конфликтология в теории и практике социальной работы",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 840,
    name: "Математические методы в гуманитарных науках",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 1004,
    name: "Методология социальных исследований в социальной работе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 1873,
    name: "Психология высшей школы",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 2145,
    name: "Социальная защита населения",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 2150,
    name: "Социальная культура",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 2160,
    name: "Социальная работа: маркетинговый подход",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 2166,
    name: "Социальное моделирование, проектирование, программирование и прогнозирование",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 2168,
    name: "Социальное партнерство и межсекторное взаимодействие в системе социальной защиты населения",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 2170,
    name: "Социально-ориентированные программы в регионе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 2178,
    name: "Социальный контроль, социальная экспертиза и квалитология в социальной работе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 2360,
    name: "Теория и практика управления и развитие профессиогенеза сотрудников в социальной работе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.02.03",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 628,
    name: "История, методология и технологии работы с молодежью",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 840,
    name: "Математические методы в гуманитарных науках",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 985,
    name: "Методология и методы комплексных исследований молодежи",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1135,
    name: "Моделирование, проектирование, программирование и прогнозирование в работе с молодежью",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1186,
    name: "Научно-исследовательский практикум",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1413,
    name: "Основы личностного консультирования молодежи",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1497,
    name: "Основы теории организации социального управления",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1575,
    name: "Перспективы и программы развития молодежи в регионе",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1745,
    name: "Проблемы и теории социального развития молодежи",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1873,
    name: "Психология высшей школы",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1883,
    name: "Психология и социология молодежи",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 1889,
    name: "Психология одаренности и социально-педагогические технологии работы с талантливой молодежью",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 2125,
    name: "Современные технологии сопровождения молодежи на этапе построения карьеры.",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 2150,
    name: "Социальная культура",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 2487,
    name: "Технологии психологической помощи молодежи в кризисных и экстремальных ситуациях",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 2488,
    name: "Технологии работы с объединениями и организациями молодежи",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 2600,
    name: "Убеждающая коммуникация в социальных практиках",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "39.04.03.01",
    shifr: 3008,
    name: "Ювенальная политика и законодательство",
    shifrKaf: 77,
    nameKaf: "социальной работы и организации работы с молодежью"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 59,
    name: "Актуальные проблемы предупреждения современной преступности",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 65,
    name: "Актуальные проблемы судоустройства",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 67,
    name: "Актуальные проблемы уголовного права и процесса",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 216,
    name: "Виды доказательств в уголовном процессе",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 228,
    name: "Восстановительное правосудие и альтернативы уголовной ответственности",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 380,
    name: "Защита прав интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 439,
    name: "Иностранный язык в сфере юриспруденции",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 442,
    name: "Институт обжалования и пересмотра судебных решений в уголовном процессе",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 580,
    name: "История и методология юридической науки",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 916,
    name: "Международное экономическое право",
    shifrKaf: 50,
    nameKaf: "хозяйственно-правовых дисциплин и процесса"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 963,
    name: "Методика преподавания правовых дисциплин",
    shifrKaf: 51,
    nameKaf: "конституционного и муниципального права"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 1027,
    name: "Методы и формы научно-правового познания",
    shifrKaf: 51,
    nameKaf: "конституционного и муниципального права"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 1376,
    name: "Основные концепции криминологической науки",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 1670,
    name: "Правовое регулирование труда судей и сотрудников правоохранительных органов",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 1742,
    name: "Проблемы борьбы с незаконным оборотом наркотиков",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 2238,
    name: "Сравнительное правоведение",
    shifrKaf: 47,
    nameKaf: "международно-правовых дисциплин"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 2287,
    name: "Судебная экспертиза",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.01",
    shifr: 2777,
    name: "Философия права",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 51,
    name: "Актуальные проблемы гражданского права и процесса",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 53,
    name: "Актуальные проблемы интеллектуальной собственности",
    shifrKaf: 48,
    nameKaf: "права интеллектуальной собственности и инноватики"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 58,
    name: "Актуальные проблемы обязательственного права",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 69,
    name: "Актуальные теоретические и методологические проблемы гражданского права",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 439,
    name: "Иностранный язык в сфере юриспруденции",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 580,
    name: "История и методология юридической науки",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 916,
    name: "Международное экономическое право",
    shifrKaf: 50,
    nameKaf: "хозяйственно-правовых дисциплин и процесса"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 963,
    name: "Методика преподавания правовых дисциплин",
    shifrKaf: 51,
    nameKaf: "конституционного и муниципального права"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 1664,
    name: "Правовое обеспечение развития информационных систем",
    shifrKaf: 50,
    nameKaf: "хозяйственно-правовых дисциплин и процесса"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 1669,
    name: "Правовое регулирование труда в рыночных отношениях",
    shifrKaf: 47,
    nameKaf: "международно-правовых дисциплин"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 1681,
    name: "Практика применения судами трудового законодательства",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 1743,
    name: "Проблемы гражданского договорного права",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 1744,
    name: "Проблемы жилищного и наследственного права",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 1748,
    name: "Проблемы наследственного права",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 2238,
    name: "Сравнительное правоведение",
    shifrKaf: 47,
    nameKaf: "международно-правовых дисциплин"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 2287,
    name: "Судебная экспертиза",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 2777,
    name: "Философия права",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "40.04.01.02",
    shifr: 2826,
    name: "Цивилистическая теория защиты прав",
    shifrKaf: 52,
    nameKaf: "правоведения"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 131,
    name: "Аудит политической системы",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 269,
    name: "Государственная политика",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 437,
    name: "Иностранный язык в профессиональной сфере (английский)",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 464,
    name: "Интеллектуальный анализ в политических исследованиях",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 841,
    name: "Математические методы в политических исследованиях",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 962,
    name: "Методика преподавания политологии",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 989,
    name: "Методология и организация исследовательской работы политолога",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 1436,
    name: "Основы организации управленческой деятельности. Политическое управление",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 1628,
    name: "Политическая рискология",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 1632,
    name: "Политическая текстология: теория, методология, методика анализа",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 1641,
    name: "Политическое проектирование",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 1932,
    name: "Региональные политические процессы",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 2482,
    name: "Технологии политического медиаторства",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 2501,
    name: "Технологии формирования политического имиджа",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 2516,
    name: "Технологическое измерение политических ошибок",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.04.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 224,
    name: "Военная сила в мировой политике",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 577,
    name: "История и методология современного комплексного регионоведения",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 897,
    name: "Мегатренды мирового развития и современные глобальные проблемы",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 916,
    name: "Международное экономическое право",
    shifrKaf: 47,
    nameKaf: "международно-правовых дисциплин"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 921,
    name: "Международные системы и глобальное развитие",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 952,
    name: "Методика и организация научных исследований",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1436,
    name: "Основы организации управленческой деятельности. Политическое управление",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1459,
    name: "Основы профессиональной коммуникации (английский)",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1460,
    name: "Основы профессиональной коммуникации (второй иностранный язык)",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1462,
    name: "Основы профессиональной коммуникации (третий иностранный язык)",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1623,
    name: "Политическая идентификация разных народов",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1679,
    name: "Практика перевода",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 1931,
    name: "Региональные подсистемы международных отношений в XXI веке",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 2351,
    name: "Теория и методы анализа внешней политики",
    shifrKaf: 2,
    nameKaf: "политологии и международных отношений"
  }, {
    shifrProf: "41.04.05.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 264,
    name: "Глобализационные процессы и СМИ",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 307,
    name: "Деонтология журналистики",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 365,
    name: "Журналист в экстремальных ситуациях",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 367,
    name: "Журналистика как социокультурный феномен",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 491,
    name: "Информационно-коммуникационные технологии в научных исследованиях и профессиональной деятельности",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 534,
    name: "Информация в медиакоммуникациях",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 951,
    name: "Методика и методология исследований в СМИ и ИБД",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 1273,
    name: "Общее народоведение и СМИ",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 1374,
    name: "Освещение военных конфликтов в СМИ",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 1618,
    name: "Полиграфическое производство",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 1625,
    name: "Политическая проблематика в СМИ",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 1824,
    name: "Проектная деятельность",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 1948,
    name: "Редакторская работа с иноязычными текстами СМИ",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 2134,
    name: "Современный медиатекст",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 2144,
    name: "Социальная журналистика",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 2184,
    name: "Социологический анализ социальных сетей",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 2848,
    name: "Экожурналистика",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 2895,
    name: "Экономическая проблематика в СМИ",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.02.01",
    shifr: 3013,
    name: "Язык и стиль СМИ и ИБД",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 52,
    name: "Актуальные проблемы издательского дела",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 171,
    name: "Бухгалтерский учет и аудит в издательской сфере",
    shifrKaf: 99,
    nameKaf: "учета и аудита"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 365,
    name: "Журналист в экстремальных ситуациях",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 388,
    name: "Издательское планирование и управление издательским портфелем",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 491,
    name: "Информационно-коммуникационные технологии в научных исследованиях и профессиональной деятельности",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 534,
    name: "Информация в медиакоммуникациях",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 951,
    name: "Методика и методология исследований в СМИ и ИБД",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1273,
    name: "Общее народоведение и СМИ",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1618,
    name: "Полиграфическое производство",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1824,
    name: "Проектная деятельность",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1936,
    name: "Редактирование газетно-журнальных изданий",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1938,
    name: "Редактирование интернет-изданий",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1939,
    name: "Редактирование книжных изданий",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1940,
    name: "Редактирование на радио и телевидении",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1943,
    name: "Редактирование рекламных изданий",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 1947,
    name: "Редакторская работа с иноязычными текстами",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 2134,
    name: "Современный медиатекст",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 2184,
    name: "Социологический анализ социальных сетей",
    shifrKaf: 18,
    nameKaf: "социологии"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "42.04.03.01",
    shifr: 3013,
    name: "Язык и стиль СМИ и ИБД",
    shifrKaf: 15,
    nameKaf: "журналистики"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 97,
    name: "Антикризисное управление в туристической отрасли (продвинутый уровень)",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 155,
    name: "Безопасность туризма",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 425,
    name: "Инновационные технологии в туризме",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 735,
    name: "Концептуальные основы профессионального туристского образования",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 739,
    name: "Концепции устойчивого развития туризма",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 769,
    name: "Курортология",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 1661,
    name: "Правовое обеспечение деятельности в туристской индустрии",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 1756,
    name: "Прогнозирование, планирование, анализ и экспертиза в туризме и сервисе",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 1956,
    name: "Рекреология",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 2494,
    name: "Технологии туристко-рекреационного проектирования и освоения территорий",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 2593,
    name: "Туристский рынок",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 2631,
    name: "Управление качеством гостиничных и туристских услуг",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "43.04.02.01",
    shifr: 2913,
    name: "Экскурсология",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 97,
    name: "Антикризисное управление в туристической отрасли (продвинутый уровень)",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 346,
    name: "Документационное обеспечение управление гостиничным предприятием",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 425,
    name: "Инновационные технологии в туризме",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 735,
    name: "Концептуальные основы профессионального туристского образования",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 1334,
    name: "Организация и технология предоставления дополнительных услуг в средствах размещения",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 1350,
    name: "Организация предпринимательской деятельности в гостиничной индустрии",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 1660,
    name: "Правовое обеспечение гостиничной деятельности",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 1756,
    name: "Прогнозирование, планирование, анализ и экспертиза в туризме и сервисе",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 2263,
    name: "Стратегии развития предприятий индустрии гостеприимства",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 2560,
    name: "Технология формирования и продвижения гостиничного продукта",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 2593,
    name: "Туристский рынок",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 2631,
    name: "Управление качеством гостиничных и туристских услуг",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 2644,
    name: "Управление персоналом гостиничного предприятия",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 2651,
    name: "Управление проектами",
    shifrKaf: 46,
    nameKaf: "экономической кибернетики и прикладной статистики"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 83,
    nameKaf: "туризма и гостиничного хозяйства"
  }, {
    shifrProf: "43.04.03.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 322,
    name: "Дидактика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 357,
    name: "Духовно-нравственное воспитание в высшей школе",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 467,
    name: "Интеллигентоведение",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 491,
    name: "Информационно-коммуникационные технологии в научных исследованиях и профессиональной деятельности",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 559,
    name: "История возникновения и развития высшего образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 763,
    name: "Культура взаимодействия преподавателя и студентов в образовательном пространстве высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 938,
    name: "Менеджмент в системе высшего образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 986,
    name: "Методология и методы научно-педагогического исследования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 1002,
    name: "Методология разработки и реализации содержания высшего профессионального образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 1275,
    name: "Общие основы педагогики высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 1552,
    name: "Педагогическая антропология",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 1781,
    name: "Проектирование в высшем профессиональном образовании",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 2105,
    name: "Современные проблемы науки и образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 2312,
    name: "Тенденции развития высшего образования в развитых странах мира",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 2343,
    name: "Теория и методика воспитания личности в высшей школе",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 2346,
    name: "Теория и методика личностно-ориентированного образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 467,
    name: "Интеллигентоведение",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 491,
    name: "Информационно-коммуникационные технологии в научных исследованиях и профессиональной деятельности",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 986,
    name: "Методология и методы научно-педагогического исследования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 1002,
    name: "Методология разработки и реализации содержания высшего профессионального образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 1146,
    name: "Мониторинг в системе образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 1552,
    name: "Педагогическая антропология",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 1814,
    name: "Проектирование современных образовательных систем",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2094,
    name: "Современные образовательные системы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2105,
    name: "Современные проблемы науки и образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2126,
    name: "Современные технологии управления образовательными организациями",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2313,
    name: "Тенденция развития образовательных систем в современном мире",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2321,
    name: "Теоретические основы педагогического проектирования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2346,
    name: "Теория и методика личностно-ориентированного образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2645,
    name: "Управление персоналом образовательной организации",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "44.04.01.02",
    shifr: 2996,
    name: "Этика управления образовательными системами",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 428,
    name: "Инновационные технологии обучения в профессиональном образовании",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 467,
    name: "Интеллигентоведение",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 491,
    name: "Информационно-коммуникационные технологии в научных исследованиях и профессиональной деятельности",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 576,
    name: "История и методология педагогической науки",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 766,
    name: "Культура педагогического взаимодействия в системе профессионального образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 792,
    name: "Личностно-ориентированные технологии профессиональной деятельности",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 990,
    name: "Методология и организация научно-педагогических исследований",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 1148,
    name: "Мониторинг профессионального образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 1553,
    name: "Педагогическая конфликтология",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 1558,
    name: "Педагогическое проектирование в профессиональном образовании",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 1845,
    name: "Профессионально-педагогическая риторика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 2097,
    name: "Современные педагогические технологии воспитания в профессиональном образовании",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 2110,
    name: "Современные проблемы профессионального образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 2346,
    name: "Теория и методика личностно-ориентированного образования",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "44.04.04.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 60,
    name: "Актуальные проблемы современного литературоведения",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 62,
    name: "Актуальные проблемы современного языкознания",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 491,
    name: "Информационно-коммуникационные технологии в научных исследованиях и профессиональной деятельности",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 513,
    name: "Информационные технологии",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 790,
    name: "Литературный стиль",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 840,
    name: "Математические методы в гуманитарных науках",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 970,
    name: "Методика преподавания филологических дисциплин в высшем учебном заведении",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 987,
    name: "Методология и методы научных исследований",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 1187,
    name: "Научно-исследовательский семинар",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 1746,
    name: "Проблемы исследования языковой личности авторов текстов различных типов",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 1750,
    name: "Проблемы региональной ономастики",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 2067,
    name: "Современное жанроведение",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 2306,
    name: "Текст. Стиль. Дискурс",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 2377,
    name: "Теория литературы",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 66,
    name: "Актуальные проблемы теории и практики перевода",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 361,
    name: "Жанровые теории перевода",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 600,
    name: "История перевода",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 784,
    name: "Лингводидактика. Методика преподавания иностранного языка и перевода в высших учебных заведениях",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 1523,
    name: "Особенности перевода художественных произведений и их редактирование",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 1680,
    name: "Практика перевода (основной иностранный язык)",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 1689,
    name: "Практикум по культуре речевого общения (второй иностранный язык)",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 1690,
    name: "Практикум по культуре речевого общения (основной иностранный язык)",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 2216,
    name: "Специальная подготовка",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 2237,
    name: "Сравнительная типология",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 2389,
    name: "Теория перевода",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 17,
    nameKaf: "теории и практики перевода германских и романских языков"
  }, {
    shifrProf: "45.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 54,
    name: "Актуальные проблемы истории казачества",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 55,
    name: "Актуальные проблемы историографии истории России",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 56,
    name: "Актуальные проблемы исторических исследований",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 350,
    name: "Донбасс как объект туристско-экскурсионной деятельности",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 489,
    name: "Информационно-коммуникативные технологии в научных исследованиях и профессиональной деятельности",
    shifrKaf: 21,
    nameKaf: "компьютерных систем и сетей"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 550,
    name: "Историческая антропология",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 562,
    name: "История государственно-конфессиональных отношений в современной России",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 610,
    name: "История России в контексте мировых цивилизаций",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 635,
    name: "Источниковедение истории Отечества",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 840,
    name: "Математические методы в гуманитарных науках",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 902,
    name: "Междисциплинарные подходы в современной исторической науке",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 960,
    name: "Методика преподавания истории в высшей школе",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 984,
    name: "Методология и методика исторического исследования",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 2063,
    name: "Современная история России",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 2363,
    name: "Теория и риторика научного текста",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 75,
    nameKaf: "отечественной и всеобщей истории"
  }, {
    shifrProf: "46.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 108,
    name: "Архивный менеджмент",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 347,
    name: "Документационное обеспечение управления проектами",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 502,
    name: "Информационные системы в управлении архивных учреждений",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 522,
    name: "Информационные технологии в современной архивной деятельности",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 533,
    name: "Информационный менеджмент",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 634,
    name: "Источниковедение и историография документоведения и архивоведения",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 1068,
    name: "Метрология в архивном деле",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 1243,
    name: "Обеспечение сохранности архивного фонда",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 1311,
    name: "Организационно-информационное обеспечение деятельности руководителя архивных учреждений",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 1324,
    name: "Организация и документирование деятельности архивной службы",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 1404,
    name: "Основы кадровой стратегии и кадровой политики",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 1542,
    name: "Палеография",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 2071,
    name: "Современные архивные системы",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 2245,
    name: "Стандартизация документационного обеспечения архивного дела",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 2404,
    name: "Теория современного документоведения и архивоведения",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.02",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 345,
    name: "Документационное обеспечение деятельности организации",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 347,
    name: "Документационное обеспечение управления проектами",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 501,
    name: "Информационные системы в управлении",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 527,
    name: "Информационные технологии для автоматизации делопроизводства в органах государственной власти",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 533,
    name: "Информационный менеджмент",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 634,
    name: "Источниковедение и историография документоведения и архивоведения",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 730,
    name: "Конфиденциальное делопроизводство",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 1132,
    name: "Моделирование управленческой деятельности",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 1310,
    name: "Организационно-информационное обеспечение деятельности руководителя",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 1323,
    name: "Организация и документирование в деятельности государственной службы",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 1331,
    name: "Организация и технологии документационного обеспечения государственного управления",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 1404,
    name: "Основы кадровой стратегии и кадровой политики",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 2247,
    name: "Стандартизация документационного обеспечения управления органов государственной власти",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 2272,
    name: "Стратегия кадрового обеспечения государственной службы",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 2404,
    name: "Теория современного документоведения и архивоведения",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 73,
    nameKaf: "документоведения и технотронной информологии"
  }, {
    shifrProf: "46.04.02.03",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 359,
    name: "Духовно-нравственный потенциал культуры и цивилизации",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 840,
    name: "Математические методы в гуманитарных науках",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 971,
    name: "Методика преподавания философских дисциплин",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 1205,
    name: "Неклассическая логика в контексте современного мышления",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 1221,
    name: "Новейшие тенденции современной мировой философии",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 1700,
    name: "Практическая философия",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 1873,
    name: "Психология высшей школы",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 1960,
    name: "Религия и политика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 2355,
    name: "Теория и практика аргументации",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 2768,
    name: "Философия искусства",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 2772,
    name: "Философия культуры: основные модели культур ХХI в.",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 2774,
    name: "Философия массового сознания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 2779,
    name: "Философия сакрального",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 2781,
    name: "Философская антропология ХХ в. основные идеи и концепции",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 2782,
    name: "Философская риторика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 61,
    name: "Актуальные проблемы современного религиоведения",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 88,
    name: "Аналитика православной культуры и цивилизации",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 606,
    name: "История религиоведения",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 659,
    name: "Классические языки",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 840,
    name: "Математические методы в гуманитарных науках",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 964,
    name: "Методика преподавания религиоведения",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1236,
    name: "Нравственное богословие",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1478,
    name: "Основы сакральной психологии и педагогики",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1671,
    name: "Правовые (хозяйственные и административные) основы деятельности церквей",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1873,
    name: "Психология высшей школы",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1958,
    name: "Религиоведение в системе гуманитарного образования и Русского мира",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1959,
    name: "Религиозно-философская антропология",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 1960,
    name: "Религия и политика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 2149,
    name: "Социальная концепция РПЦ",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 2235,
    name: "Сравнительная история конфессий",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "47.04.03.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 63,
    name: "Актуальные проблемы современной теологии",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 123,
    name: "Аскетика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 566,
    name: "История Западных конфессий",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 578,
    name: "История и методология теологии",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 659,
    name: "Классические языки",
    shifrKaf: 61,
    nameKaf: "славянской филологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 840,
    name: "Математические методы в гуманитарных науках",
    shifrKaf: 23,
    nameKaf: "прикладной математики"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 967,
    name: "Методика преподавания теологии",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1236,
    name: "Нравственное богословие",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1375,
    name: "Основное богословие и апологетика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1478,
    name: "Основы сакральной психологии и педагогики",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1671,
    name: "Правовые (хозяйственные и административные) основы деятельности церквей",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1873,
    name: "Психология высшей школы",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1959,
    name: "Религиозно-философская антропология",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 1993,
    name: "Священные тексты религий мира",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 2149,
    name: "Социальная концепция РПЦ",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "48.04.01.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 38,
    name: "Адаптивная двигательная рекреация и реабилитация",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 133,
    name: "АФК в специальных учреждениях",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 281,
    name: "Государственный экзамен",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 411,
    name: "Инклюзивное и адаптивное физическое воспитание в учреждениях общего и профессионального образования",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 436,
    name: "Иностранный язык в профессиональной сфере",
    shifrKaf: 13,
    nameKaf: "иностранных языков"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 807,
    name: "Магистерская диссертация",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 1184,
    name: "Научно-исследовательская работа",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 1466,
    name: "Основы профилактики, реабилитации, кинезотерапии",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 1551,
    name: "Педагогика высшей школы",
    shifrKaf: 72,
    nameKaf: "педагогики"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 1649,
    name: "Построение индивидуальных программ физической реабилитации",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 1709,
    name: "Преддипломная практика",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 1827,
    name: "Производственная практика",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 1873,
    name: "Психология высшей школы",
    shifrKaf: 3,
    nameKaf: "психологии"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 2100,
    name: "Современные проблемы АФК",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 2328,
    name: "Теории обучения движению лиц с патологиями",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 2704,
    name: "Учебная практика",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 2737,
    name: "Физиологические механизмы адаптации у лиц с ОФВ",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 2748,
    name: "Физическая реабилитация (терапия) в педиатрии",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 2749,
    name: "Физическая реабилитация (терапия) костно-мышечных функций",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 2750,
    name: "Физическая реабилитация (терапия) неврологических заболеваний",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 2751,
    name: "Физическая реабилитация (терапия) при респираторных и сердечно-сосудистых заболеваниях",
    shifrKaf: 82,
    nameKaf: "проблем человека и философии здоровья"
  }, {
    shifrProf: "49.04.02.01",
    shifr: 2786,
    name: "Философские проблемы научного познания",
    shifrKaf: 60,
    nameKaf: "мировой философии и теологии"
  }
];
