let faclist=[{
    shifr: "АР",
    kind: "институт",
    name: "строительства, архитектуры и жилищно-коммунального хозяйства",
    dekan: "Андрийчук Н.Д.",
    city: "Луганск"
  }, {
    shifr: "ГЗ",
    kind: "институт",
    name: "гражданской защиты",
    dekan: "Малкин В.Ю.",
    city: "Луганск"
  }, {
    shifr: "ГТ",
    kind: "институт",
    name: "философии и социально-политических наук",
    dekan: "Скляр П.П.",
    city: "Луганск"
  }, {
    shifr: "ИМ",
    kind: "институт",
    name: "технологий и инженерной механики",
    dekan: "Могильная Е.П.",
    city: "Луганск"
  }, {
    shifr: "СТ",
    kind: "институт",
    name: "горных и образовательных технологий",
    dekan: "Авершин А.А.",
    city: "Стаханов"
  }, {
    shifr: "ТЛ",
    kind: "институт",
    name: "транспорта и логистики",
    dekan: "Быкадоров В.В.",
    city: "Луганск"
  }, {
    shifr: "ЮИ",
    kind: "институт",
    name: "юриспруденции и международного права",
    dekan: "Лазор Л.И.",
    city: "Луганск"
  }, {
    shifr: "АН",
    kind: "факультет",
    name: "горного дела и транспорта",
    dekan: "Крохмалева Е.Г.",
    city: "Антрацит"
  }, {
    shifr: "ГУ",
    kind: "факультет",
    name: "государственного управления",
    dekan: "Родионов А.В.",
    city: "Луганск"
  }, {
    shifr: "ЕН",
    kind: "факультет",
    name: "естественных наук",
    dekan: "Черных В.И.",
    city: "Луганск"
  }, {
    shifr: "ИТ",
    kind: "факультет",
    name: "компьютерных систем и информационных технологий",
    dekan: "Кочевский А.А.",
    city: "Луганск"
  }, {
    shifr: "КР",
    kind: "факультет",
    name: "инженерии и менеджмента",
    dekan: "Панайотов К.К.",
    city: "Краснодон"
  }, {
    shifr: "УП",
    kind: "факультет",
    name: "управления",
    dekan: "Болдырев К.А.",
    city: "Луганск"
  }, {
    shifr: "ФЛ",
    kind: "факультет",
    name: "филологии и массовых коммуникаций",
    dekan: "Нередкова С.С.",
    city: "Луганск"
  }, {
    shifr: "ФС",
    kind: "факультет",
    name: "физического и спортивного совершенствования",
    dekan: "Харьковский Р.Г.",
    city: "Луганск"
  }, {
    shifr: "ЭК",
    kind: "факультет",
    name: "экономический",
    dekan: "Тхор Е.С.",
    city: "Луганск"
  }, {
    shifr: "ЭТ",
    kind: "факультет",
    name: "электротехнических систем",
    dekan: "Тарасенко О.В.",
    city: "Луганск"
  }
];

