let naprBakList=[{
  shifrUGNP: "01.00.00",
  shifr: "01.03.02",
  name: "Прикладная математика и информатика"
},
{
  shifrUGNP: "01.00.00",
  shifr: "01.03.03",
  name: "Механика и математическое моделирование"
},
{
  shifrUGNP: "03.00.00",
  shifr: "03.03.02",
  name: "Физика"
},
{
  shifrUGNP: "05.00.00",
  shifr: "05.03.06",
  name: "Экология и природопользование"
},
{
  shifrUGNP: "09.00.00",
  shifr: "09.03.01",
  name: "Информатика и вычислительная техника"
},
{
  shifrUGNP: "09.00.00",
  shifr: "09.03.02",
  name: "Информационные системы и технологии"
},
{
  shifrUGNP: "09.00.00",
  shifr: "09.03.03",
  name: "Прикладная информатика"
},
{
  shifrUGNP: "09.00.00",
  shifr: "09.03.04",
  name: "Программная инженерия"
},
{
  shifrUGNP: "11.00.00",
  shifr: "11.03.04",
  name: "Электроника и наноэлектроника"
},
{
  shifrUGNP: "12.00.00",
  shifr: "12.03.01",
  name: "Приборостроение"
},
{
  shifrUGNP: "12.00.00",
  shifr: "12.03.04",
  name: "Биотехнические системы и технологии"
},
{
  shifrUGNP: "13.00.00",
  shifr: "13.03.02",
  name: "Электроэнергетика и электротехника"
},
{
  shifrUGNP: "13.00.00",
  shifr: "13.03.03",
  name: "Энергетическое машиностроение"
},
{
  shifrUGNP: "15.00.00",
  shifr: "15.03.01",
  name: "Машиностроение"
},
{
  shifrUGNP: "15.00.00",
  shifr: "15.03.02",
  name: "Технологические машины и оборудование"
},
{
  shifrUGNP: "15.00.00",
  shifr: "15.03.04",
  name: "Автоматизация технологических процессов и производств"
},
{
  shifrUGNP: "15.00.00",
  shifr: "15.03.05",
  name: "Конструкторско-технологическое обеспечение машиностроительных производств"
},
{
  shifrUGNP: "15.00.00",
  shifr: "15.03.06",
  name: "Мехатроника и робототехника"
},
{
  shifrUGNP: "20.00.00",
  shifr: "20.03.01",
  name: "Техносферная безопасность"
},
{
  shifrUGNP: "22.00.00",
  shifr: "22.03.01",
  name: "Материаловедение и технологии материалов"
},
{
  shifrUGNP: "22.00.00",
  shifr: "22.03.02",
  name: "Металлургия"
},
{
  shifrUGNP: "23.00.00",
  shifr: "23.03.01",
  name: "Технология транспортных процессов"
},
{
  shifrUGNP: "23.00.00",
  shifr: "23.03.02",
  name: "Наземные транспортно-технологические комплексы"
},
{
  shifrUGNP: "23.00.00",
  shifr: "23.03.03",
  name: "Эксплуатация транспортно-технологических машин и комплексов"
},
{
  shifrUGNP: "27.00.00",
  shifr: "27.03.01",
  name: "Стандартизация и метрология"
},
{
  shifrUGNP: "29.00.00",
  shifr: "29.03.05",
  name: "Конструирование изделий легкой промышленности"
},
{
  shifrUGNP: "37.00.00",
  shifr: "37.03.01",
  name: "Психология"
},
{
  shifrUGNP: "37.00.00",
  shifr: "37.03.02",
  name: "Конфликтология"
},
{
  shifrUGNP: "38.00.00",
  shifr: "38.03.01",
  name: "Экономика"
},
{
  shifrUGNP: "38.00.00",
  shifr: "38.03.02",
  name: "Менеджмент"
},
{
  shifrUGNP: "38.00.00",
  shifr: "38.03.03",
  name: "Управление персоналом"
},
{
  shifrUGNP: "38.00.00",
  shifr: "38.03.05",
  name: "Бизнес-информатика"
},
{
  shifrUGNP: "39.00.00",
  shifr: "39.03.01",
  name: "Социология"
},
{
  shifrUGNP: "39.00.00",
  shifr: "39.03.02",
  name: "Социальная работа"
},
{
  shifrUGNP: "39.00.00",
  shifr: "39.03.03",
  name: "Организация работы с молодежью"
},
{
  shifrUGNP: "40.00.00",
  shifr: "40.03.01",
  name: "Юриспруденция"
},
{
  shifrUGNP: "41.00.00",
  shifr: "41.03.04",
  name: "Политология"
},
{
  shifrUGNP: "41.00.00",
  shifr: "41.03.05",
  name: "Международные отношения"
},
{
  shifrUGNP: "42.00.00",
  shifr: "42.03.02",
  name: "Журналистика"
},
{
  shifrUGNP: "42.00.00",
  shifr: "42.03.03",
  name: "Издательское дело"
},
{
  shifrUGNP: "43.00.00",
  shifr: "43.03.02",
  name: "Туризм"
},
{
  shifrUGNP: "43.00.00",
  shifr: "43.03.03",
  name: "Гостиничное дело"
},
{
  shifrUGNP: "44.00.00",
  shifr: "44.03.04",
  name: "Профессиональное обучение (по отраслям)"
},
{
  shifrUGNP: "45.00.00",
  shifr: "45.03.01",
  name: "Филология"
},
{
  shifrUGNP: "45.00.00",
  shifr: "45.03.02",
  name: "Лингвистика"
},
{
  shifrUGNP: "46.00.00",
  shifr: "46.03.01",
  name: "История"
},
{
  shifrUGNP: "46.00.00",
  shifr: "46.03.02",
  name: "Документоведение и архивоведение"
},
{
  shifrUGNP: "47.00.00",
  shifr: "47.03.01",
  name: "Философия"
},
{
  shifrUGNP: "49.00.00",
  shifr: "49.03.02",
  name: "Физическая культура для лиц с отклонениями в состоянии здоровья (адаптивная физическая культура)"
}];