let naprMagList=[{
  shifrUGNP: "01.00.00",
  shifr: "01.04.02",
  name: "Прикладная математика и информатика"
},
{
  shifrUGNP: "01.00.00",
  shifr: "01.04.03",
  name: "Механика и математическое моделирование"
},
{
  shifrUGNP: "03.00.00",
  shifr: "03.04.02",
  name: "Физика"
},
{
  shifrUGNP: "05.00.00",
  shifr: "05.04.06",
  name: "Экология и природопользование"
},
{
  shifrUGNP: "09.00.00",
  shifr: "09.04.01",
  name: "Информатика и вычислительная техника"
},
{
  shifrUGNP: "09.00.00",
  shifr: "09.04.02",
  name: "Информационные системы и технологии"
},
{
  shifrUGNP: "09.00.00",
  shifr: "09.04.03",
  name: "Прикладная информатика"
},
{
  shifrUGNP: "09.00.00",
  shifr: "09.04.04",
  name: "Программная инженерия"
},
{
  shifrUGNP: "11.00.00",
  shifr: "11.04.04",
  name: "Электроника и наноэлектроника"
},
{
  shifrUGNP: "12.00.00",
  shifr: "12.04.01",
  name: "Приборостроение"
},
{
  shifrUGNP: "12.00.00",
  shifr: "12.04.04",
  name: "Биотехнические системы и технологии"
},
{
  shifrUGNP: "13.00.00",
  shifr: "13.04.02",
  name: "Электроэнергетика и электротехника"
},
{
  shifrUGNP: "13.00.00",
  shifr: "13.04.03",
  name: "Энергетическое машиностроение"
},
{
  shifrUGNP: "15.00.00",
  shifr: "15.04.01",
  name: "Машиностроение"
},
{
  shifrUGNP: "15.00.00",
  shifr: "15.04.02",
  name: "Технологические машины и оборудование"
},
{
  shifrUGNP: "15.00.00",
  shifr: "15.04.04",
  name: "Автоматизация технологических процессов и производств"
},
{
  shifrUGNP: "15.00.00",
  shifr: "15.04.05",
  name: "Конструкторско-технологическое обеспечение машиностроительных производств"
},
{
  shifrUGNP: "15.00.00",
  shifr: "15.04.06",
  name: "Мехатроника и робототехника"
},
{
  shifrUGNP: "20.00.00",
  shifr: "20.04.01",
  name: "Техносферная безопасность"
},
{
  shifrUGNP: "22.00.00",
  shifr: "22.04.01",
  name: "Материаловедение и технологии материалов"
},
{
  shifrUGNP: "22.00.00",
  shifr: "22.04.02",
  name: "Металлургия"
},
{
  shifrUGNP: "23.00.00",
  shifr: "23.04.01",
  name: "Технология транспортных процессов"
},
{
  shifrUGNP: "23.00.00",
  shifr: "23.04.02",
  name: "Наземные транспортно-технологические комплексы"
},
{
  shifrUGNP: "23.00.00",
  shifr: "23.04.03",
  name: "Эксплуатация транспортно-технологических машин и комплексов"
},
{
  shifrUGNP: "27.00.00",
  shifr: "27.04.01",
  name: "Стандартизация и метрология"
},
{
  shifrUGNP: "27.00.00",
  shifr: "27.04.02",
  name: "Управление качеством"
},
{
  shifrUGNP: "27.00.00",
  shifr: "27.04.07",
  name: "Наукоемкие технологии и экономика инноваций"
},
{
  shifrUGNP: "27.00.00",
  shifr: "27.04.08",
  name: "Управление интеллектуальной собственностью"
},
{
  shifrUGNP: "29.00.00",
  shifr: "29.04.01",
  name: "Технология изделий лёгкой промышленности"
},
{
  shifrUGNP: "37.00.00",
  shifr: "37.04.01",
  name: "Психология"
},
{
  shifrUGNP: "37.00.00",
  shifr: "37.04.02",
  name: "Конфликтология"
},
{
  shifrUGNP: "38.00.00",
  shifr: "38.04.01",
  name: "Экономика"
},
{
  shifrUGNP: "38.00.00",
  shifr: "38.04.02",
  name: "Менеджмент"
},
{
  shifrUGNP: "38.00.00",
  shifr: "38.04.03",
  name: "Управление персоналом"
},
{
  shifrUGNP: "38.00.00",
  shifr: "38.04.04",
  name: "Государственное и муниципальное управление"
},
{
  shifrUGNP: "38.00.00",
  shifr: "38.04.05",
  name: "Бизнес-информатика"
},
{
  shifrUGNP: "38.00.00",
  shifr: "38.04.08",
  name: "Финансы и кредит"
},
{
  shifrUGNP: "39.00.00",
  shifr: "39.04.01",
  name: "Социология"
},
{
  shifrUGNP: "39.00.00",
  shifr: "39.04.02",
  name: "Социальная работа"
},
{
  shifrUGNP: "39.00.00",
  shifr: "39.04.03",
  name: "Организация работы с молодежью"
},
{
  shifrUGNP: "40.00.00",
  shifr: "40.04.01",
  name: "Юриспруденция"
},
{
  shifrUGNP: "41.00.00",
  shifr: "41.04.04",
  name: "Политология"
},
{
  shifrUGNP: "41.00.00",
  shifr: "41.04.05",
  name: "Международные отношения"
},
{
  shifrUGNP: "42.00.00",
  shifr: "42.04.02",
  name: "Журналистика"
},
{
  shifrUGNP: "42.00.00",
  shifr: "42.04.03",
  name: "Издательское дело"
},
{
  shifrUGNP: "43.00.00",
  shifr: "43.04.02",
  name: "Туризм"
},
{
  shifrUGNP: "43.00.00",
  shifr: "43.04.03",
  name: "Гостиничное дело"
},
{
  shifrUGNP: "44.00.00",
  shifr: "44.04.01",
  name: "Педагогическое образование"
},
{
  shifrUGNP: "44.00.00",
  shifr: "44.04.04",
  name: "Профессиональное обучение (по отраслям)"
},
{
  shifrUGNP: "45.00.00",
  shifr: "45.04.01",
  name: "Филология"
},
{
  shifrUGNP: "45.00.00",
  shifr: "45.04.02",
  name: "Лингвистика"
},
{
  shifrUGNP: "46.00.00",
  shifr: "46.04.01",
  name: "История"
},
{
  shifrUGNP: "46.00.00",
  shifr: "46.04.02",
  name: "Документоведение и архивоведение"
},
{
  shifrUGNP: "47.00.00",
  shifr: "47.04.01",
  name: "Философия"
},
{
  shifrUGNP: "47.00.00",
  shifr: "47.04.03",
  name: "Религиоведение"
},
{
  shifrUGNP: "48.00.00",
  shifr: "48.04.01",
  name: "Теология"
},
{
  shifrUGNP: "49.00.00",
  shifr: "49.04.02",
  name: "Физическая культура для лиц с отклонениями в состоянии здоровья (адаптивная физическая культура)"
}];
