let ugnpList=[{
  razdel: "МН",
  shifr: "01.00.00",
  name: "Математика и механика"
},
{
  razdel: "МН",
  shifr: "03.00.00",
  name: "Физика и астрономия"
},
{
  razdel: "МН",
  shifr: "05.00.00",
  name: "Науки о земле"
},
{
  razdel: "ТН",
  shifr: "09.00.00",
  name: "Информатика и вычислительная техника"
},
{
  razdel: "ТН",
  shifr: "10.00.00",
  name: "Информационная безопасность"
},
{
  razdel: "ТН",
  shifr: "11.00.00",
  name: "Электроника, радиотехника и системы связи"
},
{
  razdel: "ТН",
  shifr: "12.00.00",
  name: "Фотоника, приборостроение, оптические и биотехнические системы и технологии"
},
{
  razdel: "ТН",
  shifr: "13.00.00",
  name: "Электро- и теплоэнергетика"
},
{
  razdel: "ТН",
  shifr: "15.00.00",
  name: "Машиностроение"
},
{
  razdel: "ТН",
  shifr: "20.00.00",
  name: "Техносферная безопасность и природообустройство"
},
{
  razdel: "ТН",
  shifr: "21.00.00",
  name: "Прикладная геология, горное дело, нефтегазовое дело и геодезия"
},
{
  razdel: "ТН",
  shifr: "22.00.00",
  name: "Технологии материалов"
},
{
  razdel: "ТН",
  shifr: "23.00.00",
  name: "Техника и технологии наземного транспорта"
},
{
  razdel: "ТН",
  shifr: "27.00.00",
  name: "Управление в технических системах"
},
{
  razdel: "ТН",
  shifr: "29.00.00",
  name: "Технологии легкой промышленности"
},
{
  razdel: "НО",
  shifr: "37.00.00",
  name: "Психологические науки"
},
{
  razdel: "НО",
  shifr: "38.00.00",
  name: "Экономика и управление"
},
{
  razdel: "НО",
  shifr: "39.00.00",
  name: "Социология и социальная работа"
},
{
  razdel: "НО",
  shifr: "40.00.00",
  name: "Юриспруденция"
},
{
  razdel: "НО",
  shifr: "41.00.00",
  name: "Политические науки и регионоведение"
},
{
  razdel: "НО",
  shifr: "42.00.00",
  name: "Средства массовой информации и информационно-библиотечное дело"
},
{
  razdel: "НО",
  shifr: "43.00.00",
  name: "Сервис и туризм"
},
{
  razdel: "ПН",
  shifr: "44.00.00",
  name: "Образование и педагогические науки"
},
{
  razdel: "ГН",
  shifr: "45.00.00",
  name: "Языкознание и литературоведение"
},
{
  razdel: "ГН",
  shifr: "46.00.00",
  name: "История и археология"
},
{
  razdel: "ГН",
  shifr: "47.00.00",
  name: "Философия, этика и религиоведение"
},
{
  razdel: "ГН",
  shifr: "48.00.00",
  name: "Теология"
},
{
  razdel: "ГН",
  shifr: "49.00.00",
  name: "Физическая культура и спорт"
}];