let disciplinySpeList = [{
  shifrProf: '20.05.01.01',
  shifr: 27,
  name: 'Автоматизированные системы управления и связь',
  shifrKaf: 89,
  nameKaf: 'пожарной безопасности'
}, {
  shifrProf: '20.05.01.01',
  shifr: 197,
  name: 'Введение в специальность',
  shifrKaf: 89,
  nameKaf: 'пожарной безопасности'
}, {
  shifrProf: '20.05.01.01',
  shifr: 235,
  name: 'Высшая математика',
  shifrKaf: 23,
  nameKaf: 'прикладной математики'
}, {
  shifrProf: '20.05.01.01',
  shifr: 245,
  name: 'Газодымозащитная служба',
  shifrKaf: 89,
  nameKaf: 'пожарной безопасности'
}, {
    shifrProf: '20.05.01.01',
    shifr: 256,
    name: 'Гидравлика',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 278,
    name: 'Государственный надзор в области гражданской обороны',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 279,
    name: 'Государственный надзор в области защиты населения и территорий в ЧС',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 280,
    name: 'Государственный пожарный надзор',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 281,
    name: 'Государственный экзамен',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 309,
    name: 'Детали машин',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 336,
    name: 'Дипломный проект',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 381,
    name: 'Здания, сооружения и их устойчивость при пожарах',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 433,
    name: 'Иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 477,
    name: 'Информатика',
    shifrKaf: 21,
    nameKaf: 'компьютерных систем и сетей'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 509,
    name: 'Информационные системы оценки и прогнозирования пожаров',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 554,
    name: 'История',
    shifrKaf: 75,
    nameKaf: 'отечественной и всеобщей истории'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 563,
    name: 'История гражданской защиты',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 768,
    name: 'Культурология',
    shifrKaf: 73,
    nameKaf: 'документоведения и технотронной информологии'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 874,
    name: 'Математическое моделирование развития пожаров и взрывов',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 885,
    name: 'Материаловедение и технология материалов',
    shifrKaf: 31,
    nameKaf: 'материаловедения'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1166,
    name: 'Надежность технических систем и техногенный риск',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1167,
    name: 'Надзор и контроль в сфере безопасности',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1184,
    name: 'Научно-исследовательская работа',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1199,
    name: 'Начертательная геометрия и инженерная графика',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1227,
    name: 'Ноксология',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1241,
    name: 'Обеспечение производственной и экологической безопасности',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1286,
    name: 'Опасные природные и техногенные процессы',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1322,
    name: 'Организация и ведение аварийно-спасательных работ',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1335,
    name: 'Организация и управление в области обеспечения пожарной безопасности',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1364,
    name: 'Организация службы и подготовки',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1370,
    name: 'Организация управленческого труда в пожарной охране',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1442,
    name: 'Основы первой медицинской помощи',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1561,
    name: 'Первоначальная подготовка спасателей',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1585,
    name: 'Планирование и организация тушения пожаров',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1609,
    name: 'Пожарная безопасность в строительстве',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1610,
    name: 'Пожарная безопасность технологических процессов',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1611,
    name: 'Пожарная безопасность электроустановок',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1612,
    name: 'Пожарная тактика',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1613,
    name: 'Пожарная техника',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1614,
    name: 'Пожарно-строевая подготовка',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1615,
    name: 'Пожарно-техническая экспертиза и экспертиза пожаров',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1616,
    name: 'Пожаровзрывозащита',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1642,
    name: 'Политология',
    shifrKaf: 2,
    nameKaf: 'политологии и международных отношений'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1658,
    name: 'Правоведение',
    shifrKaf: 50,
    nameKaf: 'хозяйственно-правовых дисциплин и процесса'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1665,
    name: 'Правовое регулирование в области пожарной безопасности',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1676,
    name: 'Правовые основы противодействия террористической деятельности',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1709,
    name: 'Преддипломная практика',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1723,
    name: 'Прикладная механика',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1753,
    name: 'Прогнозирование опасных факторов пожара',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1826,
    name: 'Производственная и пожарная автоматика',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1827,
    name: 'Производственная практика',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1838,
    name: 'Противопожарное водоснабжение',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1862,
    name: 'Психологическая подготовка сотрудников ГПС',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1898,
    name: 'Психология экстремальных ситуаций',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1912,
    name: 'Радиационная, химическая и биологическая безопасность',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1922,
    name: 'Расследование пожаров',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 1979,
    name: 'Русский язык и культура речи',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2188,
    name: 'Социология',
    shifrKaf: 18,
    nameKaf: 'социологии'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2217,
    name: 'Специальная пожарная и аварийно-спасательная техника',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2336,
    name: 'Теория горения и взрыва',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2428,
    name: 'Теплотехника',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2604,
    name: 'Украинский язык',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2704,
    name: 'Учебная практика',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2716,
    name: 'Физика',
    shifrKaf: 36,
    nameKaf: 'физики'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2735,
    name: 'Физико-химические основы развития и тушения пожаров',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2741,
    name: 'Физиология человека',
    shifrKaf: 89,
    nameKaf: 'пожарной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2743,
    name: 'Физическая культура',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2745,
    name: 'Физическая культура (специальная подготовка)',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2746,
    name: 'Физическая культура и спорт',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2761,
    name: 'Философия',
    shifrKaf: 60,
    nameKaf: 'мировой философии и теологии'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2815,
    name: 'Химия',
    shifrKaf: 37,
    nameKaf: 'химии и инновационных химических технологий'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2860,
    name: 'Экология',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2881,
    name: 'Экономика пожарной безопасности',
    shifrKaf: 90,
    nameKaf: 'техносферной безопасности'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2897,
    name: 'Экономическая теория',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '20.05.01.01',
    shifr: 2970,
    name: 'Электротехника и электроника',
    shifrKaf: 10,
    nameKaf: 'электромеханики'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 140,
    name: 'Базы и банки данных (по специальности)',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 149,
    name: 'Безопасность жизнедеятельности',
    shifrKaf: 30,
    nameKaf: 'охраны труда и безопасности жизнедеятельности'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 159,
    name: 'Бизнес-планирование на автомобильном транспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 194,
    name: 'Введение в профессию',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 236,
    name: 'Вычислительная техника, сети и прикладное программирование на автотранспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 257,
    name: 'Гидравлика и гидропневмопривод',
    shifrKaf: 20,
    nameKaf: 'гидрогазодинамики'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 281,
    name: 'Государственный экзамен',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 309,
    name: 'Детали машин',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 336,
    name: 'Дипломный проект',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 407,
    name: 'Инженерная и компьютерная графика',
    shifrKaf: 26,
    nameKaf: 'станков, инструментов и инженерной графики'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 433,
    name: 'Иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 477,
    name: 'Информатика',
    shifrKaf: 21,
    nameKaf: 'компьютерных систем и сетей'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 485,
    name: 'Информационное обеспечение автотранспортных систем',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 554,
    name: 'История',
    shifrKaf: 75,
    nameKaf: 'отечественной и всеобщей истории'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 719,
    name: 'Конструкция и техническая эксплуатация современных и перспективных топливных систем автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 720,
    name: 'Конструкция и эксплуатационные свойства транспортных и транспортно-технологических машин и оборудования (ТТМиО)',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 831,
    name: 'Математика',
    shifrKaf: 23,
    nameKaf: 'прикладной математики'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 881,
    name: 'Материаловедение',
    shifrKaf: 31,
    nameKaf: 'материаловедения'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1072,
    name: 'Метрология, стандартизация и сертификация',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1184,
    name: 'Научно-исследовательская работа',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1312,
    name: 'Организационно-производственные структуры технической эксплуатации автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1392,
    name: 'Основы деловых коммуникаций и этикета',
    shifrKaf: 60,
    nameKaf: 'мировой философии и теологии'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1428,
    name: 'Основы научных исследований',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1434,
    name: 'Основы организации автомобильных перевозок и безопасности движения',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1471,
    name: 'Основы работоспособности и техническое регулирование на автотранспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1495,
    name: 'Основы теории надежности и диагностики',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1503,
    name: 'Основы технической эксплуатации и сервиса автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1506,
    name: 'Основы технологии производства и ремонта автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1658,
    name: 'Правоведение',
    shifrKaf: 50,
    nameKaf: 'хозяйственно-правовых дисциплин и процесса'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1709,
    name: 'Преддипломная практика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1827,
    name: 'Производственная практика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1828,
    name: 'Производственно-техническая инфраструктура и основы проектирования предприятий автомобильного транспорта',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1836,
    name: 'Промышленный дизайн и конструирование автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1849,
    name: 'Профессиональный иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1881,
    name: 'Психология и педагогика',
    shifrKaf: 3,
    nameKaf: 'психологии'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1915,
    name: 'Развитие и современное состояние мировой автомобилизации',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1927,
    name: 'Расчет и рабочие процессы автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1961,
    name: 'Ремонт и утилизация автотранспортных средств',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1966,
    name: 'Ресурсосбережение при проведении технического обслуживания и ремонта автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 1979,
    name: 'Русский язык и культура речи',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2007,
    name: 'Силовые агрегаты',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2026,
    name: 'Системы автоматизированного проектирования на автотранспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2073,
    name: 'Современные и перспективные электронные системы автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2081,
    name: 'Современные математические методы в науке и технике',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2140,
    name: 'Сопротивление материалов',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2317,
    name: 'Теоретическая механика',
    shifrKaf: 32,
    nameKaf: 'технологии машиностроения и инженерного консалтинга'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2382,
    name: 'Теория механизмов и машин',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2419,
    name: 'Теория эксплуатационных свойств автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2428,
    name: 'Теплотехника',
    shifrKaf: 40,
    nameKaf: 'двигателей внутреннего сгорания'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2454,
    name: 'Техническая эксплуатация автомобилей, оборудованных компьютерами и встроенной диагностикой',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2514,
    name: 'Технологические процессы технического обслуживания, ремонта и диагностики',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2562,
    name: 'Типаж и проектирование технологического оборудования',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2604,
    name: 'Украинский язык',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2643,
    name: 'Управление персоналом',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2704,
    name: 'Учебная практика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2716,
    name: 'Физика',
    shifrKaf: 36,
    nameKaf: 'физики'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2743,
    name: 'Физическая культура',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2744,
    name: 'Физическая культура (Культура здоровья)',
    shifrKaf: 82,
    nameKaf: 'проблем человека и философии здоровья'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2746,
    name: 'Физическая культура и спорт',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2761,
    name: 'Философия',
    shifrKaf: 60,
    nameKaf: 'мировой философии и теологии'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2815,
    name: 'Химия',
    shifrKaf: 37,
    nameKaf: 'химии и инновационных химических технологий'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2853,
    name: 'Экологические проблемы на автотранспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2860,
    name: 'Экология',
    shifrKaf: 35,
    nameKaf: 'экологии'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2866,
    name: 'Экономика',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2905,
    name: 'Экономические проблемы и организация производства на автотранспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2923,
    name: 'Эксплуатационные материалы автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2964,
    name: 'Электрооборудование автотранспортных предприятий',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.01',
    shifr: 2971,
    name: 'Электротехника, электроника и электропривод',
    shifrKaf: 93,
    nameKaf: 'электротехнических систем электропотребления'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 149,
    name: 'Безопасность жизнедеятельности',
    shifrKaf: 30,
    nameKaf: 'охраны труда и безопасности жизнедеятельности'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 150,
    name: 'Безопасность жизнедеятельности в чрезвычайных ситуациях',
    shifrKaf: 30,
    nameKaf: 'охраны труда и безопасности жизнедеятельности'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 183,
    name: 'Введение в инжиниринг подъемно-транспортных, строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 257,
    name: 'Гидравлика и гидропневмопривод',
    shifrKaf: 20,
    nameKaf: 'гидрогазодинамики'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 281,
    name: 'Государственный экзамен',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 292,
    name: 'Грузоподъемные машины',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 310,
    name: 'Детали машин и основы конструирования',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 325,
    name: 'Динамика грузоподъемных кранов',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 336,
    name: 'Дипломный проект',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 354,
    name: 'Дорожные машины',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 407,
    name: 'Инженерная и компьютерная графика',
    shifrKaf: 26,
    nameKaf: 'станков, инструментов и инженерной графики'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 433,
    name: 'Иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 477,
    name: 'Информатика',
    shifrKaf: 21,
    nameKaf: 'компьютерных систем и сетей'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 547,
    name: 'Исследования и испытания наземных транспортно-технологических машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 554,
    name: 'История',
    shifrKaf: 75,
    nameKaf: 'отечественной и всеобщей истории'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 645,
    name: 'Канатные дороги',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 669,
    name: 'Комплексная механизация и автоматизация погрузочно-разгрузочных и транспортно-складских работ',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 791,
    name: 'Лифты и подъемники',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 831,
    name: 'Математика',
    shifrKaf: 23,
    nameKaf: 'прикладной математики'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 867,
    name: 'Математическое моделирование подъемно-транспортных, строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 881,
    name: 'Материаловедение',
    shifrKaf: 31,
    nameKaf: 'материаловедения'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1021,
    name: 'Методы и средства экспериментальных исследований объектов подъемно-транспортного, строительного, дорожного машиностроения',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1072,
    name: 'Метрология, стандартизация и сертификация',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1110,
    name: 'Многопараметрические исследования динамики грузоподъемных кранов',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1111,
    name: 'Мобильные краны',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1151,
    name: 'Монтаж, эксплуатация и ремонт подъемно-транспортных, строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1164,
    name: 'Надежность подъемно-транспортных, строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1184,
    name: 'Научно-исследовательская работа',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1402,
    name: 'Основы интралогистики',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1477,
    name: 'Основы робототехники',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1593,
    name: 'Планирование эксперимента при поиске оптимальных решений в задачах подъемно-транспортного, строительного, дорожного машиностроения',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1658,
    name: 'Правоведение',
    shifrKaf: 50,
    nameKaf: 'хозяйственно-правовых дисциплин и процесса'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1709,
    name: 'Преддипломная практика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1754,
    name: 'Прогнозирование остаточного ресурса грузоподъемных кранов',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1827,
    name: 'Производственная практика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1834,
    name: 'Промышленная экология',
    shifrKaf: 35,
    nameKaf: 'экологии'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1849,
    name: 'Профессиональный иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1881,
    name: 'Психология и педагогика',
    shifrKaf: 3,
    nameKaf: 'психологии'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 1979,
    name: 'Русский язык и культура речи',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2028,
    name: 'Системы автоматизированного проектирования подъемно-транспортных, строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2140,
    name: 'Сопротивление материалов',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2223,
    name: 'Специальные краны',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2279,
    name: 'Строительная механика и металлоконструкции подъемно-транспортных, строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2280,
    name: 'Строительные машины',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2317,
    name: 'Теоретическая механика',
    shifrKaf: 32,
    nameKaf: 'технологии машиностроения и инженерного консалтинга'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2382,
    name: 'Теория механизмов и машин',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2434,
    name: 'Термодинамика и теплопередача',
    shifrKaf: 40,
    nameKaf: 'двигателей внутреннего сгорания'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2450,
    name: 'Техническая диагностика подъемно-транспортных строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2554,
    name: 'Технология производства подъемно-транспортных, строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2572,
    name: 'Транспортирующие машины',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2604,
    name: 'Украинский язык',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2643,
    name: 'Управление персоналом',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2704,
    name: 'Учебная практика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2716,
    name: 'Физика',
    shifrKaf: 36,
    nameKaf: 'физики'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2743,
    name: 'Физическая культура',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2744,
    name: 'Физическая культура (Культура здоровья)',
    shifrKaf: 82,
    nameKaf: 'проблем человека и философии здоровья'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2746,
    name: 'Физическая культура и спорт',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2761,
    name: 'Философия',
    shifrKaf: 60,
    nameKaf: 'мировой философии и теологии'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2815,
    name: 'Химия',
    shifrKaf: 37,
    nameKaf: 'химии и инновационных химических технологий'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2839,
    name: 'Численные методы в задачах подъемно-транспортного, строительного, дорожного машиностроения',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2860,
    name: 'Экология',
    shifrKaf: 35,
    nameKaf: 'экологии'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2866,
    name: 'Экономика',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2924,
    name: 'Эксплуатационные материалы подъемно-транспортных, строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2966,
    name: 'Электрооборудование подъемно-транспортных, строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2970,
    name: 'Электротехника и электроника',
    shifrKaf: 35,
    nameKaf: 'экологии'
  }, {
    shifrProf: '23.05.01.02',
    shifr: 2984,
    name: 'Энергетические установки подъемно-транспортных, строительных, дорожных машин',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 140,
    name: 'Базы и банки данных (по специальности)',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 149,
    name: 'Безопасность жизнедеятельности',
    shifrKaf: 30,
    nameKaf: 'охраны труда и безопасности жизнедеятельности'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 159,
    name: 'Бизнес-планирование на автомобильном транспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 194,
    name: 'Введение в профессию',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 236,
    name: 'Вычислительная техника, сети и прикладное программирование на автотранспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 257,
    name: 'Гидравлика и гидропневмопривод',
    shifrKaf: 20,
    nameKaf: 'гидрогазодинамики'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 281,
    name: 'Государственный экзамен',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 309,
    name: 'Детали машин',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 336,
    name: 'Дипломный проект',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 407,
    name: 'Инженерная и компьютерная графика',
    shifrKaf: 26,
    nameKaf: 'станков, инструментов и инженерной графики'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 433,
    name: 'Иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 477,
    name: 'Информатика',
    shifrKaf: 21,
    nameKaf: 'компьютерных систем и сетей'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 485,
    name: 'Информационное обеспечение автотранспортных систем',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 554,
    name: 'История',
    shifrKaf: 75,
    nameKaf: 'отечественной и всеобщей истории'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 719,
    name: 'Конструкция и техническая эксплуатация современных и перспективных топливных систем автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 720,
    name: 'Конструкция и эксплуатационные свойства транспортных и транспортно-технологических машин и оборудования (ТТМиО)',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 831,
    name: 'Математика',
    shifrKaf: 23,
    nameKaf: 'прикладной математики'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 881,
    name: 'Материаловедение',
    shifrKaf: 31,
    nameKaf: 'материаловедения'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1072,
    name: 'Метрология, стандартизация и сертификация',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1184,
    name: 'Научно-исследовательская работа',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1312,
    name: 'Организационно-производственные структуры технической эксплуатации автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1392,
    name: 'Основы деловых коммуникаций и этикета',
    shifrKaf: 60,
    nameKaf: 'мировой философии и теологии'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1428,
    name: 'Основы научных исследований',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1434,
    name: 'Основы организации автомобильных перевозок и безопасности движения',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1471,
    name: 'Основы работоспособности и техническое регулирование на автотранспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1495,
    name: 'Основы теории надежности и диагностики',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1503,
    name: 'Основы технической эксплуатации и сервиса автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1506,
    name: 'Основы технологии производства и ремонта автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1658,
    name: 'Правоведение',
    shifrKaf: 50,
    nameKaf: 'хозяйственно-правовых дисциплин и процесса'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1709,
    name: 'Преддипломная практика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1827,
    name: 'Производственная практика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1828,
    name: 'Производственно-техническая инфраструктура и основы проектирования предприятий автомобильного транспорта',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1836,
    name: 'Промышленный дизайн и конструирование автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1849,
    name: 'Профессиональный иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1881,
    name: 'Психология и педагогика',
    shifrKaf: 3,
    nameKaf: 'психологии'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1915,
    name: 'Развитие и современное состояние мировой автомобилизации',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1927,
    name: 'Расчет и рабочие процессы автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1961,
    name: 'Ремонт и утилизация автотранспортных средств',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1966,
    name: 'Ресурсосбережение при проведении технического обслуживания и ремонта автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 1979,
    name: 'Русский язык и культура речи',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2007,
    name: 'Силовые агрегаты',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2026,
    name: 'Системы автоматизированного проектирования на автотранспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2073,
    name: 'Современные и перспективные электронные системы автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2081,
    name: 'Современные математические методы в науке и технике',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2140,
    name: 'Сопротивление материалов',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2317,
    name: 'Теоретическая механика',
    shifrKaf: 32,
    nameKaf: 'технологии машиностроения и инженерного консалтинга'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2382,
    name: 'Теория механизмов и машин',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2419,
    name: 'Теория эксплуатационных свойств автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2428,
    name: 'Теплотехника',
    shifrKaf: 40,
    nameKaf: 'двигателей внутреннего сгорания'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2454,
    name: 'Техническая эксплуатация автомобилей, оборудованных компьютерами и встроенной диагностикой',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2514,
    name: 'Технологические процессы технического обслуживания, ремонта и диагностики',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2562,
    name: 'Типаж и проектирование технологического оборудования',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2604,
    name: 'Украинский язык',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2643,
    name: 'Управление персоналом',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2704,
    name: 'Учебная практика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2716,
    name: 'Физика',
    shifrKaf: 36,
    nameKaf: 'физики'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2743,
    name: 'Физическая культура',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2744,
    name: 'Физическая культура (Культура здоровья)',
    shifrKaf: 82,
    nameKaf: 'проблем человека и философии здоровья'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2746,
    name: 'Физическая культура и спорт',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2761,
    name: 'Философия',
    shifrKaf: 60,
    nameKaf: 'мировой философии и теологии'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2815,
    name: 'Химия',
    shifrKaf: 37,
    nameKaf: 'химии и инновационных химических технологий'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2853,
    name: 'Экологические проблемы на автотранспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2860,
    name: 'Экология',
    shifrKaf: 35,
    nameKaf: 'экологии'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2866,
    name: 'Экономика',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2905,
    name: 'Экономические проблемы и организация производства на автотранспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2923,
    name: 'Эксплуатационные материалы автомобилей',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2964,
    name: 'Электрооборудование автотранспортных предприятий',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.01.03',
    shifr: 2971,
    name: 'Электротехника, электроника и электропривод',
    shifrKaf: 93,
    nameKaf: 'электротехнических систем электропотребления'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 19,
    name: 'Автоматизация управления локомотивами',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 148,
    name: 'Безопасность движения на железнодорожном транспорте',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 149,
    name: 'Безопасность жизнедеятельности',
    shifrKaf: 30,
    nameKaf: 'охраны труда и безопасности жизнедеятельности'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 150,
    name: 'Безопасность жизнедеятельности в чрезвычайных ситуациях',
    shifrKaf: 30,
    nameKaf: 'охраны труда и безопасности жизнедеятельности'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 177,
    name: 'Вагоны',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 215,
    name: 'Вибро- и шумозащита на подвижном составе',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 257,
    name: 'Гидравлика и гидропневмопривод',
    shifrKaf: 20,
    nameKaf: 'гидрогазодинамики'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 281,
    name: 'Государственный экзамен',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 309,
    name: 'Детали машин',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 330,
    name: 'Динамика подвижного состава',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 336,
    name: 'Дипломный проект',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 407,
    name: 'Инженерная и компьютерная графика',
    shifrKaf: 26,
    nameKaf: 'станков, инструментов и инженерной графики'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 433,
    name: 'Иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 477,
    name: 'Информатика',
    shifrKaf: 21,
    nameKaf: 'компьютерных систем и сетей'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 554,
    name: 'История',
    shifrKaf: 75,
    nameKaf: 'отечественной и всеобщей истории'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 803,
    name: 'Локомотивное хозяйство',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 804,
    name: 'Локомотивные энергетические установки',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 805,
    name: 'Локомотивы',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 831,
    name: 'Математика',
    shifrKaf: 23,
    nameKaf: 'прикладной математики'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 881,
    name: 'Материаловедение',
    shifrKaf: 31,
    nameKaf: 'материаловедения'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 940,
    name: 'Менеджмент и экономика предприятий железнодорожного транспорта',
    shifrKaf: 33,
    nameKaf: 'экономики предприятия'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1072,
    name: 'Метрология, стандартизация и сертификация',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1163,
    name: 'Надежность подвижного состава',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1184,
    name: 'Научно-исследовательская работа',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1277,
    name: 'Общий курс железнодорожного транспорта',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1352,
    name: 'Организация производства подвижного состава',
    shifrKaf: 33,
    nameKaf: 'экономики предприятия'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1521,
    name: 'Основы электропривода технологических установок на железной дороге',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1642,
    name: 'Политология',
    shifrKaf: 2,
    nameKaf: 'политологии и международных отношений'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1654,
    name: 'Правила технической эксплуатации железных дорог',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1658,
    name: 'Правоведение',
    shifrKaf: 50,
    nameKaf: 'хозяйственно-правовых дисциплин и процесса'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1709,
    name: 'Преддипломная практика',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1827,
    name: 'Производственная практика',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1830,
    name: 'Производство и ремонт подвижного состава',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1849,
    name: 'Профессиональный иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1881,
    name: 'Психология и педагогика',
    shifrKaf: 3,
    nameKaf: 'психологии'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 1979,
    name: 'Русский язык и культура речи',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2027,
    name: 'Системы автоматизированного проектирования подвижного состава железных дорог',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2036,
    name: 'Системы менеджмента качества в локомотивном хозяйстве',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2040,
    name: 'Системы охлаждения локомотивов',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2140,
    name: 'Сопротивление материалов',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2188,
    name: 'Социология',
    shifrKaf: 18,
    nameKaf: 'социологии'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2317,
    name: 'Теоретическая механика',
    shifrKaf: 32,
    nameKaf: 'технологии машиностроения и инженерного консалтинга'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2342,
    name: 'Теория и конструкция локомотивов',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2382,
    name: 'Теория механизмов и машин',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2401,
    name: 'Теория систем автоматического управления на подвижном составе',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2434,
    name: 'Термодинамика и теплопередача',
    shifrKaf: 40,
    nameKaf: 'двигателей внутреннего сгорания'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2449,
    name: 'Техническая диагностика подвижного состава',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2506,
    name: 'Технологические методы восстановления деталей подвижного состава',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2587,
    name: 'Трибология, трение и износ узлов подвижного состава',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2596,
    name: 'Тяга и торможение поездов',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2604,
    name: 'Украинский язык',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2643,
    name: 'Управление персоналом',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2704,
    name: 'Учебная практика',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2716,
    name: 'Физика',
    shifrKaf: 36,
    nameKaf: 'физики'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2743,
    name: 'Физическая культура',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2744,
    name: 'Физическая культура (Культура здоровья)',
    shifrKaf: 82,
    nameKaf: 'проблем человека и философии здоровья'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2746,
    name: 'Физическая культура и спорт',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2761,
    name: 'Философия',
    shifrKaf: 60,
    nameKaf: 'мировой философии и теологии'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2815,
    name: 'Химия',
    shifrKaf: 37,
    nameKaf: 'химии и инновационных химических технологий'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2860,
    name: 'Экология',
    shifrKaf: 35,
    nameKaf: 'экологии'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2866,
    name: 'Экономика',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2931,
    name: 'Эксплуатация и техническое обслуживание подвижного состава',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2937,
    name: 'Электрические аппараты и схемы локомотивов',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2942,
    name: 'Электрические передачи локомотивов',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2943,
    name: 'Электрический транспорт',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2944,
    name: 'Электрическое оборудование локомотивов',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.03.01',
    shifr: 2970,
    name: 'Электротехника и электроника',
    shifrKaf: 10,
    nameKaf: 'электромеханики'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 31,
    name: 'Автоматика, телемеханика и связь на железнодорожном транспорте',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 149,
    name: 'Безопасность жизнедеятельности',
    shifrKaf: 30,
    nameKaf: 'охраны труда и безопасности жизнедеятельности'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 210,
    name: 'Взаимодействие видов транспорта в транспортных системах',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 248,
    name: 'Генеральный план транспортной инфраструктуры',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 281,
    name: 'Государственный экзамен',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 289,
    name: 'Грузоведение и грузовые перевозки',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 336,
    name: 'Дипломный проект',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 363,
    name: 'Железнодорожные станции и узлы, технология и эксплуатация',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 407,
    name: 'Инженерная и компьютерная графика',
    shifrKaf: 26,
    nameKaf: 'станков, инструментов и инженерной графики'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 433,
    name: 'Иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 477,
    name: 'Информатика',
    shifrKaf: 21,
    nameKaf: 'компьютерных систем и сетей'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 529,
    name: 'Информационные технологии на магистральном транспорте',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 535,
    name: 'Инфраструктура и склады транспортных систем',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 546,
    name: 'Исследование операций в транспортных системах',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 554,
    name: 'История',
    shifrKaf: 75,
    nameKaf: 'отечественной и всеобщей истории'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 810,
    name: 'Малозатратные технологии перевозочного процесса',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 831,
    name: 'Математика',
    shifrKaf: 23,
    nameKaf: 'прикладной математики'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 877,
    name: 'Математическое моделирование систем и процессов',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1184,
    name: 'Научно-исследовательская работа',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1229,
    name: 'Нормативно-правовое обеспечение деятельности железнодорожного транспорта',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1269,
    name: 'Общая электротехника и электроника',
    shifrKaf: 10,
    nameKaf: 'электромеханики'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1276,
    name: 'Общий курс водного транспорта',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1278,
    name: 'Общий курс транспорта',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1316,
    name: 'Организация внешнеторговых перевозок',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1349,
    name: 'Организация погрузочно-разгрузочных работ',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1359,
    name: 'Организация работы экспедиторских фирм',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1368,
    name: 'Организация транспортных услуг и средства обеспечения безопасности на транспорте',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1386,
    name: 'Основы геодезии и проектирования железных дорог',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1480,
    name: 'Основы системного анализа',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1508,
    name: 'Основы транспортного бизнеса и аутсорсинг на магистральном транспорте',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1565,
    name: 'Перевозка опасных грузов',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1605,
    name: 'Подвижной состав транспортных систем',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1654,
    name: 'Правила технической эксплуатации железных дорог',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1658,
    name: 'Правоведение',
    shifrKaf: 50,
    nameKaf: 'хозяйственно-правовых дисциплин и процесса'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1709,
    name: 'Преддипломная практика',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1723,
    name: 'Прикладная механика',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1827,
    name: 'Производственная практика',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1837,
    name: 'Промышленный транспорт и нетяговый подвижной состав',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1849,
    name: 'Профессиональный иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1881,
    name: 'Психология и педагогика',
    shifrKaf: 3,
    nameKaf: 'психологии'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1906,
    name: 'Пути сообщения, технологические сооружения',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1979,
    name: 'Русский язык и культура речи',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 1998,
    name: 'Сервис в системах транспортного обслуживания',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2304,
    name: 'Таможенный контроль',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2317,
    name: 'Теоретическая механика',
    shifrKaf: 32,
    nameKaf: 'технологии машиностроения и инженерного консалтинга'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2412,
    name: 'Теория транспортных процессов и систем',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2444,
    name: 'Техника транспорта и подвижной состав',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2455,
    name: 'Техническая эксплуатация железнодорожного транспорта и безопасность движения',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2463,
    name: 'Технические средства обеспечения безопасности на железных дорогах',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2530,
    name: 'Технология и организация пассажиропотоков',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2577,
    name: 'Транспортная логистика',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2579,
    name: 'Транспортная энергетика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2581,
    name: 'Транспортное право',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2615,
    name: 'Управление грузовой и коммерческой работой и материаловедение',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2643,
    name: 'Управление персоналом',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2673,
    name: 'Управление цепями поставок',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2676,
    name: 'Управление эксплуатационной работой',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2693,
    name: 'Условия перевозок и тарифы в международных сообщениях',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2701,
    name: 'Устройство и эксплуатация пути',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2704,
    name: 'Учебная практика',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2716,
    name: 'Физика',
    shifrKaf: 36,
    nameKaf: 'физики'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2743,
    name: 'Физическая культура',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2744,
    name: 'Физическая культура (культура здоровья)',
    shifrKaf: 82,
    nameKaf: 'проблем человека и философии здоровья'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2746,
    name: 'Физическая культура и спорт',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2761,
    name: 'Философия',
    shifrKaf: 60,
    nameKaf: 'мировой философии и теологии'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2815,
    name: 'Химия',
    shifrKaf: 37,
    nameKaf: 'химии и инновационных химических технологий'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2818,
    name: 'Хладотранспорт и основы теплотехники',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2860,
    name: 'Экология',
    shifrKaf: 35,
    nameKaf: 'экологии'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2866,
    name: 'Экономика',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.04.01',
    shifr: 2886,
    name: 'Экономика транспорта',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 31,
    name: 'Автоматика, телемеханика и связь на железнодорожном транспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 31,
    name: 'Автоматика, телемеханика и связь на железнодорожном транспорте',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 132,
    name: 'Аутсорсинг и транспортный бизнес промышленных предприятий',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 149,
    name: 'Безопасность жизнедеятельности',
    shifrKaf: 30,
    nameKaf: 'охраны труда и безопасности жизнедеятельности'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 210,
    name: 'Взаимодействие видов транспорта в транспортных системах',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 211,
    name: 'Взаимодействие видов транспорта на промышленном транспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 234,
    name: 'Высокоскоростные магистрали и пассажирские станции',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 247,
    name: 'Генеральный план и транспорт промышленных предприятий',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 248,
    name: 'Генеральный план транспортной инфраструктуры',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 281,
    name: 'Государственный экзамен',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 288,
    name: 'Грузоведение',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 289,
    name: 'Грузоведение и грузовые перевозки',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 336,
    name: 'Дипломный проект',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 363,
    name: 'Железнодорожные станции и узлы, технология и эксплуатация',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 407,
    name: 'Инженерная и компьютерная графика',
    shifrKaf: 26,
    nameKaf: 'станков, инструментов и инженерной графики'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 433,
    name: 'Иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 436,
    name: 'Иностранный язык в профессиональной сфере',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 477,
    name: 'Информатика',
    shifrKaf: 21,
    nameKaf: 'компьютерных систем и сетей'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 529,
    name: 'Информационные технологии на магистральном транспорте',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 530,
    name: 'Информационные технологии на промышленном транспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 535,
    name: 'Инфраструктура и склады транспортных систем',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 546,
    name: 'Исследование операций в транспортных системах',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 554,
    name: 'История',
    shifrKaf: 75,
    nameKaf: 'отечественной и всеобщей истории'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 621,
    name: 'История транспорта',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 810,
    name: 'Малозатратные технологии перевозочного процесса',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 811,
    name: 'Маркетинг',
    shifrKaf: 6,
    nameKaf: 'маркетинга'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 831,
    name: 'Математика',
    shifrKaf: 23,
    nameKaf: 'прикладной математики'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 859,
    name: 'Математическое методы, модели и моделирование транспортных процессов',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 877,
    name: 'Математическое моделирование систем и процессов',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 881,
    name: 'Материаловедение',
    shifrKaf: 31,
    nameKaf: 'материаловедения'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1072,
    name: 'Метрология, стандартизация и сертификация',
    shifrKaf: 41,
    nameKaf: 'железнодорожного транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1184,
    name: 'Научно-исследовательская работа',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1216,
    name: 'Нетяговый подвижной состав',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1269,
    name: 'Общая электротехника и электроника',
    shifrKaf: 10,
    nameKaf: 'электромеханики'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1276,
    name: 'Общий курс водного транспорта',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1278,
    name: 'Общий курс транспорта',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1347,
    name: 'Организация перевозок на промышленном транспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1349,
    name: 'Организация погрузочно-разгрузочных работ',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1368,
    name: 'Организация транспортных услуг и средства обеспечения безопасности на транспорте',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1385,
    name: 'Основы геодезии',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1386,
    name: 'Основы геодезии и проектирования железных дорог',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1388,
    name: 'Основы геоинформатики и навигации',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1414,
    name: 'Основы логистики',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1480,
    name: 'Основы системного анализа',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1507,
    name: 'Основы транспортного бизнеса',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1565,
    name: 'Перевозка опасных грузов',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1605,
    name: 'Подвижной состав транспортных систем',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1654,
    name: 'Правила технической эксплуатации железных дорог',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1658,
    name: 'Правоведение',
    shifrKaf: 52,
    nameKaf: 'правоведения'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1658,
    name: 'Правоведение',
    shifrKaf: 50,
    nameKaf: 'хозяйственно-правовых дисциплин и процесса'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1709,
    name: 'Преддипломная практика',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1723,
    name: 'Прикладная механика',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1777,
    name: 'Программное обеспечение учетно-статистических операций',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1827,
    name: 'Производственная практика',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1837,
    name: 'Промышленный транспорт и нетяговый подвижной состав',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1849,
    name: 'Профессиональный иностранный язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1881,
    name: 'Психология и педагогика',
    shifrKaf: 3,
    nameKaf: 'психологии'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1905,
    name: 'Пути и путевое хозяйство промышленных предприятий',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1906,
    name: 'Пути сообщения, технологические сооружения',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1979,
    name: 'Русский язык и культура речи',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 1998,
    name: 'Сервис в системах транспортного обслуживания',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2000,
    name: 'Сервис на промышленном транспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2057,
    name: 'Совершенствование технологии работы направлений и системы организации вагонопотоков',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2111,
    name: 'Современные проблемы реконструкций станций и узлов',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2140,
    name: 'Сопротивление материалов',
    shifrKaf: 28,
    nameKaf: 'машиноведения'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2221,
    name: 'Специальные виды промышленного транспорта',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2252,
    name: 'Станции, узлы и транспортные коридоры',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2278,
    name: 'Страховая деятельность на транспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2297,
    name: 'Таможенная логистика',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2300,
    name: 'Таможенное дело',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2302,
    name: 'Таможенные платежи',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2304,
    name: 'Таможенный контроль',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2317,
    name: 'Теоретическая механика',
    shifrKaf: 32,
    nameKaf: 'технологии машиностроения и инженерного консалтинга'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2412,
    name: 'Теория транспортных процессов и систем',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2431,
    name: 'Терминально-логистические комплексы',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2444,
    name: 'Техника транспорта и подвижной состав',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2455,
    name: 'Техническая эксплуатация железнодорожного транспорта и безопасность движения',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2455,
    name: 'Техническая эксплуатация железнодорожного транспорта и безопасность движения',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2462,
    name: 'Технические средства обеспечения безопасности на железнодорожном транспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2463,
    name: 'Технические средства обеспечения безопасности на железных дорогах',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2530,
    name: 'Технология и организация пассажиропотоков',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2564,
    name: 'Товароведение, экспертиза в таможенном деле',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2573,
    name: 'Транспортная безопасность',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2577,
    name: 'Транспортная логистика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2577,
    name: 'Транспортная логистика',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2579,
    name: 'Транспортная энергетика',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2580,
    name: 'Транспортно-грузовые системы',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2581,
    name: 'Транспортное право',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2581,
    name: 'Транспортное право',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2598,
    name: 'Тяга поездов. Тепловозная тяга',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2599,
    name: 'Тяга поездов. Электрическая тяга',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2604,
    name: 'Украинский язык',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2614,
    name: 'Управление грузовой и коммерческой работой',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2615,
    name: 'Управление грузовой и коммерческой работой и материаловедение',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2620,
    name: 'Управление запасами в логистической системе поставок',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2643,
    name: 'Управление персоналом',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2652,
    name: 'Управление проектами в транспортном бизнесе',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2673,
    name: 'Управление цепями поставок',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2676,
    name: 'Управление эксплуатационной работой',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2677,
    name: 'Управление эксплуатационной работой на промышленном транспорте',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2693,
    name: 'Условия перевозок и тарифы в международных сообщениях',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2701,
    name: 'Устройство и эксплуатация пути',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2704,
    name: 'Учебная практика',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2716,
    name: 'Физика',
    shifrKaf: 36,
    nameKaf: 'физики'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2743,
    name: 'Физическая культура',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2744,
    name: 'Физическая культура (культура здоровья)',
    shifrKaf: 82,
    nameKaf: 'проблем человека и философии здоровья'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2746,
    name: 'Физическая культура и спорт',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2761,
    name: 'Философия',
    shifrKaf: 60,
    nameKaf: 'мировой философии и теологии'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2815,
    name: 'Химия',
    shifrKaf: 37,
    nameKaf: 'химии и инновационных химических технологий'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2817,
    name: 'Хладотранспорт',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2818,
    name: 'Хладотранспорт и основы теплотехники',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2860,
    name: 'Экология',
    shifrKaf: 35,
    nameKaf: 'экологии'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2866,
    name: 'Экономика',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2886,
    name: 'Экономика транспорта',
    shifrKaf: 45,
    nameKaf: 'транспортных систем'
  }, {
    shifrProf: '23.05.04.02',
    shifr: 2929,
    name: 'Эксплуатация и ремонт технических средств промышленного транспорта',
    shifrKaf: 92,
    nameKaf: 'промышленного и городского транспорта'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 149,
    name: 'Безопасность жизнедеятельности',
    shifrKaf: 30,
    nameKaf: 'охраны труда и безопасности жизнедеятельности'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 197,
    name: 'Введение в специальность',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 204,
    name: 'Введение в языкознание',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 272,
    name: 'Государственное право',
    shifrKaf: 50,
    nameKaf: 'хозяйственно-правовых дисциплин и процесса'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 281,
    name: 'Государственный экзамен',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 283,
    name: 'Гражданская оборона',
    shifrKaf: 30,
    nameKaf: 'охраны труда и безопасности жизнедеятельности'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 286,
    name: 'Грамматика',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 287,
    name: 'Грамматические проблемы перевода',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 336,
    name: 'Дипломный проект',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 454,
    name: 'Интеллектуальная собственность',
    shifrKaf: 47,
    nameKaf: 'международно-правовых дисциплин'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 521,
    name: 'Информационные технологии в профессиональной деятельности',
    shifrKaf: 21,
    nameKaf: 'компьютерных систем и сетей'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 554,
    name: 'История',
    shifrKaf: 75,
    nameKaf: 'отечественной и всеобщей истории'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 572,
    name: 'История и культура стран второго иностранного языка',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 586,
    name: 'История литературы стран изучаемого языка',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 588,
    name: 'История мировой литературы',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 590,
    name: 'История мировых цивилизаций',
    shifrKaf: 75,
    nameKaf: 'отечественной и всеобщей истории'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 599,
    name: 'История первого иностранного языка',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 679,
    name: 'Компьютерная лексикография и компьютерный сервис переводчика',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 776,
    name: 'Латинский язык',
    shifrKaf: 13,
    nameKaf: 'иностранных языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 777,
    name: 'Лексикология',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 785,
    name: 'Лингвострановедение стран первого иностранного языка',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 958,
    name: 'Методика преподавания иностранного языка',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1052,
    name: 'Методы перевода и анализ художественного текста',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1184,
    name: 'Научно-исследовательская работа',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1263,
    name: 'Общая теория перевода',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1441,
    name: 'Основы педагогического мастерства',
    shifrKaf: 72,
    nameKaf: 'педагогики'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1458,
    name: 'Основы профессиональной деятельности устного переводчика',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1523,
    name: 'Особенности перевода художественных произведений и их редактирование',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1550,
    name: 'Педагогика',
    shifrKaf: 72,
    nameKaf: 'педагогики'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1562,
    name: 'Перевод научно-технической литературы',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1563,
    name: 'Перевод официально-деловой литературы',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1564,
    name: 'Перевод социально-экономической литературы',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1642,
    name: 'Политология',
    shifrKaf: 2,
    nameKaf: 'политологии и международных отношений'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1703,
    name: 'Практический курс второго иностранного языка и перевода',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1704,
    name: 'Практический курс первого иностранного языка',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1705,
    name: 'Практический курс перевода первого иностранного языка',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1707,
    name: 'Практический курс третьего иностранного языка и перевода',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1709,
    name: 'Преддипломная практика',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1827,
    name: 'Производственная практика',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1973,
    name: 'Риторика',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 1979,
    name: 'Русский язык и культура речи',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2188,
    name: 'Социология',
    shifrKaf: 18,
    nameKaf: 'социологии'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2216,
    name: 'Специальная подготовка',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2259,
    name: 'Стилистика',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2370,
    name: 'Теория интерпретации',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2380,
    name: 'Теория межкультурной коммуникации',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2604,
    name: 'Украинский язык',
    shifrKaf: 61,
    nameKaf: 'славянской филологии'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2704,
    name: 'Учебная практика',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2743,
    name: 'Физическая культура',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2744,
    name: 'Физическая культура (культура здоровья)',
    shifrKaf: 82,
    nameKaf: 'проблем человека и философии здоровья'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2746,
    name: 'Физическая культура и спорт',
    shifrKaf: 4,
    nameKaf: 'физического воспитания'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2761,
    name: 'Философия',
    shifrKaf: 60,
    nameKaf: 'мировой философии и теологии'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2833,
    name: 'Частная теория перевода',
    shifrKaf: 17,
    nameKaf: 'теории и практики перевода германских и романских языков'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2897,
    name: 'Экономическая теория',
    shifrKaf: 7,
    nameKaf: 'мировой экономики'
  }, {
    shifrProf: '45.05.01.01',
    shifr: 2998,
    name: 'Этико-психологические основы профессиональной деятельности педагога',
    shifrKaf: 72,
    nameKaf: 'педагогики'
  }
];
