let disciplinySprList = [{
    shifr: 1,
    name: 'CAD/CAM/CAE системы в машиностроении'
  }, {
    shifr: 2,
    name: 'CASE-технологии создания информационных систем'
  }, {
    shifr: 3,
    name: 'PR и GR в индустрии спорта'
  }, {
    shifr: 4,
    name: 'SCADA системы'
  }, {
    shifr: 5,
    name: 'WEB технологии'
  }, {
    shifr: 6,
    name: 'WEB технологии в системах автоматизации'
  }, {
    shifr: 7,
    name: 'Web-дизайн и компьютерное моделирование'
  }, {
    shifr: 8,
    name: 'Web-программирование и web-дизайн'
  }, {
    shifr: 9,
    name: 'Web-технологии в разработке информационных систем'
  }, {
    shifr: 10,
    name: 'Автоматизация и контроль среды обитания человека'
  }, {
    shifr: 11,
    name: 'Автоматизация измерений, контроля и испытаний'
  }, {
    shifr: 12,
    name: 'Автоматизация КШП'
  }, {
    shifr: 13,
    name: 'Автоматизация проектирования систем электроснабжения'
  }, {
    shifr: 14,
    name: 'Автоматизация производственных процессов'
  }, {
    shifr: 15,
    name: 'Автоматизация процессов электронной промышленности'
  }, {
    shifr: 16,
    name: 'Автоматизация технологических процессов'
  }, {
    shifr: 17,
    name: 'Автоматизация технологических процессов и производств'
  }, {
    shifr: 18,
    name: 'Автоматизация управления жизненным циклом продукции'
  }, {
    shifr: 19,
    name: 'Автоматизация управления локомотивами'
  }, {
    shifr: 20,
    name: 'Автоматизация швейного производства'
  }, {
    shifr: 21,
    name: 'Автоматизированное проектирование и изготовление штамповой оснастки'
  }, {
    shifr: 22,
    name: 'Автоматизированное проектирование инструментов, инструментальной оснастки и технологии их изготовления'
  }, {
    shifr: 23,
    name: 'Автоматизированные редакционно-издательские системы'
  }, {
    shifr: 24,
    name: 'Автоматизированные системы научных исследований'
  }, {
    shifr: 25,
    name: 'Автоматизированные системы управления безопасным движением'
  }, {
    shifr: 26,
    name: 'Автоматизированные системы управления движением'
  }, {
    shifr: 27,
    name: 'Автоматизированные системы управления и связь'
  }, {
    shifr: 28,
    name: 'Автоматизированные системы управления качеством'
  }, {
    shifr: 29,
    name: 'Автоматизированные системы управления электроснабжением'
  }, {
    shifr: 30,
    name: 'Автоматизированный электропривод'
  }, {
    shifr: 31,
    name: 'Автоматика, телемеханика и связь на железнодорожном транспорте'
  }, {
    shifr: 32,
    name: 'Автоматика, телемеханика, связь на промышленном транспорте'
  }, {
    shifr: 33,
    name: 'Автоматическое регулирование ДВС'
  }, {
    shifr: 34,
    name: 'Автоматическое управление сваркой'
  }, {
    shifr: 35,
    name: 'Авторское право'
  }, {
    shifr: 36,
    name: 'Автотракторные ДВС'
  }, {
    shifr: 37,
    name: 'Агрегаты наддува ДВС'
  }, {
    shifr: 38,
    name: 'Адаптивная двигательная рекреация и реабилитация'
  }, {
    shifr: 39,
    name: 'Адаптивные модели в экономике'
  }, {
    shifr: 40,
    name: 'Адаптивные системы управления'
  }, {
    shifr: 41,
    name: 'Адвокатура'
  }, {
    shifr: 42,
    name: 'Аддитивные технологии в машиностроении'
  }, {
    shifr: 43,
    name: 'Административное право'
  }, {
    shifr: 44,
    name: 'Административный менеджмент'
  }, {
    shifr: 45,
    name: 'Администрирование баз данных'
  }, {
    shifr: 46,
    name: 'Администрирование баз данных Oracle'
  }, {
    shifr: 47,
    name: 'Администрирование вычислительных систем и сетей'
  }, {
    shifr: 48,
    name: 'Администрирование информационных систем на платформе Unix/Linux'
  }, {
    shifr: 49,
    name: 'Администрирование систем управления базами данных'
  }, {
    shifr: 50,
    name: 'Актуальные проблемы в управлении персоналом'
  }, {
    shifr: 51,
    name: 'Актуальные проблемы гражданского права и процесса'
  }, {
    shifr: 52,
    name: 'Актуальные проблемы издательского дела'
  }, {
    shifr: 53,
    name: 'Актуальные проблемы интеллектуальной собственности'
  }, {
    shifr: 54,
    name: 'Актуальные проблемы истории казачества'
  }, {
    shifr: 55,
    name: 'Актуальные проблемы историографии истории России'
  }, {
    shifr: 56,
    name: 'Актуальные проблемы исторических исследований'
  }, {
    shifr: 57,
    name: 'Актуальные проблемы международных отношений в Африке и Латинской Америке'
  }, {
    shifr: 58,
    name: 'Актуальные проблемы обязательственного права'
  }, {
    shifr: 59,
    name: 'Актуальные проблемы предупреждения современной преступности'
  }, {
    shifr: 60,
    name: 'Актуальные проблемы современного литературоведения'
  }, {
    shifr: 61,
    name: 'Актуальные проблемы современного религиоведения'
  }, {
    shifr: 62,
    name: 'Актуальные проблемы современного языкознания'
  }, {
    shifr: 63,
    name: 'Актуальные проблемы современной теологии'
  }, {
    shifr: 64,
    name: 'Актуальные проблемы современной электроники и наноэлектроники'
  }, {
    shifr: 65,
    name: 'Актуальные проблемы судоустройства'
  }, {
    shifr: 66,
    name: 'Актуальные проблемы теории и практики перевода'
  }, {
    shifr: 67,
    name: 'Актуальные проблемы уголовного права и процесса'
  }, {
    shifr: 68,
    name: 'Актуальные проблемы финансов'
  }, {
    shifr: 69,
    name: 'Актуальные теоретические и методологические проблемы гражданского права'
  }, {
    shifr: 70,
    name: 'Актуарная математика'
  }, {
    shifr: 71,
    name: 'Актуарные расчеты'
  }, {
    shifr: 72,
    name: 'Акустический контроль'
  }, {
    shifr: 73,
    name: 'Алгебра и геометрия'
  }, {
    shifr: 74,
    name: 'Алгоритмизация и программирование'
  }, {
    shifr: 75,
    name: 'Алгоритмизация и программное обеспечение в электроэнергетике'
  }, {
    shifr: 76,
    name: 'Алгоритмизация управления технологическими процессами'
  }, {
    shifr: 77,
    name: 'Алгоритмы и структуры данных'
  }, {
    shifr: 78,
    name: 'Алгоритмы управления подсистемами роботов'
  }, {
    shifr: 79,
    name: 'Алгоритмы цифровой обработки аналоговых сигналов'
  }, {
    shifr: 80,
    name: 'Алгоритмы цифровой обработки сигналов'
  }, {
    shifr: 81,
    name: 'Альтернативные источники энергии'
  }, {
    shifr: 82,
    name: 'Анализ данных'
  }, {
    shifr: 83,
    name: 'Анализ и прогнозирование финансовых процессов'
  }, {
    shifr: 84,
    name: 'Анализ поведения потребителей и маркетинговые исследования'
  }, {
    shifr: 85,
    name: 'Анализ финансовой отчетности'
  }, {
    shifr: 86,
    name: 'Анализ хозяйственной деятельности'
  }, {
    shifr: 87,
    name: 'Анализ, моделирование и оптимизация бизнес-процессов в корпоративных информационных системах'
  }, {
    shifr: 88,
    name: 'Аналитика православной культуры и цивилизации'
  }, {
    shifr: 89,
    name: 'Аналитическая геометрия и линейная алгебра'
  }, {
    shifr: 90,
    name: 'Аналитические и численные методы в планировании экспериментов и инженерном анализе'
  }, {
    shifr: 91,
    name: 'Аналитические и численные методы планирования экспериментов в инженерном анализе'
  }, {
    shifr: 92,
    name: 'Аналитический контроль биологических объектов и пищевых продуктов'
  }, {
    shifr: 93,
    name: 'Аналоговые измерительные устройства'
  }, {
    shifr: 94,
    name: 'Анатомия и физиология ЦНС'
  }, {
    shifr: 95,
    name: 'Анатомия и физиология человека'
  }, {
    shifr: 96,
    name: 'Анатомия ЦНС'
  }, {
    shifr: 97,
    name: 'Антикризисное управление в туристической отрасли (продвинутый уровень)'
  }, {
    shifr: 98,
    name: 'Антикризисное управление в туристской индустрии'
  }, {
    shifr: 99,
    name: 'Антикризисное управление персоналом'
  }, {
    shifr: 100,
    name: 'Античная литература'
  }, {
    shifr: 101,
    name: 'Античная философия'
  }, {
    shifr: 102,
    name: 'Антропология'
  }, {
    shifr: 103,
    name: 'Антропология с основами биологии и генетики'
  }, {
    shifr: 104,
    name: 'Аппаратная реализация промышленных логических контроллеров'
  }, {
    shifr: 105,
    name: 'Арбитражный процесс'
  }, {
    shifr: 106,
    name: 'Археография'
  }, {
    shifr: 107,
    name: 'Археология'
  }, {
    shifr: 108,
    name: 'Архивный менеджмент'
  }, {
    shifr: 109,
    name: 'Архивоведение'
  }, {
    shifr: 110,
    name: 'Архитекторика объемных форм'
  }, {
    shifr: 111,
    name: 'Архитектура и программирование мобильных устройств'
  }, {
    shifr: 112,
    name: 'Архитектура и проектирование программных систем'
  }, {
    shifr: 113,
    name: 'Архитектура интеллектуальных транспортных систем'
  }, {
    shifr: 114,
    name: 'Архитектура информационных компьютерных систем'
  }, {
    shifr: 115,
    name: 'Архитектура информационных систем'
  }, {
    shifr: 116,
    name: 'Архитектура информационных систем и облачных технологий'
  }, {
    shifr: 117,
    name: 'Архитектура компьютера'
  }, {
    shifr: 118,
    name: 'Архитектура компьютерных систем и сетей'
  }, {
    shifr: 119,
    name: 'Архитектура корпоративных приложений SAP'
  }, {
    shifr: 120,
    name: 'Архитектура ПК, сети ЭВМ'
  }, {
    shifr: 121,
    name: 'Архитектура предприятия'
  }, {
    shifr: 122,
    name: 'Архитектура распределенных информационных систем'
  }, {
    shifr: 123,
    name: 'Аскетика'
  }, {
    shifr: 124,
    name: 'Астрономия'
  }, {
    shifr: 125,
    name: 'Астрофизика'
  }, {
    shifr: 126,
    name: 'АТР в системе международных отношений'
  }, {
    shifr: 127,
    name: 'Аудиовизуальные средства подготовки технических проектов'
  }, {
    shifr: 128,
    name: 'Аудит'
  }, {
    shifr: 129,
    name: 'Аудит (продвинутый уровень)'
  }, {
    shifr: 130,
    name: 'Аудит персонала'
  }, {
    shifr: 131,
    name: 'Аудит политической системы'
  }, {
    shifr: 132,
    name: 'Аутсорсинг и транспортный бизнес промышленных предприятий'
  }, {
    shifr: 133,
    name: 'АФК в специальных учреждениях'
  }, {
    shifr: 134,
    name: 'Аэроакустика больших скоростей'
  }, {
    shifr: 135,
    name: 'Аэрогидромеханика'
  }, {
    shifr: 136,
    name: 'Аэродинамика вентиляционных систем'
  }, {
    shifr: 137,
    name: 'Аэродинамика лопастных систем и ветросиловых установок'
  }, {
    shifr: 138,
    name: 'Аэрокосмические методы в экологическом мониторинге и охране природы'
  }, {
    shifr: 139,
    name: 'Базы данных'
  }, {
    shifr: 140,
    name: 'Базы и банки данных (по специальности)'
  }, {
    shifr: 141,
    name: 'Банки и банковская деятельность'
  }, {
    shifr: 142,
    name: 'Банковские информационные системы'
  }, {
    shifr: 143,
    name: 'Банковские системы зарубежных стран'
  }, {
    shifr: 144,
    name: 'Банковский менеджмент'
  }, {
    shifr: 145,
    name: 'Банковское дело'
  }, {
    shifr: 146,
    name: 'Безопасность аварийно-спасательных работ'
  }, {
    shifr: 147,
    name: 'Безопасность движения автомобильного транспорта в рыночных условиях'
  }, {
    shifr: 148,
    name: 'Безопасность движения на железнодорожном транспорте'
  }, {
    shifr: 149,
    name: 'Безопасность жизнедеятельности'
  }, {
    shifr: 150,
    name: 'Безопасность жизнедеятельности в чрезвычайных ситуациях'
  }, {
    shifr: 151,
    name: 'Безопасность информационных технологий'
  }, {
    shifr: 152,
    name: 'Безопасность проведения спортивно-зрелищных и массовых мероприятий'
  }, {
    shifr: 153,
    name: 'Безопасность продукции'
  }, {
    shifr: 154,
    name: 'Безопасность транспортных средств'
  }, {
    shifr: 155,
    name: 'Безопасность туризма'
  }, {
    shifr: 156,
    name: 'Библиография и библиотечное дело'
  }, {
    shifr: 157,
    name: 'Бизнес-анализ'
  }, {
    shifr: 158,
    name: 'Бизнес-информатика'
  }, {
    shifr: 159,
    name: 'Бизнес-планирование на автомобильном транспорте'
  }, {
    shifr: 160,
    name: 'Биологический мониторинг'
  }, {
    shifr: 161,
    name: 'Биология'
  }, {
    shifr: 162,
    name: 'Биоразнообразие и особо охраняемые природные территории'
  }, {
    shifr: 163,
    name: 'Биофизика'
  }, {
    shifr: 164,
    name: 'Биохимия и биомеханика'
  }, {
    shifr: 165,
    name: 'Болезни цивилизации'
  }, {
    shifr: 166,
    name: 'Брендинг в сфере спорта'
  }, {
    shifr: 167,
    name: 'Бренд-менеджмент'
  }, {
    shifr: 168,
    name: 'Бухгалтерский учет'
  }, {
    shifr: 169,
    name: 'Бухгалтерский учет (общая теория)'
  }, {
    shifr: 170,
    name: 'Бухгалтерский учет в отрасли'
  }, {
    shifr: 171,
    name: 'Бухгалтерский учет и аудит в издательской сфере'
  }, {
    shifr: 172,
    name: 'Бухгалтерский учет и аудит ВЭД'
  }, {
    shifr: 173,
    name: 'Бухгалтерский учет на предприятиях малого бизнеса'
  }, {
    shifr: 174,
    name: 'Бухгалтерский финансовый учет и отчетность (продвинутый уровень)'
  }, {
    shifr: 175,
    name: 'Бюджетирование'
  }, {
    shifr: 176,
    name: 'Бюджетная система'
  }, {
    shifr: 177,
    name: 'Вагоны'
  }, {
    shifr: 178,
    name: 'Вакуумная и плазменная электроника'
  }, {
    shifr: 179,
    name: 'Вакуумная техника'
  }, {
    shifr: 180,
    name: 'Валютно-кредитные и финансовые отношения'
  }, {
    shifr: 181,
    name: 'Введение в диалектику (учение о развитии)'
  }, {
    shifr: 182,
    name: 'Введение в инженерную деятельность'
  }, {
    shifr: 183,
    name: 'Введение в инжиниринг подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 184,
    name: 'Введение в информационные системы'
  }, {
    shifr: 185,
    name: 'Введение в историю и теорию институтов конфликторазрешения и поддержания мира'
  }, {
    shifr: 186,
    name: 'Введение в историю науки'
  }, {
    shifr: 187,
    name: 'Введение в качество, стандартизацию и сертификацию'
  }, {
    shifr: 188,
    name: 'Введение в литературоведение'
  }, {
    shifr: 189,
    name: 'Введение в металлургию'
  }, {
    shifr: 190,
    name: 'Введение в программную инженерию'
  }, {
    shifr: 191,
    name: 'Введение в проектирование и технологию изготовления одежды'
  }, {
    shifr: 192,
    name: 'Введение в профессионально-педагогическую деятельность'
  }, {
    shifr: 193,
    name: 'Введение в профессиональную деятельность'
  }, {
    shifr: 194,
    name: 'Введение в профессию'
  }, {
    shifr: 195,
    name: 'Введение в славянскую филологию'
  }, {
    shifr: 196,
    name: 'Введение в социологию'
  }, {
    shifr: 197,
    name: 'Введение в специальность'
  }, {
    shifr: 198,
    name: 'Введение в специальность (философская пропедевтика)'
  }, {
    shifr: 199,
    name: 'Введение в теорию финансов'
  }, {
    shifr: 200,
    name: 'Введение в технику измерений'
  }, {
    shifr: 201,
    name: 'Введение в физику твердого тела'
  }, {
    shifr: 202,
    name: 'Введение в электронику и наноэлектронику'
  }, {
    shifr: 203,
    name: 'Введение в электроэнергетику'
  }, {
    shifr: 204,
    name: 'Введение в языкознание'
  }, {
    shifr: 205,
    name: 'Веб-программирование'
  }, {
    shifr: 206,
    name: 'Ведение планово-экономической документации'
  }, {
    shifr: 207,
    name: 'Ведение профессиональных документов'
  }, {
    shifr: 208,
    name: 'Векторный и тензорный анализ'
  }, {
    shifr: 209,
    name: 'Венчурный бизнес: управление и контроль'
  }, {
    shifr: 210,
    name: 'Взаимодействие видов транспорта в транспортных системах'
  }, {
    shifr: 211,
    name: 'Взаимодействие видов транспорта на промышленном транспорте'
  }, {
    shifr: 212,
    name: 'Взаимодействие когерентного излучения с веществом'
  }, {
    shifr: 213,
    name: 'Взаимозаменяемость и нормирование точности'
  }, {
    shifr: 214,
    name: 'Взаимозаменяемость, стандартизация и технические измерения'
  }, {
    shifr: 215,
    name: 'Вибро- и шумозащита на подвижном составе'
  }, {
    shifr: 216,
    name: 'Виды доказательств в уголовном процессе'
  }, {
    shifr: 217,
    name: 'Визуализация экономической информации'
  }, {
    shifr: 218,
    name: 'Внешнеэкономическая деятельность региона'
  }, {
    shifr: 219,
    name: 'Внешняя политика стран Азии'
  }, {
    shifr: 220,
    name: 'Внешняя политика стран Западной Европы'
  }, {
    shifr: 221,
    name: 'Внешняя политика стран Северной Америки'
  }, {
    shifr: 222,
    name: 'Внешняя политика стран Центральной и Восточной Европы'
  }, {
    shifr: 223,
    name: 'Внутренний экономический механизм предприятия'
  }, {
    shifr: 224,
    name: 'Военная сила в мировой политике'
  }, {
    shifr: 225,
    name: 'Возрастная педагогика'
  }, {
    shifr: 226,
    name: 'Волновые обменники давления'
  }, {
    shifr: 227,
    name: 'Волны в сплошных средах'
  }, {
    shifr: 228,
    name: 'Восстановительное правосудие и альтернативы уголовной ответственности'
  }, {
    shifr: 229,
    name: 'Всеобщая история'
  }, {
    shifr: 230,
    name: 'Вспомогательные исторические дисциплины'
  }, {
    shifr: 231,
    name: 'Встроенные алгоритмические языки'
  }, {
    shifr: 232,
    name: 'Второй иностранный язык'
  }, {
    shifr: 233,
    name: 'Выпускная квалификационная работа бакалавра'
  }, {
    shifr: 234,
    name: 'Высокоскоростные магистрали и пассажирские станции'
  }, {
    shifr: 235,
    name: 'Высшая математика'
  }, {
    shifr: 236,
    name: 'Вычислительная техника, сети и прикладное программирование на автотранспорте'
  }, {
    shifr: 237,
    name: 'Вычислительная физика'
  }, {
    shifr: 238,
    name: 'Вычислительные машины, системы и сети'
  }, {
    shifr: 239,
    name: 'Вычислительные методы в физики'
  }, {
    shifr: 240,
    name: 'Вычислительные системы'
  }, {
    shifr: 241,
    name: 'Вычислительные системы, сети и коммуникации'
  }, {
    shifr: 242,
    name: 'Вычислительные системы, сети, телекоммуникации'
  }, {
    shifr: 243,
    name: 'ВЭД организации'
  }, {
    shifr: 244,
    name: 'Газетно-журнальные издания'
  }, {
    shifr: 245,
    name: 'Газодымозащитная служба'
  }, {
    shifr: 246,
    name: 'Гендерная социология'
  }, {
    shifr: 247,
    name: 'Генеральный план и транспорт промышленных предприятий'
  }, {
    shifr: 248,
    name: 'Генеральный план транспортной инфраструктуры'
  }, {
    shifr: 249,
    name: 'География'
  }, {
    shifr: 250,
    name: 'География туризма'
  }, {
    shifr: 251,
    name: 'Геология с основами геоморфологии'
  }, {
    shifr: 252,
    name: 'Геополитика'
  }, {
    shifr: 253,
    name: 'Геохимия окружающей среды'
  }, {
    shifr: 254,
    name: 'Геоэкология'
  }, {
    shifr: 255,
    name: 'Гигиена одежды'
  }, {
    shifr: 256,
    name: 'Гидравлика'
  }, {
    shifr: 257,
    name: 'Гидравлика и гидропневмопривод'
  }, {
    shifr: 258,
    name: 'Гидромеханические процессы в элементах и системах ГПА'
  }, {
    shifr: 259,
    name: 'Гидропривод и средства гидроавтоматики'
  }, {
    shifr: 260,
    name: 'Гидроупругость'
  }, {
    shifr: 261,
    name: 'Гидрофицированное технологическое оборудование'
  }, {
    shifr: 262,
    name: 'Гидрофицированные мобильные машины'
  }, {
    shifr: 263,
    name: 'ГИС в экологии и природопользовании'
  }, {
    shifr: 264,
    name: 'Глобализационные процессы и СМИ'
  }, {
    shifr: 265,
    name: 'Глобалистика'
  }, {
    shifr: 266,
    name: 'Глобальные и локальные сети бронирования'
  }, {
    shifr: 267,
    name: 'Городской транспортный комплекс'
  }, {
    shifr: 268,
    name: 'Государственная и муниципальная служба'
  }, {
    shifr: 269,
    name: 'Государственная политика'
  }, {
    shifr: 270,
    name: 'Государственная, региональная и муниципальная молодежная политика'
  }, {
    shifr: 271,
    name: 'Государственное и региональное управление'
  }, {
    shifr: 272,
    name: 'Государственное право'
  }, {
    shifr: 273,
    name: 'Государственное управление в спорте'
  }, {
    shifr: 274,
    name: 'Государственное управление и местное самоуправление'
  }, {
    shifr: 275,
    name: 'Государственные деятели России XIX - нач. XX вв.'
  }, {
    shifr: 276,
    name: 'Государственные и муниципальные финансы'
  }, {
    shifr: 277,
    name: 'Государственные, муниципальные и ведомственные архивы'
  }, {
    shifr: 278,
    name: 'Государственный надзор в области гражданской обороны'
  }, {
    shifr: 279,
    name: 'Государственный надзор в области защиты населения и территорий в ЧС'
  }, {
    shifr: 280,
    name: 'Государственный пожарный надзор'
  }, {
    shifr: 281,
    name: 'Государственный экзамен'
  }, {
    shifr: 282,
    name: 'Гражданская и правовая культура молодежи'
  }, {
    shifr: 283,
    name: 'Гражданская оборона'
  }, {
    shifr: 284,
    name: 'Гражданский процесс'
  }, {
    shifr: 285,
    name: 'Гражданское право'
  }, {
    shifr: 286,
    name: 'Грамматика'
  }, {
    shifr: 287,
    name: 'Грамматические проблемы перевода'
  }, {
    shifr: 288,
    name: 'Грузоведение'
  }, {
    shifr: 289,
    name: 'Грузоведение и грузовые перевозки'
  }, {
    shifr: 290,
    name: 'Грузовые и пассажирские транспортные системы'
  }, {
    shifr: 291,
    name: 'Грузовые перевозки'
  }, {
    shifr: 292,
    name: 'Грузоподъемные машины'
  }, {
    shifr: 293,
    name: 'Гуманистическая психология'
  }, {
    shifr: 294,
    name: 'Двигатели внешнего сгорания'
  }, {
    shifr: 295,
    name: 'Двигатели летательных аппаратов'
  }, {
    shifr: 296,
    name: 'Двигатели специального назначения'
  }, {
    shifr: 297,
    name: 'Девиантология, пенитенциарная психология и педагогика'
  }, {
    shifr: 298,
    name: 'Деловодство в отрасли'
  }, {
    shifr: 299,
    name: 'Деловодство и кадровый учет в государственной системе управления'
  }, {
    shifr: 300,
    name: 'Деловое общение на иностранном языке'
  }, {
    shifr: 301,
    name: 'Деловой иностранный язык'
  }, {
    shifr: 302,
    name: 'Деловой иностранный язык (английский)'
  }, {
    shifr: 303,
    name: 'Деловой протокол и этикет'
  }, {
    shifr: 304,
    name: 'Деловые коммуникации'
  }, {
    shifr: 305,
    name: 'Делопроизводство в профессиональной сфере'
  }, {
    shifr: 306,
    name: 'Деньги, кредит, банки'
  }, {
    shifr: 307,
    name: 'Деонтология журналистики'
  }, {
    shifr: 308,
    name: 'Деонтология социальной работы'
  }, {
    shifr: 309,
    name: 'Детали машин'
  }, {
    shifr: 310,
    name: 'Детали машин и основы конструирования'
  }, {
    shifr: 311,
    name: 'Детали машин и основы проектирования'
  }, {
    shifr: 312,
    name: 'Детали оборудования электронной промышленности и основы конструирования'
  }, {
    shifr: 313,
    name: 'Деформационно-термическая обработка материалов'
  }, {
    shifr: 314,
    name: 'Диагностика и надежность автоматизированных систем'
  }, {
    shifr: 315,
    name: 'Диагностика и прогнозирование угроз экономической безопасности'
  }, {
    shifr: 316,
    name: 'Диагностика и техническое обслуживание ДВС'
  }, {
    shifr: 317,
    name: 'Диагностика информационно-измерительных систем'
  }, {
    shifr: 318,
    name: 'Диагностика конфликтных действий и определяющих их факторов'
  }, {
    shifr: 319,
    name: 'Диагностика разрушения сварных конструкций'
  }, {
    shifr: 320,
    name: 'Диагностика электрооборудования'
  }, {
    shifr: 321,
    name: 'Диагностика, ремонт и монтаж оборудования'
  }, {
    shifr: 322,
    name: 'Дидактика высшей школы'
  }, {
    shifr: 323,
    name: 'Динамика вязкого газа'
  }, {
    shifr: 324,
    name: 'Динамика вязкой жидкости'
  }, {
    shifr: 325,
    name: 'Динамика грузоподъемных кранов'
  }, {
    shifr: 326,
    name: 'Динамика грузоподъемных кранов как единых электромеханических систем'
  }, {
    shifr: 327,
    name: 'Динамика ДВС'
  }, {
    shifr: 328,
    name: 'Динамика и регулирование гидропневмосистем'
  }, {
    shifr: 329,
    name: 'Динамика механических систем'
  }, {
    shifr: 330,
    name: 'Динамика подвижного состава'
  }, {
    shifr: 331,
    name: 'Динамика технологического оборудования'
  }, {
    shifr: 332,
    name: 'Динамическая теория информации'
  }, {
    shifr: 333,
    name: 'Дипломатическая и консульская служба'
  }, {
    shifr: 334,
    name: 'Дипломатический протокол и этикет'
  }, {
    shifr: 335,
    name: 'Дипломатическое и консульское право'
  }, {
    shifr: 336,
    name: 'Дипломный проект'
  }, {
    shifr: 337,
    name: 'Дискретная математика'
  }, {
    shifr: 338,
    name: 'Дискретные и вероятностные модели'
  }, {
    shifr: 339,
    name: 'Дискретный анализ в экономике'
  }, {
    shifr: 340,
    name: 'Дифференциальная психология'
  }, {
    shifr: 341,
    name: 'Дифференциальные уравнения'
  }, {
    shifr: 342,
    name: 'Дифференциальные уравнения. Интегральные уравнения и вариационное исчисление.'
  }, {
    shifr: 343,
    name: 'Дифференциация социальных клиентов'
  }, {
    shifr: 344,
    name: 'Диффузионные процессы в стационарных газовых течениях'
  }, {
    shifr: 345,
    name: 'Документационное обеспечение деятельности организации'
  }, {
    shifr: 346,
    name: 'Документационное обеспечение управление гостиничным предприятием'
  }, {
    shifr: 347,
    name: 'Документационное обеспечение управления проектами'
  }, {
    shifr: 348,
    name: 'Документная лингвистика'
  }, {
    shifr: 349,
    name: 'Документоведение'
  }, {
    shifr: 350,
    name: 'Донбасс как объект туристско-экскурсионной деятельности'
  }, {
    shifr: 351,
    name: 'Дополнительные главы математики'
  }, {
    shifr: 352,
    name: 'Дополнительные разделы физики'
  }, {
    shifr: 353,
    name: 'Дополнительный курс физики'
  }, {
    shifr: 354,
    name: 'Дорожные машины'
  }, {
    shifr: 355,
    name: 'Древнерусская литература'
  }, {
    shifr: 356,
    name: 'Духовно-нравственная безопасность в современном мире'
  }, {
    shifr: 357,
    name: 'Духовно-нравственное воспитание в высшей школе'
  }, {
    shifr: 358,
    name: 'Духовно-нравственное воспитание личности в системе профессионального образования'
  }, {
    shifr: 359,
    name: 'Духовно-нравственный потенциал культуры и цивилизации'
  }, {
    shifr: 360,
    name: 'Естественнонаучная картина мира'
  }, {
    shifr: 361,
    name: 'Жанровые теории перевода'
  }, {
    shifr: 362,
    name: 'Жанры печатных СМИ'
  }, {
    shifr: 363,
    name: 'Железнодорожные станции и узлы, технология и эксплуатация'
  }, {
    shifr: 364,
    name: 'Железнодорожные станции и узлы, транспортные коридоры'
  }, {
    shifr: 365,
    name: 'Журналист в экстремальных ситуациях'
  }, {
    shifr: 366,
    name: 'Журналистика'
  }, {
    shifr: 367,
    name: 'Журналистика как социокультурный феномен'
  }, {
    shifr: 368,
    name: 'Журналистика онлайн'
  }, {
    shifr: 369,
    name: 'Журналистика печатных СМИ'
  }, {
    shifr: 370,
    name: 'Журналистское расследование'
  }, {
    shifr: 371,
    name: 'Законодательная база делопроизводства и архивного дела'
  }, {
    shifr: 372,
    name: 'Зарубежная литература 20 века'
  }, {
    shifr: 373,
    name: 'Зарубежная литература средних веков и эпохи Возрождения'
  }, {
    shifr: 374,
    name: 'Зарубежная философия ХIX века'
  }, {
    shifr: 375,
    name: 'Защита в системах электроснабжения'
  }, {
    shifr: 376,
    name: 'Защита данных в сетях ЭВМ'
  }, {
    shifr: 377,
    name: 'Защита интеллектуальной собственности'
  }, {
    shifr: 378,
    name: 'Защита интеллектуальной собственности и патентоведение'
  }, {
    shifr: 379,
    name: 'Защита информации'
  }, {
    shifr: 380,
    name: 'Защита прав интеллектуальной собственности'
  }, {
    shifr: 381,
    name: 'Здания, сооружения и их устойчивость при пожарах'
  }, {
    shifr: 382,
    name: 'Земельное право'
  }, {
    shifr: 383,
    name: 'Зоопсихология и сравнительная психология'
  }, {
    shifr: 384,
    name: 'Ивент-менеджмент в спорте'
  }, {
    shifr: 385,
    name: 'Идентификация и моделирование технических объектов'
  }, {
    shifr: 386,
    name: 'Избирательная кампания и средства политической мобилизации'
  }, {
    shifr: 387,
    name: 'Издательское дело'
  }, {
    shifr: 388,
    name: 'Издательское планирование и управление издательским портфелем'
  }, {
    shifr: 389,
    name: 'Измерения в гидравлических и теплотехнических процессах'
  }, {
    shifr: 390,
    name: 'Измерительные преобразователи'
  }, {
    shifr: 391,
    name: 'Имитационное моделирование'
  }, {
    shifr: 392,
    name: 'Имитационное моделирование автоматизированных технологических комплексов'
  }, {
    shifr: 393,
    name: 'Имитационное моделирование дискретных процессов и производств'
  }, {
    shifr: 394,
    name: 'Имитационное моделирование мехатронных и робототехнических систем'
  }, {
    shifr: 395,
    name: 'Имитационное моделирование технических систем'
  }, {
    shifr: 396,
    name: 'Импульсно-модуляционные системы'
  }, {
    shifr: 397,
    name: 'Импульсные и цифровые устройства'
  }, {
    shifr: 398,
    name: 'Импульсные методы обработки'
  }, {
    shifr: 399,
    name: 'Инвестиции'
  }, {
    shifr: 400,
    name: 'Инвестиции в инновационной деятельности'
  }, {
    shifr: 401,
    name: 'Инвестиционный менеджмент'
  }, {
    shifr: 402,
    name: 'Инженерия знаний и проектирования баз знаний'
  }, {
    shifr: 403,
    name: 'Инженерия поверхности'
  }, {
    shifr: 404,
    name: 'Инженерия поверхностного слоя'
  }, {
    shifr: 405,
    name: 'Инженерия программного обеспечения'
  }, {
    shifr: 406,
    name: 'Инженерная графика'
  }, {
    shifr: 407,
    name: 'Инженерная и компьютерная графика'
  }, {
    shifr: 408,
    name: 'Инженерное обеспечение качества машин'
  }, {
    shifr: 409,
    name: 'Инженерные основы защиты атмосферы и гидросферы'
  }, {
    shifr: 410,
    name: 'Инжиниринг в интеллектуальной собственности'
  }, {
    shifr: 411,
    name: 'Инклюзивное и адаптивное физическое воспитание в учреждениях общего и профессионального образования'
  }, {
    shifr: 412,
    name: 'Инклюзивное образование как форма социальной работы'
  }, {
    shifr: 413,
    name: 'Инновации в САПР изделий легкой промышленности'
  }, {
    shifr: 414,
    name: 'Инновации в социальной работе'
  }, {
    shifr: 415,
    name: 'Инновации и интеллектуальная собственность'
  }, {
    shifr: 416,
    name: 'Инновационная деятельность'
  }, {
    shifr: 417,
    name: 'Инновационное предпринимательство'
  }, {
    shifr: 418,
    name: 'Инновационное предпринимательство в сфере интеллектуальной собственности'
  }, {
    shifr: 419,
    name: 'Инновационное развитие предприятия'
  }, {
    shifr: 420,
    name: 'Инновационные методики преподавания маркетинговых дисциплин'
  }, {
    shifr: 421,
    name: 'Инновационные методы в работе с молодежью'
  }, {
    shifr: 422,
    name: 'Инновационные методы изготовления и контроля литых заготовок'
  }, {
    shifr: 423,
    name: 'Инновационные направления развития транспорта и управление инновациями на транспорте'
  }, {
    shifr: 424,
    name: 'Инновационные психолого-педагогические технологии'
  }, {
    shifr: 425,
    name: 'Инновационные технологии в туризме'
  }, {
    shifr: 426,
    name: 'Инновационные технологии в туристской индустрии'
  }, {
    shifr: 427,
    name: 'Инновационные технологии и оборудование для упаковки продукции'
  }, {
    shifr: 428,
    name: 'Инновационные технологии обучения в профессиональном образовании'
  }, {
    shifr: 429,
    name: 'Инновационные технологии решения нестандартных инженерных проектов'
  }, {
    shifr: 430,
    name: 'Инновационные технологии социальной работы'
  }, {
    shifr: 431,
    name: 'Инновационный маркетинг'
  }, {
    shifr: 432,
    name: 'Инновационный менеджмент'
  }, {
    shifr: 433,
    name: 'Иностранный язык'
  }, {
    shifr: 434,
    name: 'Иностранный язык (второй)'
  }, {
    shifr: 435,
    name: 'Иностранный язык 1-ый'
  }, {
    shifr: 436,
    name: 'Иностранный язык в профессиональной сфере'
  }, {
    shifr: 437,
    name: 'Иностранный язык в профессиональной сфере (английский)'
  }, {
    shifr: 438,
    name: 'Иностранный язык в сфере профессионального общения'
  }, {
    shifr: 439,
    name: 'Иностранный язык в сфере юриспруденции'
  }, {
    shifr: 440,
    name: 'Иностранный язык межкультурной коммуникации (1-й)'
  }, {
    shifr: 441,
    name: 'Иностранный язык межкультурной коммуникации (2-й)'
  }, {
    shifr: 442,
    name: 'Институт обжалования и пересмотра судебных решений в уголовном процессе'
  }, {
    shifr: 443,
    name: 'Институциональные основы управления человеческими ресурсами в организации'
  }, {
    shifr: 444,
    name: 'Институционный анализ интеллектуальной собственности'
  }, {
    shifr: 445,
    name: 'Инструментальная техника'
  }, {
    shifr: 446,
    name: 'Инструментальные материалы'
  }, {
    shifr: 447,
    name: 'Инструментальные системы для ГПМ'
  }, {
    shifr: 448,
    name: 'Инструментальные системы машиностроительных производств'
  }, {
    shifr: 449,
    name: 'Инструментальные средства информационных систем'
  }, {
    shifr: 450,
    name: 'Инструментальные средства компьютерной графики'
  }, {
    shifr: 451,
    name: 'Инструменты усовершенствования процессов системы качества'
  }, {
    shifr: 452,
    name: 'Интегрированные маркетинговые коммуникации'
  }, {
    shifr: 453,
    name: 'Интегрированные транспортные системы'
  }, {
    shifr: 454,
    name: 'Интеллектуальная собственность'
  }, {
    shifr: 455,
    name: 'Интеллектуальная собственность и инноватика'
  }, {
    shifr: 456,
    name: 'Интеллектуальные автоматизированные системы'
  }, {
    shifr: 457,
    name: 'Интеллектуальные датчики'
  }, {
    shifr: 458,
    name: 'Интеллектуальные интернет-технологии'
  }, {
    shifr: 459,
    name: 'Интеллектуальные информационные системы'
  }, {
    shifr: 460,
    name: 'Интеллектуальные информационные системы в экономике'
  }, {
    shifr: 461,
    name: 'Интеллектуальные системы'
  }, {
    shifr: 462,
    name: 'Интеллектуальные системы в автоматизированных системах управления'
  }, {
    shifr: 463,
    name: 'Интеллектуальные системы и технологии'
  }, {
    shifr: 464,
    name: 'Интеллектуальный анализ в политических исследованиях'
  }, {
    shifr: 465,
    name: 'Интеллектуальный анализ данных'
  }, {
    shifr: 466,
    name: 'Интеллектуальный бизнес'
  }, {
    shifr: 467,
    name: 'Интеллигентоведение'
  }, {
    shifr: 468,
    name: 'Интерактивное моделирование технологических и технических объектов'
  }, {
    shifr: 469,
    name: 'Интермодальные транспортные технологии'
  }, {
    shifr: 470,
    name: 'Интернет-журналистика'
  }, {
    shifr: 471,
    name: 'Интернет-маркетинг'
  }, {
    shifr: 472,
    name: 'Интернет-программирование'
  }, {
    shifr: 473,
    name: 'Интернет-технологии'
  }, {
    shifr: 474,
    name: 'Интерфейсы интегрированных систем автоматизации технологических процессов'
  }, {
    shifr: 475,
    name: 'Интерфейсы ЭВМ и систем'
  }, {
    shifr: 476,
    name: 'Инфокоммуникационные системы и сети'
  }, {
    shifr: 477,
    name: 'Информатика'
  }, {
    shifr: 478,
    name: 'Информатика и информационно-коммуникационные технологии'
  }, {
    shifr: 479,
    name: 'Информатика и информационные технологии'
  }, {
    shifr: 480,
    name: 'Информационная безопасность и защита инновационной деятельности'
  }, {
    shifr: 481,
    name: 'Информационная безопасность и защита информации'
  }, {
    shifr: 482,
    name: 'Информационная безопасность и защита прав интеллектуальной собственности'
  }, {
    shifr: 483,
    name: 'Информационная культура'
  }, {
    shifr: 484,
    name: 'Информационная поддержка процессов жизненного цикла программных систем'
  }, {
    shifr: 485,
    name: 'Информационное обеспечение автотранспортных систем'
  }, {
    shifr: 486,
    name: 'Информационное обеспечение в работе с молодежью'
  }, {
    shifr: 487,
    name: 'Информационное право'
  }, {
    shifr: 488,
    name: 'Информационно-коммуникативные технологии'
  }, {
    shifr: 489,
    name: 'Информационно-коммуникативные технологии в научных исследованиях и профессиональной деятельности'
  }, {
    shifr: 490,
    name: 'Информационно-коммуникационные технологии в бизнесе'
  }, {
    shifr: 491,
    name: 'Информационно-коммуникационные технологии в научных исследованиях и профессиональной деятельности'
  }, {
    shifr: 492,
    name: 'Информационно-коммуникационные технологии в профессиональном образовании'
  }, {
    shifr: 493,
    name: 'Информационные и коммуникационные технологии'
  }, {
    shifr: 494,
    name: 'Информационные и компьютерные технологии в материаловедении'
  }, {
    shifr: 495,
    name: 'Информационные процессы в производственных системах'
  }, {
    shifr: 496,
    name: 'Информационные ресурсы и технологии в менеджменте'
  }, {
    shifr: 497,
    name: 'Информационные сети и телекоммуникации'
  }, {
    shifr: 498,
    name: 'Информационные сети и телекоммуникации автоматизированных систем'
  }, {
    shifr: 499,
    name: 'Информационные системы в бухгалтерской и финансовой деятельности'
  }, {
    shifr: 500,
    name: 'Информационные системы в мехатронике и робототехнике'
  }, {
    shifr: 501,
    name: 'Информационные системы в управлении'
  }, {
    shifr: 502,
    name: 'Информационные системы в управлении архивных учреждений'
  }, {
    shifr: 503,
    name: 'Информационные системы в управлении производственной деятельностью предприятия'
  }, {
    shifr: 504,
    name: 'Информационные системы и технологии'
  }, {
    shifr: 505,
    name: 'Информационные системы и технологии в издательском деле'
  }, {
    shifr: 506,
    name: 'Информационные системы и технологии в менеджменте'
  }, {
    shifr: 507,
    name: 'Информационные системы и технологии в туристской индустрии'
  }, {
    shifr: 508,
    name: 'Информационные системы и технологии в управлении экономикой'
  }, {
    shifr: 509,
    name: 'Информационные системы оценки и прогнозирования пожаров'
  }, {
    shifr: 510,
    name: 'Информационные системы реального времени'
  }, {
    shifr: 511,
    name: 'Информационные системы средств автоматизации'
  }, {
    shifr: 512,
    name: 'Информационные системы электронного документооборота'
  }, {
    shifr: 513,
    name: 'Информационные технологии'
  }, {
    shifr: 514,
    name: 'Информационные технологии в двигателестроении'
  }, {
    shifr: 515,
    name: 'Информационные технологии в документационном обеспечении управления и архивном деле'
  }, {
    shifr: 516,
    name: 'Информационные технологии в метрологии'
  }, {
    shifr: 517,
    name: 'Информационные технологии в отрасли'
  }, {
    shifr: 518,
    name: 'Информационные технологии в отрасли (области знаний)'
  }, {
    shifr: 519,
    name: 'Информационные технологии в отрасли (САПР)'
  }, {
    shifr: 520,
    name: 'Информационные технологии в приборостроении'
  }, {
    shifr: 521,
    name: 'Информационные технологии в профессиональной деятельности'
  }, {
    shifr: 522,
    name: 'Информационные технологии в современной архивной деятельности'
  }, {
    shifr: 523,
    name: 'Информационные технологии в сфере безопасности'
  }, {
    shifr: 524,
    name: 'Информационные технологии в управлении безопасностью жизнедеятельности'
  }, {
    shifr: 525,
    name: 'Информационные технологии в электронной промышленности'
  }, {
    shifr: 526,
    name: 'Информационные технологии в юридической деятельности'
  }, {
    shifr: 527,
    name: 'Информационные технологии для автоматизации делопроизводства в органах государственной власти'
  }, {
    shifr: 528,
    name: 'Информационные технологии и автоматизация в металлургии'
  }, {
    shifr: 529,
    name: 'Информационные технологии на магистральном транспорте'
  }, {
    shifr: 530,
    name: 'Информационные технологии на промышленном транспорте'
  }, {
    shifr: 531,
    name: 'Информационные технологии на транспорте'
  }, {
    shifr: 532,
    name: 'Информационные технологии обеспечения безопасности движения на транспорте'
  }, {
    shifr: 533,
    name: 'Информационный менеджмент'
  }, {
    shifr: 534,
    name: 'Информация в медиакоммуникациях'
  }, {
    shifr: 535,
    name: 'Инфраструктура и склады транспортных систем'
  }, {
    shifr: 536,
    name: 'Инфраструктура товарного рынка'
  }, {
    shifr: 537,
    name: 'Искусственный интеллект'
  }, {
    shifr: 538,
    name: 'Исполнительные механизмы и регулирующие органы автоматики'
  }, {
    shifr: 539,
    name: 'Испытания ДВС'
  }, {
    shifr: 540,
    name: 'Испытания, эксплуатация и ремонт электротехнических устройств'
  }, {
    shifr: 541,
    name: 'Исследование и испытание автомобилей'
  }, {
    shifr: 542,
    name: 'Исследование и испытание станков'
  }, {
    shifr: 543,
    name: 'Исследование и испытания объектов инструментальных систем'
  }, {
    shifr: 544,
    name: 'Исследование и моделирование транспортных процессов'
  }, {
    shifr: 545,
    name: 'Исследование операций'
  }, {
    shifr: 546,
    name: 'Исследование операций в транспортных системах'
  }, {
    shifr: 547,
    name: 'Исследования и испытания наземных транспортно-технологических машин'
  }, {
    shifr: 548,
    name: 'Исследования канатных грейферных механизмов'
  }, {
    shifr: 549,
    name: 'Историко-философский процесс в культурном контексте'
  }, {
    shifr: 550,
    name: 'Историческая антропология'
  }, {
    shifr: 551,
    name: 'Историческая география'
  }, {
    shifr: 552,
    name: 'Историческая грамматика'
  }, {
    shifr: 553,
    name: 'Историческое краеведение'
  }, {
    shifr: 554,
    name: 'История'
  }, {
    shifr: 555,
    name: 'История Азии и Африки в средние века'
  }, {
    shifr: 556,
    name: 'История аналитики от Аристотеля до Венской школы'
  }, {
    shifr: 557,
    name: 'История бухгалтерской мысли и учета'
  }, {
    shifr: 558,
    name: 'История внешней политики России'
  }, {
    shifr: 559,
    name: 'История возникновения и развития высшего образования'
  }, {
    shifr: 560,
    name: 'История гендерных отношений'
  }, {
    shifr: 561,
    name: 'История государства и права зарубежных стран'
  }, {
    shifr: 562,
    name: 'История государственно-конфессиональных отношений в современной России'
  }, {
    shifr: 563,
    name: 'История гражданской защиты'
  }, {
    shifr: 564,
    name: 'История Древнего мира'
  }, {
    shifr: 565,
    name: 'История Западных и Южных славян в средние века и новое время'
  }, {
    shifr: 566,
    name: 'История Западных конфессий'
  }, {
    shifr: 567,
    name: 'История зарубежного издательского дела'
  }, {
    shifr: 568,
    name: 'История зарубежной журналистики'
  }, {
    shifr: 569,
    name: 'История зарубежной литературы'
  }, {
    shifr: 570,
    name: 'История зарубежной литературы 17-18 веков'
  }, {
    shifr: 571,
    name: 'История зарубежной литературы 19 века'
  }, {
    shifr: 572,
    name: 'История и культура стран второго иностранного языка'
  }, {
    shifr: 573,
    name: 'История и методология науки и современные проблемы стандартизации и метрологии'
  }, {
    shifr: 574,
    name: 'История и методология науки и техники в области нанотехнологии и актуальные проблемы современной электроники'
  }, {
    shifr: 575,
    name: 'История и методология науки и техники в области электроники'
  }, {
    shifr: 576,
    name: 'История и методология педагогической науки'
  }, {
    shifr: 577,
    name: 'История и методология современного комплексного регионоведения'
  }, {
    shifr: 578,
    name: 'История и методология теологии'
  }, {
    shifr: 579,
    name: 'История и методология физики'
  }, {
    shifr: 580,
    name: 'История и методология юридической науки'
  }, {
    shifr: 581,
    name: 'История исторической науки'
  }, {
    shifr: 582,
    name: 'История конфликтологии'
  }, {
    shifr: 583,
    name: 'История костюма и моды'
  }, {
    shifr: 584,
    name: 'История литературной критики'
  }, {
    shifr: 585,
    name: 'История литературы родного края'
  }, {
    shifr: 586,
    name: 'История литературы стран изучаемого языка'
  }, {
    shifr: 587,
    name: 'История международных отношений'
  }, {
    shifr: 588,
    name: 'История мировой литературы'
  }, {
    shifr: 589,
    name: 'История мировых религий (религиоведение)'
  }, {
    shifr: 590,
    name: 'История мировых цивилизаций'
  }, {
    shifr: 591,
    name: 'История науки и техники'
  }, {
    shifr: 592,
    name: 'История Отечества'
  }, {
    shifr: 593,
    name: 'История отечественного государства и права'
  }, {
    shifr: 594,
    name: 'История отечественного издательского дела'
  }, {
    shifr: 595,
    name: 'История отечественной журналистики'
  }, {
    shifr: 596,
    name: 'История отечественной литературы'
  }, {
    shifr: 597,
    name: 'История отечественной социологии'
  }, {
    shifr: 598,
    name: 'История первобытного общества'
  }, {
    shifr: 599,
    name: 'История первого иностранного языка'
  }, {
    shifr: 600,
    name: 'История перевода'
  }, {
    shifr: 601,
    name: 'История политических партий и общественных движений современной России'
  }, {
    shifr: 602,
    name: 'История политических учений'
  }, {
    shifr: 603,
    name: 'История психологии'
  }, {
    shifr: 604,
    name: 'История развития и современные проблемы электротехники'
  }, {
    shifr: 605,
    name: 'История развития тепловых двигателей'
  }, {
    shifr: 606,
    name: 'История религиоведения'
  }, {
    shifr: 607,
    name: 'История России'
  }, {
    shifr: 608,
    name: 'История России (до ХХ века)'
  }, {
    shifr: 609,
    name: 'История России (ХХ - нач. ХХІ вв.)'
  }, {
    shifr: 610,
    name: 'История России в контексте мировых цивилизаций'
  }, {
    shifr: 611,
    name: 'История русской литературы'
  }, {
    shifr: 612,
    name: 'История русской литературы 18 века'
  }, {
    shifr: 613,
    name: 'История русской литературы 20-21 века'
  }, {
    shifr: 614,
    name: 'История русской литературы второй половины 19 века'
  }, {
    shifr: 615,
    name: 'История русской литературы первой половины 19 века'
  }, {
    shifr: 616,
    name: 'История русской философии'
  }, {
    shifr: 617,
    name: 'История социальной работы'
  }, {
    shifr: 618,
    name: 'История социологии'
  }, {
    shifr: 619,
    name: 'История Средних веков'
  }, {
    shifr: 620,
    name: 'История стран ближнего зарубежья'
  }, {
    shifr: 621,
    name: 'История транспорта'
  }, {
    shifr: 622,
    name: 'История управленческой мысли'
  }, {
    shifr: 623,
    name: 'История учений о государстве и праве'
  }, {
    shifr: 624,
    name: 'История физической культуры и спорта'
  }, {
    shifr: 625,
    name: 'История экономики и экономической мысли'
  }, {
    shifr: 626,
    name: 'История Южнорусского казачества'
  }, {
    shifr: 627,
    name: 'История языка'
  }, {
    shifr: 628,
    name: 'История, методология и технологии работы с молодежью'
  }, {
    shifr: 629,
    name: 'История, методология и технологии социальной работы'
  }, {
    shifr: 630,
    name: 'Источники питания'
  }, {
    shifr: 631,
    name: 'Источники питания ЭВМ'
  }, {
    shifr: 632,
    name: 'Источники энергии'
  }, {
    shifr: 633,
    name: 'Источниковедение'
  }, {
    shifr: 634,
    name: 'Источниковедение и историография документоведения и архивоведения'
  }, {
    shifr: 635,
    name: 'Источниковедение истории Отечества'
  }, {
    shifr: 636,
    name: 'Источниковедение истории России'
  }, {
    shifr: 637,
    name: 'Кадровая безопасность'
  }, {
    shifr: 638,
    name: 'Кадровая безопасность предприятия'
  }, {
    shifr: 639,
    name: 'Кадровая политика в органах государственной власти и местного самоуправления'
  }, {
    shifr: 640,
    name: 'Кадровая стратегия и кадровая политика'
  }, {
    shifr: 641,
    name: 'Кадровое администрирование и делопроизводство'
  }, {
    shifr: 642,
    name: 'Кадровое делопроизводство и архивы документов по личному составу'
  }, {
    shifr: 643,
    name: 'Кадровый консалтинг'
  }, {
    shifr: 644,
    name: 'Кадровый менеджмент'
  }, {
    shifr: 645,
    name: 'Канатные дороги'
  }, {
    shifr: 646,
    name: 'Картография и геоэкологическое картографирование'
  }, {
    shifr: 647,
    name: 'Карьерные стратегии молодежи и молодежное предпринимательство'
  }, {
    shifr: 648,
    name: 'Качественные методы в социологии (семинар-практикум)'
  }, {
    shifr: 649,
    name: 'Качество программного обеспечения'
  }, {
    shifr: 650,
    name: 'Качество электроэнергии'
  }, {
    shifr: 651,
    name: 'Квалиметрия изделий легкой промышленности'
  }, {
    shifr: 652,
    name: 'Квалитология в социальной работе'
  }, {
    shifr: 653,
    name: 'Квантовая и оптическая электроника'
  }, {
    shifr: 654,
    name: 'Квантовая механика и статистическая физика'
  }, {
    shifr: 655,
    name: 'Квантовая теория'
  }, {
    shifr: 656,
    name: 'Кинематика манипуляционных роботов'
  }, {
    shifr: 657,
    name: 'Классики научного и практического маркетинга'
  }, {
    shifr: 658,
    name: 'Классические регуляторы систем автоматического управления'
  }, {
    shifr: 659,
    name: 'Классические языки'
  }, {
    shifr: 660,
    name: 'Клиническая психология и патопсихология'
  }, {
    shifr: 661,
    name: 'Книговедение'
  }, {
    shifr: 662,
    name: 'Книжные издания'
  }, {
    shifr: 663,
    name: 'Колебания и волны'
  }, {
    shifr: 664,
    name: 'Количественные методы в исторических исследованиях'
  }, {
    shifr: 665,
    name: 'Командообразование и лидерство'
  }, {
    shifr: 666,
    name: 'Коммуникативные технологии направленной смысловой трансляции и психологические аспекты манипуляции'
  }, {
    shifr: 667,
    name: 'Коммуникации в деловом общении'
  }, {
    shifr: 668,
    name: 'Коммуникационный менеджмент и управление офисом'
  }, {
    shifr: 669,
    name: 'Комплексная механизация и автоматизация погрузочно-разгрузочных и транспортно-складских работ'
  }, {
    shifr: 670,
    name: 'Комплексная реабилитация лиц с ОФН'
  }, {
    shifr: 671,
    name: 'Комплексный экономический анализ'
  }, {
    shifr: 672,
    name: 'Комплексы автоматизации на базе вычислительных машин, систем и сетей'
  }, {
    shifr: 673,
    name: 'Комплексы интенсивной терапии'
  }, {
    shifr: 674,
    name: 'Композиция костюма'
  }, {
    shifr: 675,
    name: 'Компрессоры и компрессорные установки'
  }, {
    shifr: 676,
    name: 'Компьютеризация инженерного творчества'
  }, {
    shifr: 677,
    name: 'Компьютерная графика'
  }, {
    shifr: 678,
    name: 'Компьютерная графика. Основы геометрического моделирования'
  }, {
    shifr: 679,
    name: 'Компьютерная лексикография и компьютерный сервис переводчика'
  }, {
    shifr: 680,
    name: 'Компьютерная лингвистика'
  }, {
    shifr: 681,
    name: 'Компьютерная логика'
  }, {
    shifr: 682,
    name: 'Компьютерная техника автоматизированных систем'
  }, {
    shifr: 683,
    name: 'Компьютерное моделирование кавитации'
  }, {
    shifr: 684,
    name: 'Компьютерное моделирование объектов пищевых производств'
  }, {
    shifr: 685,
    name: 'Компьютерное моделирование объектов производства'
  }, {
    shifr: 686,
    name: 'Компьютерное моделирования физических процессов'
  }, {
    shifr: 687,
    name: 'Компьютерные науки (Пакеты прикладных программ)'
  }, {
    shifr: 688,
    name: 'Компьютерные сети'
  }, {
    shifr: 689,
    name: 'Компьютерные сети и системы'
  }, {
    shifr: 690,
    name: 'Компьютерные технологии в инструментальном производстве'
  }, {
    shifr: 691,
    name: 'Компьютерные технологии в легкой промышленности'
  }, {
    shifr: 692,
    name: 'Компьютерные технологии в металлургии'
  }, {
    shifr: 693,
    name: 'Компьютерные технологии в науке и производстве'
  }, {
    shifr: 694,
    name: 'Компьютерные технологии в науке и производстве в области информационных систем'
  }, {
    shifr: 695,
    name: 'Компьютерные технологии в научных исследованиях'
  }, {
    shifr: 696,
    name: 'Компьютерные технологии в приборостроении'
  }, {
    shifr: 697,
    name: 'Компьютерные технологии в проектировании станочного оборудования'
  }, {
    shifr: 698,
    name: 'Компьютерные технологии в станкостроении'
  }, {
    shifr: 699,
    name: 'Компьютерные технологии в физике'
  }, {
    shifr: 700,
    name: 'Компьютерные технологии в электромеханике'
  }, {
    shifr: 701,
    name: 'Компьютерные технологии в энергомашиностроении'
  }, {
    shifr: 702,
    name: 'Компьютерные технологии и статистические методы в экологии и природопользовании'
  }, {
    shifr: 703,
    name: 'Компьютерные технологии на автотранспорте'
  }, {
    shifr: 704,
    name: 'Компьютерные, сетевые и информационные технологии'
  }, {
    shifr: 705,
    name: 'Компьютерный дизайн'
  }, {
    shifr: 706,
    name: 'Компьютерный инженерный анализ объектов подъемно-транспортного, строительного, дорожного машиностроения'
  }, {
    shifr: 707,
    name: 'Конкурентные стратегии международных компаний'
  }, {
    shifr: 708,
    name: 'Конкурентоспособность предприятия'
  }, {
    shifr: 709,
    name: 'Конституционное право'
  }, {
    shifr: 710,
    name: 'Конструирование автоматических и роботизированных машин, модулей и комплексов'
  }, {
    shifr: 711,
    name: 'Конструирование ДВС'
  }, {
    shifr: 712,
    name: 'Конструирование и расчет подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 713,
    name: 'Конструирование и расчет технологической оснастки'
  }, {
    shifr: 714,
    name: 'Конструирование изделий легкой промышленности'
  }, {
    shifr: 715,
    name: 'Конструирование одежды на индивидуального потребителя'
  }, {
    shifr: 716,
    name: 'Конструирование элементов приборов'
  }, {
    shifr: 717,
    name: 'Конструктивное моделирование одежды'
  }, {
    shifr: 718,
    name: 'Конструкторско-технологическая подготовка швейного производства'
  }, {
    shifr: 719,
    name: 'Конструкция и техническая эксплуатация современных и перспективных топливных систем автомобилей'
  }, {
    shifr: 720,
    name: 'Конструкция и эксплуатационные свойства транспортных и транспортно-технологических машин и оборудования (ТТМиО)'
  }, {
    shifr: 721,
    name: 'Консультирование и посредничество в социальной работе'
  }, {
    shifr: 722,
    name: 'Контракт во внешнеэкономической деятельности'
  }, {
    shifr: 723,
    name: 'Контроллинг'
  }, {
    shifr: 724,
    name: 'Контроль и надзор в государственном и муниципальном управлении'
  }, {
    shifr: 725,
    name: 'Контроль и ревизия'
  }, {
    shifr: 726,
    name: 'Контроль качества изделий'
  }, {
    shifr: 727,
    name: 'Контроль качества отливок'
  }, {
    shifr: 728,
    name: 'Контроль качества сварки'
  }, {
    shifr: 729,
    name: 'Контроль проникающим излучением и веществами'
  }, {
    shifr: 730,
    name: 'Конфиденциальное делопроизводство'
  }, {
    shifr: 731,
    name: 'Конфликтологическое консультирование'
  }, {
    shifr: 732,
    name: 'Конфликтология в социальной работе'
  }, {
    shifr: 733,
    name: 'Конфликтология в теории и практике социальной работы'
  }, {
    shifr: 734,
    name: 'Конфликтология и теория переговоров'
  }, {
    shifr: 735,
    name: 'Концептуальные основы профессионального туристского образования'
  }, {
    shifr: 736,
    name: 'Концептуальные основы современного социального государства и социальное право'
  }, {
    shifr: 737,
    name: 'Концепции развития профессионализма'
  }, {
    shifr: 738,
    name: 'Концепции современного естествознания'
  }, {
    shifr: 739,
    name: 'Концепции устойчивого развития туризма'
  }, {
    shifr: 740,
    name: 'Концепция современного естествознания'
  }, {
    shifr: 741,
    name: 'Концепция эффективного управления организацией'
  }, {
    shifr: 742,
    name: 'Корпоративная и деловая культура в бизнесе'
  }, {
    shifr: 743,
    name: 'Корпоративная культура и социальная ответственность'
  }, {
    shifr: 744,
    name: 'Корпоративное право'
  }, {
    shifr: 745,
    name: 'Корпоративное управление'
  }, {
    shifr: 746,
    name: 'Корпоративные информационные системы'
  }, {
    shifr: 747,
    name: 'Корпоративные финансы'
  }, {
    shifr: 748,
    name: 'Корпоративные финансы (продвинутый уровень)'
  }, {
    shifr: 749,
    name: 'Корректура. Современные корректурные процессы'
  }, {
    shifr: 750,
    name: 'Коррозия и защита металлов'
  }, {
    shifr: 751,
    name: 'Коррозия сварных соединений'
  }, {
    shifr: 752,
    name: 'Косметология'
  }, {
    shifr: 753,
    name: 'Краеведение'
  }, {
    shifr: 754,
    name: 'Краевые задачи и вариационное исчисление'
  }, {
    shifr: 755,
    name: 'Креативный менеджмент'
  }, {
    shifr: 756,
    name: 'Криминалистика'
  }, {
    shifr: 757,
    name: 'Криминология'
  }, {
    shifr: 758,
    name: 'Кристаллография и дефекты кристаллической решетки'
  }, {
    shifr: 759,
    name: 'Кросскультурная психология'
  }, {
    shifr: 760,
    name: 'Кросс-культурный менеджмент'
  }, {
    shifr: 761,
    name: 'Кроссплатформенное программирование'
  }, {
    shifr: 762,
    name: 'Кузнечно-штамповочное оборудование'
  }, {
    shifr: 763,
    name: 'Культура взаимодействия преподавателя и студентов в образовательном пространстве высшей школы'
  }, {
    shifr: 764,
    name: 'Культура издания'
  }, {
    shifr: 765,
    name: 'Культура издания. Издательские стандарты'
  }, {
    shifr: 766,
    name: 'Культура педагогического взаимодействия в системе профессионального образования'
  }, {
    shifr: 767,
    name: 'Культура речи в СМИ'
  }, {
    shifr: 768,
    name: 'Культурология'
  }, {
    shifr: 769,
    name: 'Курортология'
  }, {
    shifr: 770,
    name: 'Лабораторный практикум по издательскому делу и редактированию'
  }, {
    shifr: 771,
    name: 'Лабораторный практикум по специальности'
  }, {
    shifr: 772,
    name: 'Лабораторный практикум по языку СМИ'
  }, {
    shifr: 773,
    name: 'Лазеры в микро- и наноэлектронике'
  }, {
    shifr: 774,
    name: 'Ландшафтное планирование'
  }, {
    shifr: 775,
    name: 'Ландшафтоведение'
  }, {
    shifr: 776,
    name: 'Латинский язык'
  }, {
    shifr: 777,
    name: 'Лексикология'
  }, {
    shifr: 778,
    name: 'Лечебная физкультура'
  }, {
    shifr: 779,
    name: 'Лидерство и руководство в управлении человеческими ресурсами'
  }, {
    shifr: 780,
    name: 'Ликвидация социальных последствий катастроф'
  }, {
    shifr: 781,
    name: 'Лингвистика текста'
  }, {
    shifr: 782,
    name: 'Лингвистический анализ текстов'
  }, {
    shifr: 783,
    name: 'Лингвистическое программирование'
  }, {
    shifr: 784,
    name: 'Лингводидактика. Методика преподавания иностранного языка и перевода в высших учебных заведениях'
  }, {
    shifr: 785,
    name: 'Лингвострановедение стран первого иностранного языка'
  }, {
    shifr: 786,
    name: 'Лингво-юридические основы экспертизы документов'
  }, {
    shifr: 787,
    name: 'Литейное материаловедение'
  }, {
    shifr: 788,
    name: 'Литейные сплавы и плавка'
  }, {
    shifr: 789,
    name: 'Литературное редактирование'
  }, {
    shifr: 790,
    name: 'Литературный стиль'
  }, {
    shifr: 791,
    name: 'Лифты и подъемники'
  }, {
    shifr: 792,
    name: 'Личностно-ориентированные технологии профессиональной деятельности'
  }, {
    shifr: 793,
    name: 'Личность в критических ситуациях: психология деформаций'
  }, {
    shifr: 794,
    name: 'Логика'
  }, {
    shifr: 795,
    name: 'Логика и практика аргументации'
  }, {
    shifr: 796,
    name: 'Логика и теория аргументации'
  }, {
    shifr: 797,
    name: 'Логистика'
  }, {
    shifr: 798,
    name: 'Логистические методы в организации перевозок'
  }, {
    shifr: 799,
    name: 'Логистический менеджмент'
  }, {
    shifr: 800,
    name: 'Логистическое управление'
  }, {
    shifr: 801,
    name: 'Логистическое управление ВЭД'
  }, {
    shifr: 802,
    name: 'Логические основы редактирования'
  }, {
    shifr: 803,
    name: 'Локомотивное хозяйство'
  }, {
    shifr: 804,
    name: 'Локомотивные энергетические установки'
  }, {
    shifr: 805,
    name: 'Локомотивы'
  }, {
    shifr: 806,
    name: 'Лопастные гидромашины и гидропередачи'
  }, {
    shifr: 807,
    name: 'Магистерская диссертация'
  }, {
    shifr: 808,
    name: 'Макроэкономика'
  }, {
    shifr: 809,
    name: 'Малая энергетика'
  }, {
    shifr: 810,
    name: 'Малозатратные технологии перевозочного процесса'
  }, {
    shifr: 811,
    name: 'Маркетинг'
  }, {
    shifr: 812,
    name: 'Маркетинг в издательском деле'
  }, {
    shifr: 813,
    name: 'Маркетинг в отраслях и сферах деятельности'
  }, {
    shifr: 814,
    name: 'Маркетинг в туристской индустрии'
  }, {
    shifr: 815,
    name: 'Маркетинг взаимодействий'
  }, {
    shifr: 816,
    name: 'Маркетинг взаимодействий и управление лояльностью потребителей'
  }, {
    shifr: 817,
    name: 'Маркетинг гостиничного предприятия'
  }, {
    shifr: 818,
    name: 'Маркетинг инноваций'
  }, {
    shifr: 819,
    name: 'Маркетинг интеллектуальной собственности'
  }, {
    shifr: 820,
    name: 'Маркетинг некоммерческих организаций'
  }, {
    shifr: 821,
    name: 'Маркетинг социальной сферы и регионального рынка труда'
  }, {
    shifr: 822,
    name: 'Маркетинг спортивных товаров и услуг'
  }, {
    shifr: 823,
    name: 'Маркетинг услуг'
  }, {
    shifr: 824,
    name: 'Маркетинговая политика распределения'
  }, {
    shifr: 825,
    name: 'Маркетинговая товарная политика'
  }, {
    shifr: 826,
    name: 'Маркетинговая товарно-инновационная политика'
  }, {
    shifr: 827,
    name: 'Маркетинговые исследования'
  }, {
    shifr: 828,
    name: 'Маркетинговые технологии ценообразования'
  }, {
    shifr: 829,
    name: 'Маркетинговый аудит'
  }, {
    shifr: 830,
    name: 'Маркетинговый менеджмент'
  }, {
    shifr: 831,
    name: 'Математика'
  }, {
    shifr: 832,
    name: 'Математика и информатика'
  }, {
    shifr: 833,
    name: 'Математическая логика'
  }, {
    shifr: 834,
    name: 'Математическая обработка результатов экспериментальных исследований'
  }, {
    shifr: 835,
    name: 'Математическая статистика'
  }, {
    shifr: 836,
    name: 'Математическая экономика'
  }, {
    shifr: 837,
    name: 'Математические задачи электроэнергетики'
  }, {
    shifr: 838,
    name: 'Математические и инструментальные методы поддержки принятия решений'
  }, {
    shifr: 839,
    name: 'Математические методы анализа в социологии'
  }, {
    shifr: 840,
    name: 'Математические методы в гуманитарных науках'
  }, {
    shifr: 841,
    name: 'Математические методы в политических исследованиях'
  }, {
    shifr: 842,
    name: 'Математические методы в психологии'
  }, {
    shifr: 843,
    name: 'Математические методы и математическая статистика в психологии'
  }, {
    shifr: 844,
    name: 'Математические методы и модели рыночной экономики'
  }, {
    shifr: 845,
    name: 'Математические методы искусственного интеллекта и экспертные системы'
  }, {
    shifr: 846,
    name: 'Математические методы оптимизации'
  }, {
    shifr: 847,
    name: 'Математические методы оптимизации литейных процессов'
  }, {
    shifr: 848,
    name: 'Математические методы принятия решений'
  }, {
    shifr: 849,
    name: 'Математические методы решения научных задач'
  }, {
    shifr: 850,
    name: 'Математические методы финансового анализа'
  }, {
    shifr: 851,
    name: 'Математические модели в механике сплошной среды'
  }, {
    shifr: 852,
    name: 'Математические модели методов оптимизации хранения информации'
  }, {
    shifr: 853,
    name: 'Математические модели природных систем'
  }, {
    shifr: 854,
    name: 'Математические модели роботов'
  }, {
    shifr: 855,
    name: 'Математические модели социально-экономических систем'
  }, {
    shifr: 856,
    name: 'Математический анализ'
  }, {
    shifr: 857,
    name: 'Математический инструментарий и модели оценки бизнеса'
  }, {
    shifr: 858,
    name: 'Математическое и программное обеспечение вычислительных систем'
  }, {
    shifr: 859,
    name: 'Математическое методы, модели и моделирование транспортных процессов'
  }, {
    shifr: 860,
    name: 'Математическое моделирование'
  }, {
    shifr: 861,
    name: 'Математическое моделирование в машиностроении'
  }, {
    shifr: 862,
    name: 'Математическое моделирование в системе MatLab'
  }, {
    shifr: 863,
    name: 'Математическое моделирование в технических системах'
  }, {
    shifr: 864,
    name: 'Математическое моделирование и оптимизация движения многозвенных систем'
  }, {
    shifr: 865,
    name: 'Математическое моделирование на автотранспорте'
  }, {
    shifr: 866,
    name: 'Математическое моделирование объектов и процессов управления'
  }, {
    shifr: 867,
    name: 'Математическое моделирование подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 868,
    name: 'Математическое моделирование предельных состояний твердого тела'
  }, {
    shifr: 869,
    name: 'Математическое моделирование приводов машин'
  }, {
    shifr: 870,
    name: 'Математическое моделирование процессов горячей объемной штамповки'
  }, {
    shifr: 871,
    name: 'Математическое моделирование процессов листовой штамповки'
  }, {
    shifr: 872,
    name: 'Математическое моделирование процессов холодной объемной штамповки'
  }, {
    shifr: 873,
    name: 'Математическое моделирование рабочих процессов подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 874,
    name: 'Математическое моделирование развития пожаров и взрывов'
  }, {
    shifr: 875,
    name: 'Математическое моделирование сварочных процессов'
  }, {
    shifr: 876,
    name: 'Математическое моделирование сигналов и систем'
  }, {
    shifr: 877,
    name: 'Математическое моделирование систем и процессов'
  }, {
    shifr: 878,
    name: 'Математическое моделирование сложных систем'
  }, {
    shifr: 879,
    name: 'Математическое моделирование технологического оборудования'
  }, {
    shifr: 880,
    name: 'Математическое моделирование транспортных потоков'
  }, {
    shifr: 881,
    name: 'Материаловедение'
  }, {
    shifr: 882,
    name: 'Материаловедение в производстве швейных изделий'
  }, {
    shifr: 883,
    name: 'Материаловедение и конструкционные материалы'
  }, {
    shifr: 884,
    name: 'Материаловедение и технологии современных и перспективных материалов'
  }, {
    shifr: 885,
    name: 'Материаловедение и технология материалов'
  }, {
    shifr: 886,
    name: 'Материаловедение порошковых и композиционных материалов'
  }, {
    shifr: 887,
    name: 'Материалы для изделий легкой промышленности и конфекционирование'
  }, {
    shifr: 888,
    name: 'Материалы для машиностроительной промышленности'
  }, {
    shifr: 889,
    name: 'Материалы и компоненты электроники'
  }, {
    shifr: 890,
    name: 'Материалы из отходов промышленности'
  }, {
    shifr: 891,
    name: 'Материалы электронной техники'
  }, {
    shifr: 892,
    name: 'Материально-техническая база гостиниц'
  }, {
    shifr: 893,
    name: 'Материально-техническое обеспечение'
  }, {
    shifr: 894,
    name: 'Машинно-ориентированное программирование'
  }, {
    shifr: 895,
    name: 'Машинный перевод'
  }, {
    shifr: 896,
    name: 'Машины-автоматы, линии и робототехнические комплексы пищевых производств'
  }, {
    shifr: 897,
    name: 'Мегатренды мирового развития и современные глобальные проблемы'
  }, {
    shifr: 898,
    name: 'Медиакультура'
  }, {
    shifr: 899,
    name: 'Медиасистемы'
  }, {
    shifr: 900,
    name: 'Медицинская томография'
  }, {
    shifr: 901,
    name: 'Межведомственное взаимодействие в индустрии спорта'
  }, {
    shifr: 902,
    name: 'Междисциплинарные подходы в современной исторической науке'
  }, {
    shifr: 903,
    name: 'Международная журналистика'
  }, {
    shifr: 904,
    name: 'Международная интеграция'
  }, {
    shifr: 905,
    name: 'Международная логистика'
  }, {
    shifr: 906,
    name: 'Международная торговля'
  }, {
    shifr: 907,
    name: 'Международная экономическая безопасность'
  }, {
    shifr: 908,
    name: 'Международное гуманитарное право'
  }, {
    shifr: 909,
    name: 'Международное движение ресурсов'
  }, {
    shifr: 910,
    name: 'Международное и сравнительное трудовое право'
  }, {
    shifr: 911,
    name: 'Международное каноническое право'
  }, {
    shifr: 912,
    name: 'Международное налогообложение'
  }, {
    shifr: 913,
    name: 'Международное публичное право'
  }, {
    shifr: 914,
    name: 'Международное сотрудничество в области охраны окружающей среды'
  }, {
    shifr: 915,
    name: 'Международное частное право'
  }, {
    shifr: 916,
    name: 'Международное экономическое право'
  }, {
    shifr: 917,
    name: 'Международные конфликты в ХХ- XXI веке'
  }, {
    shifr: 918,
    name: 'Международные организации'
  }, {
    shifr: 919,
    name: 'Международные отношения и мировая политика'
  }, {
    shifr: 920,
    name: 'Международные перевозки'
  }, {
    shifr: 921,
    name: 'Международные системы и глобальное развитие'
  }, {
    shifr: 922,
    name: 'Международные стандарты качества'
  }, {
    shifr: 923,
    name: 'Международные стандарты управления документацией и архивного дела'
  }, {
    shifr: 924,
    name: 'Международные стандарты финансовой отчетности и стандарты бухгалтерского учета: финансовый учет и отчётность'
  }, {
    shifr: 925,
    name: 'Международные финансы'
  }, {
    shifr: 926,
    name: 'Международные экономические организации'
  }, {
    shifr: 927,
    name: 'Международные экономические отношения'
  }, {
    shifr: 928,
    name: 'Международный бизнес'
  }, {
    shifr: 929,
    name: 'Международный деловой этикет'
  }, {
    shifr: 930,
    name: 'Международный маркетинг'
  }, {
    shifr: 931,
    name: 'Международный опыт менеджмента спортивной индустрии'
  }, {
    shifr: 932,
    name: 'Международный туризм'
  }, {
    shifr: 933,
    name: 'Мембранная и криогенная техника'
  }, {
    shifr: 934,
    name: 'Менеджмент'
  }, {
    shifr: 935,
    name: 'Менеджмент в издательском деле'
  }, {
    shifr: 936,
    name: 'Менеджмент в издательском деле и СМИ'
  }, {
    shifr: 937,
    name: 'Менеджмент в молодежной политике'
  }, {
    shifr: 938,
    name: 'Менеджмент в системе высшего образования'
  }, {
    shifr: 939,
    name: 'Менеджмент ВЭД'
  }, {
    shifr: 940,
    name: 'Менеджмент и экономика предприятий железнодорожного транспорта'
  }, {
    shifr: 941,
    name: 'Менеджмент измерений'
  }, {
    shifr: 942,
    name: 'Менеджмент организаций'
  }, {
    shifr: 943,
    name: 'Менеджмент персонала'
  }, {
    shifr: 944,
    name: 'Менеджмент спортивных мероприятий'
  }, {
    shifr: 945,
    name: 'Менеджмент спортивных организаций'
  }, {
    shifr: 946,
    name: 'Менеджмент стандартов качества'
  }, {
    shifr: 947,
    name: 'Металлорежущие станки с компьютерным управлением'
  }, {
    shifr: 948,
    name: 'Металлургическая теплотехника'
  }, {
    shifr: 949,
    name: 'Металлургические печи'
  }, {
    shifr: 950,
    name: 'Методика выбора и разработки материалов с заданными технологическими и функциональными свойствами'
  }, {
    shifr: 951,
    name: 'Методика и методология исследований в СМИ и ИБД'
  }, {
    shifr: 952,
    name: 'Методика и организация научных исследований'
  }, {
    shifr: 953,
    name: 'Методика исследований в СМИ и ИБД'
  }, {
    shifr: 954,
    name: 'Методика исследования в журналистике'
  }, {
    shifr: 955,
    name: 'Методика исследования в издательском деле'
  }, {
    shifr: 956,
    name: 'Методика оценки туристско-рекреационных ресурсов'
  }, {
    shifr: 957,
    name: 'Методика преподавания гуманитарных наук'
  }, {
    shifr: 958,
    name: 'Методика преподавания иностранного языка'
  }, {
    shifr: 959,
    name: 'Методика преподавания истории'
  }, {
    shifr: 960,
    name: 'Методика преподавания истории в высшей школе'
  }, {
    shifr: 961,
    name: 'Методика преподавания литературы'
  }, {
    shifr: 962,
    name: 'Методика преподавания политологии'
  }, {
    shifr: 963,
    name: 'Методика преподавания правовых дисциплин'
  }, {
    shifr: 964,
    name: 'Методика преподавания религиоведения'
  }, {
    shifr: 965,
    name: 'Методика преподавания социологии'
  }, {
    shifr: 966,
    name: 'Методика преподавания социологии в высшей школе и сфере дополнительного образования'
  }, {
    shifr: 967,
    name: 'Методика преподавания теологии'
  }, {
    shifr: 968,
    name: 'Методика преподавания учетно-аналитических дисциплин'
  }, {
    shifr: 969,
    name: 'Методика преподавания физики'
  }, {
    shifr: 970,
    name: 'Методика преподавания филологических дисциплин в высшем учебном заведении'
  }, {
    shifr: 971,
    name: 'Методика преподавания философских дисциплин'
  }, {
    shifr: 972,
    name: 'Методика преподавания экологии'
  }, {
    shifr: 973,
    name: 'Методика преподавания экономических дисциплин'
  }, {
    shifr: 974,
    name: 'Методика преподавания языка'
  }, {
    shifr: 975,
    name: 'Методика профессионального обучения'
  }, {
    shifr: 976,
    name: 'Методика работы радиожурналиста'
  }, {
    shifr: 977,
    name: 'Методика работы тележурналиста'
  }, {
    shifr: 978,
    name: 'Методика рационализации документационного обеспечения управления и архивного дела'
  }, {
    shifr: 979,
    name: 'Методика самостоятельной работы студентов'
  }, {
    shifr: 980,
    name: 'Методологические основы психологии'
  }, {
    shifr: 981,
    name: 'Методологические проблемы психологии и специальная терминология'
  }, {
    shifr: 982,
    name: 'Методологический базис научных исследований'
  }, {
    shifr: 983,
    name: 'Методология выбора материалов в машиностроении'
  }, {
    shifr: 984,
    name: 'Методология и методика исторического исследования'
  }, {
    shifr: 985,
    name: 'Методология и методы комплексных исследований молодежи'
  }, {
    shifr: 986,
    name: 'Методология и методы научно-педагогического исследования'
  }, {
    shifr: 987,
    name: 'Методология и методы научных исследований'
  }, {
    shifr: 988,
    name: 'Методология и методы научных исследований в менеджменте'
  }, {
    shifr: 989,
    name: 'Методология и организация исследовательской работы политолога'
  }, {
    shifr: 990,
    name: 'Методология и организация научно-педагогических исследований'
  }, {
    shifr: 991,
    name: 'Методология и техника исследований в социальной работе'
  }, {
    shifr: 992,
    name: 'Методология и технология автоматизированного проектирования информационных систем'
  }, {
    shifr: 993,
    name: 'Методология инженерной и изобретательской деятельности в пищевой и переработочной промышленности'
  }, {
    shifr: 994,
    name: 'Методология научного поиска'
  }, {
    shifr: 995,
    name: 'Методология научных исследований в материаловедении'
  }, {
    shifr: 996,
    name: 'Методология научных исследований в отрасли'
  }, {
    shifr: 997,
    name: 'Методология научных исследований в отрасли (области знаний)'
  }, {
    shifr: 998,
    name: 'Методология научных исследований и история нововведений'
  }, {
    shifr: 999,
    name: 'Методология научных исследований, организация и планирование эксперимента'
  }, {
    shifr: 1000,
    name: 'Методология программной инженерии'
  }, {
    shifr: 1001,
    name: 'Методология проектирования изделий машиностроения'
  }, {
    shifr: 1002,
    name: 'Методология разработки и реализации содержания высшего профессионального образования'
  }, {
    shifr: 1003,
    name: 'Методология создания прогрессивного технологического оборудования перерабатывающих и пищевых производств'
  }, {
    shifr: 1004,
    name: 'Методология социальных исследований в социальной работе'
  }, {
    shifr: 1005,
    name: 'Методология социологического исследования'
  }, {
    shifr: 1006,
    name: 'Методы администрирования компьютерных сетей'
  }, {
    shifr: 1007,
    name: 'Методы анализа и синтеза оптимальных конструкций'
  }, {
    shifr: 1008,
    name: 'Методы анализа систем производственной автоматики и автоматической пожарной защиты'
  }, {
    shifr: 1009,
    name: 'Методы анализа экспериментальных данных'
  }, {
    shifr: 1010,
    name: 'Методы анализа электромагнитных процессов в электромеханических устройствах'
  }, {
    shifr: 1011,
    name: 'Методы диагностики плазмы'
  }, {
    shifr: 1012,
    name: 'Методы и алгоритмы принятия решений'
  }, {
    shifr: 1013,
    name: 'Методы и средства автоматизации инструментального производства'
  }, {
    shifr: 1014,
    name: 'Методы и средства измерений и контроля'
  }, {
    shifr: 1015,
    name: 'Методы и средства измерений, испытаний'
  }, {
    shifr: 1016,
    name: 'Методы и средства контроля качества окружающей среды'
  }, {
    shifr: 1017,
    name: 'Методы и средства неразрушающего контроля крупногабаритных объектов'
  }, {
    shifr: 1018,
    name: 'Методы и средства поиска научно-технической информации'
  }, {
    shifr: 1019,
    name: 'Методы и средства проектирования информационных систем и технологий'
  }, {
    shifr: 1020,
    name: 'Методы и средства регистрации и отображения информации'
  }, {
    shifr: 1021,
    name: 'Методы и средства экспериментальных исследований объектов подъемно-транспортного, строительного, дорожного машиностроения'
  }, {
    shifr: 1022,
    name: 'Методы и средства экспериментальных исследований подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 1023,
    name: 'Методы и средства энергосбережения'
  }, {
    shifr: 1024,
    name: 'Методы и теория оптимизации систем управления'
  }, {
    shifr: 1025,
    name: 'Методы и технологии интеллектуального анализа данных'
  }, {
    shifr: 1026,
    name: 'Методы и технологии картографирования в чрезвычайных ситуациях'
  }, {
    shifr: 1027,
    name: 'Методы и формы научно-правового познания'
  }, {
    shifr: 1028,
    name: 'Методы интеллектуального анализа данных'
  }, {
    shifr: 1029,
    name: 'Методы искусственного интеллекта'
  }, {
    shifr: 1030,
    name: 'Методы искусственного интеллекта в мехатронике и робототехнике'
  }, {
    shifr: 1031,
    name: 'Методы исследования в социальной работе'
  }, {
    shifr: 1032,
    name: 'Методы исследования и испытания материалов'
  }, {
    shifr: 1033,
    name: 'Методы исследования и моделирования информационных процессов и технологий'
  }, {
    shifr: 1034,
    name: 'Методы исследования информационных систем и анализ экспериментальных данных'
  }, {
    shifr: 1035,
    name: 'Методы исследования материалов и структур электроники'
  }, {
    shifr: 1036,
    name: 'Методы комплексного исследования и оценки положения молодежи в обществе'
  }, {
    shifr: 1037,
    name: 'Методы компьютерного моделирования'
  }, {
    shifr: 1038,
    name: 'Методы контроля транспортной техники'
  }, {
    shifr: 1039,
    name: 'Методы математического моделирования'
  }, {
    shifr: 1040,
    name: 'Методы математического моделирования и компьютерные технологии в научных исследованиях'
  }, {
    shifr: 1041,
    name: 'Методы математической физики'
  }, {
    shifr: 1042,
    name: 'Методы научных исследований'
  }, {
    shifr: 1043,
    name: 'Методы обеспечения надежности и качества инструментальных систем'
  }, {
    shifr: 1044,
    name: 'Методы обеспечения надежности инструментальных наладок'
  }, {
    shifr: 1045,
    name: 'Методы обеспечения налогового мониторинга'
  }, {
    shifr: 1046,
    name: 'Методы обеспечения работоспособного технического состояния автотранспортных средств'
  }, {
    shifr: 1047,
    name: 'Методы обоснования принятия решений в конфликте, практика выработки навыков посредника'
  }, {
    shifr: 1048,
    name: 'Методы обоснования финансовых решений'
  }, {
    shifr: 1049,
    name: 'Методы обработки и планирования эксперимента'
  }, {
    shifr: 1050,
    name: 'Методы оптимизации'
  }, {
    shifr: 1051,
    name: 'Методы очувствления робототехнических и мехатронных систем'
  }, {
    shifr: 1052,
    name: 'Методы перевода и анализ художественного текста'
  }, {
    shifr: 1053,
    name: 'Методы подобия физических процессов'
  }, {
    shifr: 1054,
    name: 'Методы принятия управленческих решений'
  }, {
    shifr: 1055,
    name: 'Методы решения задач математической физики'
  }, {
    shifr: 1056,
    name: 'Методы синтеза и расчета систем гидропневмоавтоматики'
  }, {
    shifr: 1057,
    name: 'Методы создания и продвижения коллекций'
  }, {
    shifr: 1058,
    name: 'Методы социальной работы'
  }, {
    shifr: 1059,
    name: 'Методы социологических исследований'
  }, {
    shifr: 1060,
    name: 'Методы структурного анализа материалов'
  }, {
    shifr: 1061,
    name: 'Методы улучшения экологических характеристик двигателей внутреннего сгорания'
  }, {
    shifr: 1062,
    name: 'Методы уменьшения сварочных напряжений и деформаций'
  }, {
    shifr: 1063,
    name: 'Методы цифровой обработки сенсорной и кинестетической информации'
  }, {
    shifr: 1064,
    name: 'Метрологическая экспертиза конструкторских и технологических документов'
  }, {
    shifr: 1065,
    name: 'Метрологический контроль и испытание промышленной продукции'
  }, {
    shifr: 1066,
    name: 'Метрологическое обеспечение эксплуатации средств измерений'
  }, {
    shifr: 1067,
    name: 'Метрология'
  }, {
    shifr: 1068,
    name: 'Метрология в архивном деле'
  }, {
    shifr: 1069,
    name: 'Метрология и измерительная техника'
  }, {
    shifr: 1070,
    name: 'Метрология и измерительная техника систем автоматики'
  }, {
    shifr: 1071,
    name: 'Метрология и качество программного обеспечения'
  }, {
    shifr: 1072,
    name: 'Метрология, стандартизация и сертификация'
  }, {
    shifr: 1073,
    name: 'Метрология, стандартизация, сертификация в материаловедении'
  }, {
    shifr: 1074,
    name: 'Механизация и автоматизация технологических процессов'
  }, {
    shifr: 1075,
    name: 'Механизация технологических процессов обработки свободными абразивами'
  }, {
    shifr: 1076,
    name: 'Механизмы разрешения конфликтов в системе государственного и муниципального управления'
  }, {
    shifr: 1077,
    name: 'Механика'
  }, {
    shifr: 1078,
    name: 'Механика жидкости и газа'
  }, {
    shifr: 1079,
    name: 'Механика жидкости и газа (гидро-и пневмопривод)'
  }, {
    shifr: 1080,
    name: 'Механика жидкости и газа ч.2'
  }, {
    shifr: 1081,
    name: 'Механика композиционных материалов'
  }, {
    shifr: 1082,
    name: 'Механика материалов и конструкций (сопротивление материалов)'
  }, {
    shifr: 1083,
    name: 'Механика материалов и основы конструирования'
  }, {
    shifr: 1084,
    name: 'Механика поверхности твердого тела'
  }, {
    shifr: 1085,
    name: 'Механика трения и износа'
  }, {
    shifr: 1086,
    name: 'Механические свойства материалов'
  }, {
    shifr: 1087,
    name: 'Мехатронные и робототехнические системы специального назначения'
  }, {
    shifr: 1088,
    name: 'Микропроцессорная техника'
  }, {
    shifr: 1089,
    name: 'Микропроцессорная техника в мехатронике и робототехнике'
  }, {
    shifr: 1090,
    name: 'Микропроцессорная техника в системах управления'
  }, {
    shifr: 1091,
    name: 'Микропроцессорное управление электрическими машинами'
  }, {
    shifr: 1092,
    name: 'Микропроцессорные системы'
  }, {
    shifr: 1093,
    name: 'Микропроцессорные системы релейной защиты и автоматики'
  }, {
    shifr: 1094,
    name: 'Микропроцессорные системы управления в электроэнергетике'
  }, {
    shifr: 1095,
    name: 'Микропроцессорные средства технических измерений'
  }, {
    shifr: 1096,
    name: 'Микропроцессорные устройства'
  }, {
    shifr: 1097,
    name: 'Микропроцессоры в приборах'
  }, {
    shifr: 1098,
    name: 'Микросхемотехника'
  }, {
    shifr: 1099,
    name: 'Микроэкономика'
  }, {
    shifr: 1100,
    name: 'Микроэкономика (продвинутый уровень)'
  }, {
    shifr: 1101,
    name: 'Мировая культура'
  }, {
    shifr: 1102,
    name: 'Мировая литература (философский аспект)'
  }, {
    shifr: 1103,
    name: 'Мировая политика и международные отношения'
  }, {
    shifr: 1104,
    name: 'Мировая экономика'
  }, {
    shifr: 1105,
    name: 'Мировой рынок труда'
  }, {
    shifr: 1106,
    name: 'Мировой спорт и международные спортивные проекты'
  }, {
    shifr: 1107,
    name: 'Мировой туризм и гостиничное хозяйство'
  }, {
    shifr: 1108,
    name: 'Мировые информационные ресурсы'
  }, {
    shifr: 1109,
    name: 'Мировые товарные рынки'
  }, {
    shifr: 1110,
    name: 'Многопараметрические исследования динамики грузоподъемных кранов'
  }, {
    shifr: 1111,
    name: 'Мобильные краны'
  }, {
    shifr: 1112,
    name: 'Модели рынков труда'
  }, {
    shifr: 1113,
    name: 'Моделирование бизнес процессов'
  }, {
    shifr: 1114,
    name: 'Моделирование вычислительных систем'
  }, {
    shifr: 1115,
    name: 'Моделирование и анализ программного обеспечения'
  }, {
    shifr: 1116,
    name: 'Моделирование и оптимизация свойств материалов и процессов'
  }, {
    shifr: 1117,
    name: 'Моделирование и оптимизация технологических процессов'
  }, {
    shifr: 1118,
    name: 'Моделирование инновационного развития'
  }, {
    shifr: 1119,
    name: 'Моделирование интеллектуальных транспортных систем'
  }, {
    shifr: 1120,
    name: 'Моделирование информационных систем'
  }, {
    shifr: 1121,
    name: 'Моделирование первичных преобразователей'
  }, {
    shifr: 1122,
    name: 'Моделирование процессов в поршневых двигателях'
  }, {
    shifr: 1123,
    name: 'Моделирование процессов и систем'
  }, {
    shifr: 1124,
    name: 'Моделирование процессов ОМД. Управление качеством'
  }, {
    shifr: 1125,
    name: 'Моделирование процессов топливоподачи современных дизелей'
  }, {
    shifr: 1126,
    name: 'Моделирование размерных связей'
  }, {
    shifr: 1127,
    name: 'Моделирование технологических процессов в машиностроении'
  }, {
    shifr: 1128,
    name: 'Моделирование транспортных процессов'
  }, {
    shifr: 1129,
    name: 'Моделирование транспортных систем'
  }, {
    shifr: 1130,
    name: 'Моделирование транспортных систем и оптимизация процессов на транспорте'
  }, {
    shifr: 1131,
    name: 'Моделирование турбулентности'
  }, {
    shifr: 1132,
    name: 'Моделирование управленческой деятельности'
  }, {
    shifr: 1133,
    name: 'Моделирование экономики'
  }, {
    shifr: 1134,
    name: 'Моделирование электромеханических систем'
  }, {
    shifr: 1135,
    name: 'Моделирование, проектирование, программирование и прогнозирование в работе с молодежью'
  }, {
    shifr: 1136,
    name: 'Модернизация и сервис оборудования пищевых производств'
  }, {
    shifr: 1137,
    name: 'Модуль проектной деятельности'
  }, {
    shifr: 1138,
    name: 'Молекулярная физика'
  }, {
    shifr: 1139,
    name: 'Молодая семья-объект молодежной политики'
  }, {
    shifr: 1140,
    name: 'Молодежная политика и молодежные движения за рубежом: история и современность'
  }, {
    shifr: 1141,
    name: 'Молодежная политика и молодежные движения зарубежем: история и современность'
  }, {
    shifr: 1142,
    name: 'Молодежные некоммерческие организации'
  }, {
    shifr: 1143,
    name: 'Молодежные субкультуры'
  }, {
    shifr: 1144,
    name: 'Молодежный работник: организация и технология личного труда'
  }, {
    shifr: 1145,
    name: 'Мониторинг безопасности'
  }, {
    shifr: 1146,
    name: 'Мониторинг в системе образования'
  }, {
    shifr: 1147,
    name: 'Мониторинг и прогнозирование ЧС'
  }, {
    shifr: 1148,
    name: 'Мониторинг профессионального образования'
  }, {
    shifr: 1149,
    name: 'Монтаж и наладка систем электроснабжения'
  }, {
    shifr: 1150,
    name: 'Монтаж и настройка электромеханических устройств'
  }, {
    shifr: 1151,
    name: 'Монтаж, эксплуатация и ремонт подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 1152,
    name: 'Мотивация и оплата труда'
  }, {
    shifr: 1153,
    name: 'Мотивация на результат'
  }, {
    shifr: 1154,
    name: 'Музееведение'
  }, {
    shifr: 1155,
    name: 'Музеология и охрана объектов природного и архитектурного наследия'
  }, {
    shifr: 1156,
    name: 'Мультимедийные презентационные технологии'
  }, {
    shifr: 1157,
    name: 'Муниципальное право'
  }, {
    shifr: 1158,
    name: 'Нагрев, нагревательные устройства'
  }, {
    shifr: 1159,
    name: 'Надежность гидромашин, гидроприводов и средств ГПА'
  }, {
    shifr: 1160,
    name: 'Надежность и диагностика информационных систем'
  }, {
    shifr: 1161,
    name: 'Надежность и диагностика технологических систем'
  }, {
    shifr: 1162,
    name: 'Надежность и диагностика электрооборудования'
  }, {
    shifr: 1163,
    name: 'Надежность подвижного состава'
  }, {
    shifr: 1164,
    name: 'Надежность подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 1165,
    name: 'Надежность технических систем'
  }, {
    shifr: 1166,
    name: 'Надежность технических систем и техногенный риск'
  }, {
    shifr: 1167,
    name: 'Надзор и контроль в сфере безопасности'
  }, {
    shifr: 1168,
    name: 'Налоги и налоговая система'
  }, {
    shifr: 1169,
    name: 'Налоги и предпринимательство'
  }, {
    shifr: 1170,
    name: 'Налоговое администрирование и контроль'
  }, {
    shifr: 1171,
    name: 'Налоговое и финансовое право'
  }, {
    shifr: 1172,
    name: 'Налоговое консультирование'
  }, {
    shifr: 1173,
    name: 'Налоговое планирование и налоговая оптимизация'
  }, {
    shifr: 1174,
    name: 'Налоговый менеджмент'
  }, {
    shifr: 1175,
    name: 'Налогообложение финансово-кредитных институтов'
  }, {
    shifr: 1176,
    name: 'Наноматериалы и нанотехнологии'
  }, {
    shifr: 1177,
    name: 'Наноматериалы и нанотехнологии в легкой промышленности'
  }, {
    shifr: 1178,
    name: 'Нанотехнологии'
  }, {
    shifr: 1179,
    name: 'Нанотехнологии в машиностроении'
  }, {
    shifr: 1180,
    name: 'Наноэлектроника'
  }, {
    shifr: 1181,
    name: 'Наплавка и напыление'
  }, {
    shifr: 1182,
    name: 'Напряжения и деформации при сварке'
  }, {
    shifr: 1183,
    name: 'Научная организация и нормирование труда'
  }, {
    shifr: 1184,
    name: 'Научно-исследовательская работа'
  }, {
    shifr: 1185,
    name: 'Научно-исследовательская работа студентов'
  }, {
    shifr: 1186,
    name: 'Научно-исследовательский практикум'
  }, {
    shifr: 1187,
    name: 'Научно-исследовательский семинар'
  }, {
    shifr: 1188,
    name: 'Научно-методическая деятельность'
  }, {
    shifr: 1189,
    name: 'Научно-теоретические и исторические основы архивоведения'
  }, {
    shifr: 1190,
    name: 'Научные исследования в сфере управления персоналом'
  }, {
    shifr: 1191,
    name: 'Научные исследования в технологии машиностроения'
  }, {
    shifr: 1192,
    name: 'Научные основы метрологического обеспечения производства'
  }, {
    shifr: 1193,
    name: 'Научные основы повышения эксплуатационных свойств деталей машин'
  }, {
    shifr: 1194,
    name: 'Научные основы ремонта деталей сваркой'
  }, {
    shifr: 1195,
    name: 'Научные основы энергетического воздействия в процессах обработки'
  }, {
    shifr: 1196,
    name: 'Научные школы психологии: проблемы теории и практики'
  }, {
    shifr: 1197,
    name: 'Научный семинар'
  }, {
    shifr: 1198,
    name: 'Научный семинар ' Математические модели и алгоритмы построения и развития систем электроснабжения ''
  }, {
    shifr: 1199,
    name: 'Начертательная геометрия и инженерная графика'
  }, {
    shifr: 1200,
    name: 'Начертательная геометрия, инженерная и компьютерная графика'
  }, {
    shifr: 1201,
    name: 'Начертательная геометрия. Инженерная графика'
  }, {
    shifr: 1202,
    name: 'Начертательная геометрия. Компьютерная графика'
  }, {
    shifr: 1203,
    name: 'Нейро-нечеткие технологии моделирования экономических систем'
  }, {
    shifr: 1204,
    name: 'Нейронные сети'
  }, {
    shifr: 1205,
    name: 'Неклассическая логика в контексте современного мышления'
  }, {
    shifr: 1206,
    name: 'Нелинейная оптика'
  }, {
    shifr: 1207,
    name: 'Нелинейные процессы микроволновой, квантовой и оптоэлектроники'
  }, {
    shifr: 1208,
    name: 'Нелинейный анализ и прогнозирование финансовых рынков'
  }, {
    shifr: 1209,
    name: 'Немецкая классическая философия'
  }, {
    shifr: 1210,
    name: 'Неопросные методы социологического исследования'
  }, {
    shifr: 1211,
    name: 'Неорганическая и органическая химия'
  }, {
    shifr: 1212,
    name: 'Непрерывные математические модели'
  }, {
    shifr: 1213,
    name: 'Неравновесная термодинамика'
  }, {
    shifr: 1214,
    name: 'Неразрушающие методы контроля материалов'
  }, {
    shifr: 1215,
    name: 'Неразрушающий контроль в строительстве'
  }, {
    shifr: 1216,
    name: 'Нетяговый подвижной состав'
  }, {
    shifr: 1217,
    name: 'Нечеткая логика и нейронные сети в мехатронных и робототехнических системах'
  }, {
    shifr: 1218,
    name: 'Новая и новейшая история'
  }, {
    shifr: 1219,
    name: 'Новая история Азии и Африки'
  }, {
    shifr: 1220,
    name: 'Новейшая история Азии и Африки'
  }, {
    shifr: 1221,
    name: 'Новейшие тенденции современной мировой философии'
  }, {
    shifr: 1222,
    name: 'Новые конструкционные и сварочные материалы'
  }, {
    shifr: 1223,
    name: 'Новые конструкционные материалы'
  }, {
    shifr: 1224,
    name: 'Новые материалы в обработке металлов давлением'
  }, {
    shifr: 1225,
    name: 'Новые материалы и технологии'
  }, {
    shifr: 1226,
    name: 'Новые технологии в мехатронике и робототехнике'
  }, {
    shifr: 1227,
    name: 'Ноксология'
  }, {
    shifr: 1228,
    name: 'Нормативная база в области охраны природы и природопользования'
  }, {
    shifr: 1229,
    name: 'Нормативно-правовое обеспечение деятельности железнодорожного транспорта'
  }, {
    shifr: 1230,
    name: 'Нормативно-правовое регулирование деятельности субъектов спортивной индустрии'
  }, {
    shifr: 1231,
    name: 'Нормативно-техническое обеспечение безопасности движения'
  }, {
    shifr: 1232,
    name: 'Нормирование и контроль показателей надежности промышленной продукции'
  }, {
    shifr: 1233,
    name: 'Нормирование и снижение загрязнений окружающей среды'
  }, {
    shifr: 1234,
    name: 'Нормирование оперативно-тактических действий'
  }, {
    shifr: 1235,
    name: 'Нотариат'
  }, {
    shifr: 1236,
    name: 'Нравственное богословие'
  }, {
    shifr: 1237,
    name: 'Обеспечение качества'
  }, {
    shifr: 1238,
    name: 'Обеспечение качества измерений'
  }, {
    shifr: 1239,
    name: 'Обеспечение надежности и безопасности экономических информационных систем'
  }, {
    shifr: 1240,
    name: 'Обеспечение освещенности на объектах промышленных сооружений, жилых и общественных зданий'
  }, {
    shifr: 1241,
    name: 'Обеспечение производственной и экологической безопасности'
  }, {
    shifr: 1242,
    name: 'Обеспечение решений в системах управления качеством'
  }, {
    shifr: 1243,
    name: 'Обеспечение сохранности архивного фонда'
  }, {
    shifr: 1244,
    name: 'Обеспечения качества и безопасности в средствах размещения'
  }, {
    shifr: 1245,
    name: 'Оборудование и автоматизация тепловой обработки материалов'
  }, {
    shifr: 1246,
    name: 'Оборудование и технология финишной обработки отливок'
  }, {
    shifr: 1247,
    name: 'Оборудование и технология художественного литья'
  }, {
    shifr: 1248,
    name: 'Оборудование литейных цехов'
  }, {
    shifr: 1249,
    name: 'Оборудование машиностроительных производств'
  }, {
    shifr: 1250,
    name: 'Оборудование производства изделий электронной техники'
  }, {
    shifr: 1251,
    name: 'Оборудование цехов порошковой металлургии'
  }, {
    shifr: 1252,
    name: 'Оборудование швейного производства'
  }, {
    shifr: 1253,
    name: 'Обоснование хозяйственных решений и оценка рисков'
  }, {
    shifr: 1254,
    name: 'Обработка и анализ изображений'
  }, {
    shifr: 1255,
    name: 'Общая и профессиональная педагогика'
  }, {
    shifr: 1256,
    name: 'Общая и специальная гигиена'
  }, {
    shifr: 1257,
    name: 'Общая и частная патология'
  }, {
    shifr: 1258,
    name: 'Общая конфликтология'
  }, {
    shifr: 1259,
    name: 'Общая психология'
  }, {
    shifr: 1260,
    name: 'Общая социологическая теория'
  }, {
    shifr: 1261,
    name: 'Общая социология и социология молодежи'
  }, {
    shifr: 1262,
    name: 'Общая теория здоровья'
  }, {
    shifr: 1263,
    name: 'Общая теория перевода'
  }, {
    shifr: 1264,
    name: 'Общая теория политики'
  }, {
    shifr: 1265,
    name: 'Общая теория рядов Фурье'
  }, {
    shifr: 1266,
    name: 'Общая технология пищевых производств и технология отрасли'
  }, {
    shifr: 1267,
    name: 'Общая физика'
  }, {
    shifr: 1268,
    name: 'Общая экология'
  }, {
    shifr: 1269,
    name: 'Общая электротехника и электроника'
  }, {
    shifr: 1270,
    name: 'Общая энергетика'
  }, {
    shifr: 1271,
    name: 'Общевоинская и специальная подготовка'
  }, {
    shifr: 1272,
    name: 'Общее материаловедение и технологии материалов'
  }, {
    shifr: 1273,
    name: 'Общее народоведение и СМИ'
  }, {
    shifr: 1274,
    name: 'Общее языкознание'
  }, {
    shifr: 1275,
    name: 'Общие основы педагогики высшей школы'
  }, {
    shifr: 1276,
    name: 'Общий курс водного транспорта'
  }, {
    shifr: 1277,
    name: 'Общий курс железнодорожного транспорта'
  }, {
    shifr: 1278,
    name: 'Общий курс транспорта'
  }, {
    shifr: 1279,
    name: 'Общий психологический практикум'
  }, {
    shifr: 1280,
    name: 'Общий физический практикум'
  }, {
    shifr: 1281,
    name: 'Объектно- и субъектно-ориентированные CASE-технологии в социальной работе'
  }, {
    shifr: 1282,
    name: 'Объектно-ориентированное программирование'
  }, {
    shifr: 1283,
    name: 'Объектно-ориентированные языки и системы программирования'
  }, {
    shifr: 1284,
    name: 'Объемные гидромашины и гидропередачи'
  }, {
    shifr: 1285,
    name: 'Онтология'
  }, {
    shifr: 1286,
    name: 'Опасные природные и техногенные процессы'
  }, {
    shifr: 1287,
    name: 'Оперативно-розыскная деятельность'
  }, {
    shifr: 1288,
    name: 'Операционное исчисление'
  }, {
    shifr: 1289,
    name: 'Операционные системы'
  }, {
    shifr: 1290,
    name: 'Операционные системы реального времени'
  }, {
    shifr: 1291,
    name: 'Операционные системы, среды и оболочки'
  }, {
    shifr: 1292,
    name: 'Операционный менеджмент'
  }, {
    shifr: 1293,
    name: 'Опросные и неопросные методы социологического исследования'
  }, {
    shifr: 1294,
    name: 'Опросные методы социологического исследования'
  }, {
    shifr: 1295,
    name: 'Оптика'
  }, {
    shifr: 1296,
    name: 'Оптимальные системы автоматического управления'
  }, {
    shifr: 1297,
    name: 'Оптимизационные методы и модели в экономике'
  }, {
    shifr: 1298,
    name: 'Оптимизационные процессы в городской транспортной среде'
  }, {
    shifr: 1299,
    name: 'Оптимизация налоговых показателей учета и отчетности'
  }, {
    shifr: 1300,
    name: 'Оптимизация проектирования и эксплуатации систем электроснабжения предприятий и городов'
  }, {
    shifr: 1301,
    name: 'Оптимизация процессов обработки давлением'
  }, {
    shifr: 1302,
    name: 'Оптимизация режимов нейтрали электрических сетей'
  }, {
    shifr: 1303,
    name: 'Оптимизация структур и параметров систем электроснабжения'
  }, {
    shifr: 1304,
    name: 'Оптический контроль'
  }, {
    shifr: 1305,
    name: 'Оптоволоконные системы связи'
  }, {
    shifr: 1306,
    name: 'Оптоэлектронные приборы и устройства'
  }, {
    shifr: 1307,
    name: 'Организационная конфликтология'
  }, {
    shifr: 1308,
    name: 'Организационная психология и психология социальной работы'
  }, {
    shifr: 1309,
    name: 'Организационное поведение'
  }, {
    shifr: 1310,
    name: 'Организационно-информационное обеспечение деятельности руководителя'
  }, {
    shifr: 1311,
    name: 'Организационно-информационное обеспечение деятельности руководителя архивных учреждений'
  }, {
    shifr: 1312,
    name: 'Организационно-производственные структуры технической эксплуатации автомобилей'
  }, {
    shifr: 1313,
    name: 'Организационно-производственные структуры транспорта'
  }, {
    shifr: 1314,
    name: 'Организация анимационной деятельности'
  }, {
    shifr: 1315,
    name: 'Организация бухгалтерского учета'
  }, {
    shifr: 1316,
    name: 'Организация внешнеторговых перевозок'
  }, {
    shifr: 1317,
    name: 'Организация гостиничного дела'
  }, {
    shifr: 1318,
    name: 'Организация государственных учреждений России'
  }, {
    shifr: 1319,
    name: 'Организация движения'
  }, {
    shifr: 1320,
    name: 'Организация и безопасность дорожного движения'
  }, {
    shifr: 1321,
    name: 'Организация и безопасность транспортного процесса'
  }, {
    shifr: 1322,
    name: 'Организация и ведение аварийно-спасательных работ'
  }, {
    shifr: 1323,
    name: 'Организация и документирование в деятельности государственной службы'
  }, {
    shifr: 1324,
    name: 'Организация и документирование деятельности архивной службы'
  }, {
    shifr: 1325,
    name: 'Организация и методика аудита'
  }, {
    shifr: 1326,
    name: 'Организация и обработка электронной информации'
  }, {
    shifr: 1327,
    name: 'Организация и планирование эксперимента'
  }, {
    shifr: 1328,
    name: 'Организация и проектирование сварочного производства'
  }, {
    shifr: 1329,
    name: 'Организация и техника внешнеэкономических операций'
  }, {
    shifr: 1330,
    name: 'Организация и техника внешнеэкономических отношений'
  }, {
    shifr: 1331,
    name: 'Организация и технологии документационного обеспечения государственного управления'
  }, {
    shifr: 1332,
    name: 'Организация и технология документационного обеспечения управления'
  }, {
    shifr: 1333,
    name: 'Организация и технология испытаний'
  }, {
    shifr: 1334,
    name: 'Организация и технология предоставления дополнительных услуг в средствах размещения'
  }, {
    shifr: 1335,
    name: 'Организация и управление в области обеспечения пожарной безопасности'
  }, {
    shifr: 1336,
    name: 'Организация и управление внешнеэкономической деятельностью'
  }, {
    shifr: 1337,
    name: 'Организация и управление информационно-аналитическим обеспечением СЭБ предприятия'
  }, {
    shifr: 1338,
    name: 'Организация и управление системой ЭБ предприятия'
  }, {
    shifr: 1339,
    name: 'Организация и управление эксплуатационной работой на промышленном транспорте'
  }, {
    shifr: 1340,
    name: 'Организация информационного обеспечения деятельности руководителя'
  }, {
    shifr: 1341,
    name: 'Организация международного бизнеса'
  }, {
    shifr: 1342,
    name: 'Организация международных перевозок и таможенные процедуры'
  }, {
    shifr: 1343,
    name: 'Организация научных и проектных исследований в сфере автоматизации'
  }, {
    shifr: 1344,
    name: 'Организация обслуживания в средствах размещения'
  }, {
    shifr: 1345,
    name: 'Организация оздоровительных работ'
  }, {
    shifr: 1346,
    name: 'Организация пассажирских перевозок'
  }, {
    shifr: 1347,
    name: 'Организация перевозок на промышленном транспорте'
  }, {
    shifr: 1348,
    name: 'Организация передачи, защиты и хранения информации'
  }, {
    shifr: 1349,
    name: 'Организация погрузочно-разгрузочных работ'
  }, {
    shifr: 1350,
    name: 'Организация предпринимательской деятельности в гостиничной индустрии'
  }, {
    shifr: 1351,
    name: 'Организация производства'
  }, {
    shifr: 1352,
    name: 'Организация производства подвижного состава'
  }, {
    shifr: 1353,
    name: 'Организация работы и документирование деятельности общественных, коммерческих и некоммерческих организаций'
  }, {
    shifr: 1354,
    name: 'Организация работы пресс-службы'
  }, {
    shifr: 1355,
    name: 'Организация работы с молодежью имеющей особые потребности'
  }, {
    shifr: 1356,
    name: 'Организация работы с обращением граждан'
  }, {
    shifr: 1357,
    name: 'Организация работы с технотронными документами'
  }, {
    shifr: 1358,
    name: 'Организация работы социологической службы'
  }, {
    shifr: 1359,
    name: 'Организация работы экспедиторских фирм'
  }, {
    shifr: 1360,
    name: 'Организация рекламной деятельности в спортивной индустрии'
  }, {
    shifr: 1361,
    name: 'Организация ресторанного хозяйства'
  }, {
    shifr: 1362,
    name: 'Организация секретарского обслуживания'
  }, {
    shifr: 1363,
    name: 'Организация сельского туризма'
  }, {
    shifr: 1364,
    name: 'Организация службы и подготовки'
  }, {
    shifr: 1365,
    name: 'Организация социально-воспитательной и досуговой работы с детьми и молодежью'
  }, {
    shifr: 1366,
    name: 'Организация социально-воспитательной и досуговой работы с разными категориями клиентов'
  }, {
    shifr: 1367,
    name: 'Организация спортивно-зрелищных мероприятий'
  }, {
    shifr: 1368,
    name: 'Организация транспортных услуг и средства обеспечения безопасности на транспорте'
  }, {
    shifr: 1369,
    name: 'Организация туристской деятельности'
  }, {
    shifr: 1370,
    name: 'Организация управленческого труда в пожарной охране'
  }, {
    shifr: 1371,
    name: 'Организация экскурсионной деятельности'
  }, {
    shifr: 1372,
    name: 'Организация эксперимента'
  }, {
    shifr: 1373,
    name: 'Организация, планирование и управление производством'
  }, {
    shifr: 1374,
    name: 'Освещение военных конфликтов в СМИ'
  }, {
    shifr: 1375,
    name: 'Основное богословие и апологетика'
  }, {
    shifr: 1376,
    name: 'Основные концепции криминологической науки'
  }, {
    shifr: 1377,
    name: 'Основы CAD/CAM - систем'
  }, {
    shifr: 1378,
    name: 'Основы автоматического проектирования электромеханических систем'
  }, {
    shifr: 1379,
    name: 'Основы автоматического управления'
  }, {
    shifr: 1380,
    name: 'Основы аудита'
  }, {
    shifr: 1381,
    name: 'Основы бизнес-информатики'
  }, {
    shifr: 1382,
    name: 'Основы взаимодействия полей с биообъектами'
  }, {
    shifr: 1383,
    name: 'Основы вторичного использования теплоты в двигателях внутреннего сгорания'
  }, {
    shifr: 1384,
    name: 'Основы газовой динамики комбинированных двигателей'
  }, {
    shifr: 1385,
    name: 'Основы геодезии'
  }, {
    shifr: 1386,
    name: 'Основы геодезии и проектирования железных дорог'
  }, {
    shifr: 1387,
    name: 'Основы геодезии и топографии'
  }, {
    shifr: 1388,
    name: 'Основы геоинформатики и навигации'
  }, {
    shifr: 1389,
    name: 'Основы геополитики и геостратегии'
  }, {
    shifr: 1390,
    name: 'Основы графического моделирования'
  }, {
    shifr: 1391,
    name: 'Основы деловой и публичной коммуникации в профессиональной деятельности'
  }, {
    shifr: 1392,
    name: 'Основы деловых коммуникаций и этикета'
  }, {
    shifr: 1393,
    name: 'Основы демографии'
  }, {
    shifr: 1394,
    name: 'Основы демократии'
  }, {
    shifr: 1395,
    name: 'Основы диетологии и рационального питания'
  }, {
    shifr: 1396,
    name: 'Основы журналистики'
  }, {
    shifr: 1397,
    name: 'Основы и история туризма'
  }, {
    shifr: 1398,
    name: 'Основы и методы научных исследований'
  }, {
    shifr: 1399,
    name: 'Основы и управление природопользованием'
  }, {
    shifr: 1400,
    name: 'Основы изготовления и обработки деталей'
  }, {
    shifr: 1401,
    name: 'Основы инженерного консалтинга'
  }, {
    shifr: 1402,
    name: 'Основы интралогистики'
  }, {
    shifr: 1403,
    name: 'Основы исследовательского анализа'
  }, {
    shifr: 1404,
    name: 'Основы кадровой стратегии и кадровой политики'
  }, {
    shifr: 1405,
    name: 'Основы квалиметрии'
  }, {
    shifr: 1406,
    name: 'Основы коммуникативной лингвистики'
  }, {
    shifr: 1407,
    name: 'Основы компьютерного моделирования металлургических процессов'
  }, {
    shifr: 1408,
    name: 'Основы консультативной психологии'
  }, {
    shifr: 1409,
    name: 'Основы консультирования в работе с молодежью'
  }, {
    shifr: 1410,
    name: 'Основы копирайтинга'
  }, {
    shifr: 1411,
    name: 'Основы литературной культуры'
  }, {
    shifr: 1412,
    name: 'Основы литературоведения'
  }, {
    shifr: 1413,
    name: 'Основы личностного консультирования молодежи'
  }, {
    shifr: 1414,
    name: 'Основы логистики'
  }, {
    shifr: 1415,
    name: 'Основы массажа и лечебный массаж'
  }, {
    shifr: 1416,
    name: 'Основы математического анализа'
  }, {
    shifr: 1417,
    name: 'Основы математического моделирования процессов в ДВС'
  }, {
    shifr: 1418,
    name: 'Основы медиакритики'
  }, {
    shifr: 1419,
    name: 'Основы международной безопасности'
  }, {
    shifr: 1420,
    name: 'Основы метрологии и электрические измерения'
  }, {
    shifr: 1421,
    name: 'Основы механики сплошной среды'
  }, {
    shifr: 1422,
    name: 'Основы мехатроники'
  }, {
    shifr: 1423,
    name: 'Основы мехатроники и робототехники'
  }, {
    shifr: 1424,
    name: 'Основы моделирования и оптимизации'
  }, {
    shifr: 1425,
    name: 'Основы моделирования, прогнозирования и проектирования в социальной работе'
  }, {
    shifr: 1426,
    name: 'Основы научного исследования'
  }, {
    shifr: 1427,
    name: 'Основы научно-педагогических исследований'
  }, {
    shifr: 1428,
    name: 'Основы научных исследований'
  }, {
    shifr: 1429,
    name: 'Основы научных исследований и испытаний ДВС'
  }, {
    shifr: 1430,
    name: 'Основы научных исследований и техника эксперимента'
  }, {
    shifr: 1431,
    name: 'Основы научных исследований, организация и планирование эксперимента'
  }, {
    shifr: 1432,
    name: 'Основы неврологии и психиатрии'
  }, {
    shifr: 1433,
    name: 'Основы нейропсихологии'
  }, {
    shifr: 1434,
    name: 'Основы организации автомобильных перевозок и безопасности движения'
  }, {
    shifr: 1435,
    name: 'Основы организации безопасной эксплуатационной работы городского транспорта'
  }, {
    shifr: 1436,
    name: 'Основы организации управленческой деятельности. Политическое управление'
  }, {
    shifr: 1437,
    name: 'Основы организационного проектирования'
  }, {
    shifr: 1438,
    name: 'Основы органической и биоорганической химии'
  }, {
    shifr: 1439,
    name: 'Основы отраслевых знаний'
  }, {
    shifr: 1440,
    name: 'Основы охраны труда'
  }, {
    shifr: 1441,
    name: 'Основы педагогического мастерства'
  }, {
    shifr: 1442,
    name: 'Основы первой медицинской помощи'
  }, {
    shifr: 1443,
    name: 'Основы переговорного процесса'
  }, {
    shifr: 1444,
    name: 'Основы подготовки диссертации'
  }, {
    shifr: 1445,
    name: 'Основы подготовки научной и учебной литературы'
  }, {
    shifr: 1446,
    name: 'Основы полиграфии'
  }, {
    shifr: 1447,
    name: 'Основы политической психологии и психология управления'
  }, {
    shifr: 1448,
    name: 'Основы православной культуры'
  }, {
    shifr: 1449,
    name: 'Основы предпринимательства'
  }, {
    shifr: 1450,
    name: 'Основы прикладной антропологии и биомеханики'
  }, {
    shifr: 1451,
    name: 'Основы прикладной лингвистики'
  }, {
    shifr: 1452,
    name: 'Основы принятия инженерно-технических решений'
  }, {
    shifr: 1453,
    name: 'Основы программирования на ПЭВМ'
  }, {
    shifr: 1454,
    name: 'Основы проектирования и эксплуатации технологического оборудования'
  }, {
    shifr: 1455,
    name: 'Основы проектирования информационных микрокомпьютерных систем'
  }, {
    shifr: 1456,
    name: 'Основы проектирования приборов и систем'
  }, {
    shifr: 1457,
    name: 'Основы профессионального мастерства'
  }, {
    shifr: 1458,
    name: 'Основы профессиональной деятельности устного переводчика'
  }, {
    shifr: 1459,
    name: 'Основы профессиональной коммуникации (английский)'
  }, {
    shifr: 1460,
    name: 'Основы профессиональной коммуникации (второй иностранный язык)'
  }, {
    shifr: 1461,
    name: 'Основы профессиональной коммуникации (второй иностранный)'
  }, {
    shifr: 1462,
    name: 'Основы профессиональной коммуникации (третий иностранный язык)'
  }, {
    shifr: 1463,
    name: 'Основы профессионально-педагогической риторики'
  }, {
    shifr: 1464,
    name: 'Основы профессиональных знаний по гидромашинам, гидроприводам и гидропневмоавтоматике'
  }, {
    shifr: 1465,
    name: 'Основы профессиональных знаний по механике и математическому моделированию'
  }, {
    shifr: 1466,
    name: 'Основы профилактики, реабилитации, кинезотерапии'
  }, {
    shifr: 1467,
    name: 'Основы психогенетики и дифференциальной психологии'
  }, {
    shifr: 1468,
    name: 'Основы психодиагностики'
  }, {
    shifr: 1469,
    name: 'Основы психологии и психология социальной работы'
  }, {
    shifr: 1470,
    name: 'Основы психологической дифференциации социальных клиентов'
  }, {
    shifr: 1471,
    name: 'Основы работоспособности и техническое регулирование на автотранспорте'
  }, {
    shifr: 1472,
    name: 'Основы работы с малолетними преступниками'
  }, {
    shifr: 1473,
    name: 'Основы радиоэлектроники'
  }, {
    shifr: 1474,
    name: 'Основы редактирования'
  }, {
    shifr: 1475,
    name: 'Основы редакторского мастерства'
  }, {
    shifr: 1476,
    name: 'Основы релейной защиты и автоматики'
  }, {
    shifr: 1477,
    name: 'Основы робототехники'
  }, {
    shifr: 1478,
    name: 'Основы сакральной психологии и педагогики'
  }, {
    shifr: 1479,
    name: 'Основы САПР (гидромашин)'
  }, {
    shifr: 1480,
    name: 'Основы системного анализа'
  }, {
    shifr: 1481,
    name: 'Основы современных информационных технологий'
  }, {
    shifr: 1482,
    name: 'Основы современных информационных технологий в пищевой промышленности'
  }, {
    shifr: 1483,
    name: 'Основы социального образования'
  }, {
    shifr: 1484,
    name: 'Основы социальной геронтологии'
  }, {
    shifr: 1485,
    name: 'Основы социальной медицины'
  }, {
    shifr: 1486,
    name: 'Основы социальной педагогики'
  }, {
    shifr: 1487,
    name: 'Основы социальной работы и социальной реабилитации'
  }, {
    shifr: 1488,
    name: 'Основы социологии и социология труда'
  }, {
    shifr: 1489,
    name: 'Основы стандартизации и качества продукции'
  }, {
    shifr: 1490,
    name: 'Основы СТО и ОТО'
  }, {
    shifr: 1491,
    name: 'Основы судебно-психологической экспертизы'
  }, {
    shifr: 1492,
    name: 'Основы теории автоматического управления'
  }, {
    shifr: 1493,
    name: 'Основы теории и методики физической культуры и спорта'
  }, {
    shifr: 1494,
    name: 'Основы теории информационных систем и процессов'
  }, {
    shifr: 1495,
    name: 'Основы теории надежности и диагностики'
  }, {
    shifr: 1496,
    name: 'Основы теории надежности электронных приборов'
  }, {
    shifr: 1497,
    name: 'Основы теории организации социального управления'
  }, {
    shifr: 1498,
    name: 'Основы теории управления'
  }, {
    shifr: 1499,
    name: 'Основы теория трения и изнашивания'
  }, {
    shifr: 1500,
    name: 'Основы технических средств в таможенном контроле'
  }, {
    shifr: 1501,
    name: 'Основы технического регулирования'
  }, {
    shifr: 1502,
    name: 'Основы технической виброакустики оборудования пищевых производств'
  }, {
    shifr: 1503,
    name: 'Основы технической эксплуатации и сервиса автомобилей'
  }, {
    shifr: 1504,
    name: 'Основы технологии машиностроения'
  }, {
    shifr: 1505,
    name: 'Основы технологии производства и метрологический контроль'
  }, {
    shifr: 1506,
    name: 'Основы технологии производства и ремонта автомобилей'
  }, {
    shifr: 1507,
    name: 'Основы транспортного бизнеса'
  }, {
    shifr: 1508,
    name: 'Основы транспортного бизнеса и аутсорсинг на магистральном транспорте'
  }, {
    shifr: 1509,
    name: 'Основы транспортно-экспедиционного обслуживания'
  }, {
    shifr: 1510,
    name: 'Основы управления перевозочными процессами'
  }, {
    shifr: 1511,
    name: 'Основы учебно-методической работы в вузе'
  }, {
    shifr: 1512,
    name: 'Основы фамилистики'
  }, {
    shifr: 1513,
    name: 'Основы физики прочности и механики разрушения'
  }, {
    shifr: 1514,
    name: 'Основы физико-химии сплавов'
  }, {
    shifr: 1515,
    name: 'Основы функциональной диагностики и оздоровительно реабилитационное оборудование'
  }, {
    shifr: 1516,
    name: 'Основы цифровой электроники'
  }, {
    shifr: 1517,
    name: 'Основы экологических исследований'
  }, {
    shifr: 1518,
    name: 'Основы экономической безопасности и антикризисное управление'
  }, {
    shifr: 1519,
    name: 'Основы электроники'
  }, {
    shifr: 1520,
    name: 'Основы электропривода'
  }, {
    shifr: 1521,
    name: 'Основы электропривода технологических установок на железной дороге'
  }, {
    shifr: 1522,
    name: 'Основы электротехники'
  }, {
    shifr: 1523,
    name: 'Особенности перевода художественных произведений и их редактирование'
  }, {
    shifr: 1524,
    name: 'Особенности проектирования одежды по индивидуальным заказам'
  }, {
    shifr: 1525,
    name: 'Отделочно-абразивные методы обработки'
  }, {
    shifr: 1526,
    name: 'Отчетность предприятия'
  }, {
    shifr: 1527,
    name: 'Охрана окружающей среды'
  }, {
    shifr: 1528,
    name: 'Оценка воздействия на окружающую среду'
  }, {
    shifr: 1529,
    name: 'Оценка деятельности персонала'
  }, {
    shifr: 1530,
    name: 'Оценка и налогообложение объектов недвижимости и нематериальных активов'
  }, {
    shifr: 1531,
    name: 'Оценка качества организации работы с молодежью'
  }, {
    shifr: 1532,
    name: 'Оценка состояния и устойчивости экосистем'
  }, {
    shifr: 1533,
    name: 'Оценка стоимости бизнеса'
  }, {
    shifr: 1534,
    name: 'Оценка стоимости прав интеллектуальной собственности'
  }, {
    shifr: 1535,
    name: 'Оценка стоимости спортивных клубов'
  }, {
    shifr: 1536,
    name: 'Оценка управленческой деятельности'
  }, {
    shifr: 1537,
    name: 'Оценка финансовых и кредитных рисков'
  }, {
    shifr: 1538,
    name: 'Очистка и кондиционирование рабочих жидкостей'
  }, {
    shifr: 1539,
    name: 'Паблик рилейшенз и психология рекламы'
  }, {
    shifr: 1540,
    name: 'Пайка металлов и сварка пластмасс'
  }, {
    shifr: 1541,
    name: 'Пакеты прикладных программ для имитационного моделирования'
  }, {
    shifr: 1542,
    name: 'Палеография'
  }, {
    shifr: 1543,
    name: 'Параллельное программирование'
  }, {
    shifr: 1544,
    name: 'Параллельные и распределенные вычисления'
  }, {
    shifr: 1545,
    name: 'Патентно-конъюнктурные исследования'
  }, {
    shifr: 1546,
    name: 'Патентование научно-технических разработок'
  }, {
    shifr: 1547,
    name: 'Патентоведение'
  }, {
    shifr: 1548,
    name: 'Патентоведение и защита интеллектуальной собственности'
  }, {
    shifr: 1549,
    name: 'Патопсихология'
  }, {
    shifr: 1550,
    name: 'Педагогика'
  }, {
    shifr: 1551,
    name: 'Педагогика высшей школы'
  }, {
    shifr: 1552,
    name: 'Педагогическая антропология'
  }, {
    shifr: 1553,
    name: 'Педагогическая конфликтология'
  }, {
    shifr: 1554,
    name: 'Педагогическая психология'
  }, {
    shifr: 1555,
    name: 'Педагогическая психология и педагогика в профессиональной деятельности'
  }, {
    shifr: 1556,
    name: 'Педагогические технологии'
  }, {
    shifr: 1557,
    name: 'Педагогический практикум'
  }, {
    shifr: 1558,
    name: 'Педагогическое проектирование в профессиональном образовании'
  }, {
    shifr: 1559,
    name: 'Пенсионное обеспечение'
  }, {
    shifr: 1560,
    name: 'Первичный учет'
  }, {
    shifr: 1561,
    name: 'Первоначальная подготовка спасателей'
  }, {
    shifr: 1562,
    name: 'Перевод научно-технической литературы'
  }, {
    shifr: 1563,
    name: 'Перевод официально-деловой литературы'
  }, {
    shifr: 1564,
    name: 'Перевод социально-экономической литературы'
  }, {
    shifr: 1565,
    name: 'Перевозка опасных грузов'
  }, {
    shifr: 1566,
    name: 'Перевозка опасных грузов автотранспортом'
  }, {
    shifr: 1567,
    name: 'Переговорный процесс: стратегия и тактика ведения переговоров'
  }, {
    shifr: 1568,
    name: 'Переговоры компромисса и принуждения альтернативные формы разрешения конфликтов'
  }, {
    shifr: 1569,
    name: 'Передача и обработка информации'
  }, {
    shifr: 1570,
    name: 'Передача информации в робототехнических и мехатронных системах'
  }, {
    shifr: 1571,
    name: 'Перспективные материалы'
  }, {
    shifr: 1572,
    name: 'Перспективные методы сварки'
  }, {
    shifr: 1573,
    name: 'Перспективные технологии изготовления швейных изделий различного направления'
  }, {
    shifr: 1574,
    name: 'Перспективные технологии термической и химикотермической обработки материалов'
  }, {
    shifr: 1575,
    name: 'Перспективы и программы развития молодежи в регионе'
  }, {
    shifr: 1576,
    name: 'Печатные и электронные издания'
  }, {
    shifr: 1577,
    name: 'Печатные и электронные средства информации'
  }, {
    shifr: 1578,
    name: 'Печи и сушила литейных цехов'
  }, {
    shifr: 1579,
    name: 'Плазменное нанесение покрытий'
  }, {
    shifr: 1580,
    name: 'Планирование городской транспортной сети'
  }, {
    shifr: 1581,
    name: 'Планирование гостиничной деятельности'
  }, {
    shifr: 1582,
    name: 'Планирование деятельности в туристской индустрии'
  }, {
    shifr: 1583,
    name: 'Планирование и контроль на предприятии'
  }, {
    shifr: 1584,
    name: 'Планирование и обработка результатов испытаний гидропневмосистем'
  }, {
    shifr: 1585,
    name: 'Планирование и организация тушения пожаров'
  }, {
    shifr: 1586,
    name: 'Планирование и организация эксперимента в метрологии'
  }, {
    shifr: 1587,
    name: 'Планирование и организация эксперимента в обработке давлением'
  }, {
    shifr: 1588,
    name: 'Планирование и оценка бюджетных расходов'
  }, {
    shifr: 1589,
    name: 'Планирование теоретического и практического исследования в психологии'
  }, {
    shifr: 1590,
    name: 'Планирование эксперимента'
  }, {
    shifr: 1591,
    name: 'Планирование эксперимента в инженерных и научных исследованиях'
  }, {
    shifr: 1592,
    name: 'Планирование эксперимента и обработка экспериментальных данных'
  }, {
    shifr: 1593,
    name: 'Планирование эксперимента при поиске оптимальных решений в задачах подъемно-транспортного, строительного, дорожного машиностроения'
  }, {
    shifr: 1594,
    name: 'Планирование эксперимента при поиске оптимальных решений в задачах подъемно-транспортного, строительного, дорожного машиностроения (планы первого и второго порядка)'
  }, {
    shifr: 1595,
    name: 'Планирование экспериментов и обработка экспериментальных данных'
  }, {
    shifr: 1596,
    name: 'Платежные системы'
  }, {
    shifr: 1597,
    name: 'Платформа .NET'
  }, {
    shifr: 1598,
    name: 'Пневмопривод и средства пневмоавтоматики'
  }, {
    shifr: 1599,
    name: 'ПО корпоративных систем'
  }, {
    shifr: 1600,
    name: 'Поведение потребителей'
  }, {
    shifr: 1601,
    name: 'Погрузочно-разгрузочное оборудование, специальный транспорт и склады предприятий'
  }, {
    shifr: 1602,
    name: 'Подбор и найм персонала'
  }, {
    shifr: 1603,
    name: 'Подвижной состав городской и промышленной инфраструктуры'
  }, {
    shifr: 1604,
    name: 'Подвижной состав промышленного транспорта и транспорт в технологических процессах промышленных предприятий'
  }, {
    shifr: 1605,
    name: 'Подвижной состав транспортных систем'
  }, {
    shifr: 1606,
    name: 'Подготовка руководителя молодежного движения'
  }, {
    shifr: 1607,
    name: 'Подсистемы интеллектуальных транспортных систем'
  }, {
    shifr: 1608,
    name: 'Подъёмно-транспортные машины в отрасли станкостроения'
  }, {
    shifr: 1609,
    name: 'Пожарная безопасность в строительстве'
  }, {
    shifr: 1610,
    name: 'Пожарная безопасность технологических процессов'
  }, {
    shifr: 1611,
    name: 'Пожарная безопасность электроустановок'
  }, {
    shifr: 1612,
    name: 'Пожарная тактика'
  }, {
    shifr: 1613,
    name: 'Пожарная техника'
  }, {
    shifr: 1614,
    name: 'Пожарно-строевая подготовка'
  }, {
    shifr: 1615,
    name: 'Пожарно-техническая экспертиза и экспертиза пожаров'
  }, {
    shifr: 1616,
    name: 'Пожаровзрывозащита'
  }, {
    shifr: 1617,
    name: 'Полевая археология'
  }, {
    shifr: 1618,
    name: 'Полиграфическое производство'
  }, {
    shifr: 1619,
    name: 'Политика и религия'
  }, {
    shifr: 1620,
    name: 'Политика и экономика'
  }, {
    shifr: 1621,
    name: 'Политическая антропология'
  }, {
    shifr: 1622,
    name: 'Политическая и экономическая география'
  }, {
    shifr: 1623,
    name: 'Политическая идентификация разных народов'
  }, {
    shifr: 1624,
    name: 'Политическая культура'
  }, {
    shifr: 1625,
    name: 'Политическая проблематика в СМИ'
  }, {
    shifr: 1626,
    name: 'Политическая психология'
  }, {
    shifr: 1627,
    name: 'Политическая регионалистика'
  }, {
    shifr: 1628,
    name: 'Политическая рискология'
  }, {
    shifr: 1629,
    name: 'Политическая риторика'
  }, {
    shifr: 1630,
    name: 'Политическая семиотика'
  }, {
    shifr: 1631,
    name: 'Политическая социология'
  }, {
    shifr: 1632,
    name: 'Политическая текстология: теория, методология, методика анализа'
  }, {
    shifr: 1633,
    name: 'Политическая экспертиза: аналитика и прогностика'
  }, {
    shifr: 1634,
    name: 'Политическая этика'
  }, {
    shifr: 1635,
    name: 'Политические режимы и системы современности'
  }, {
    shifr: 1636,
    name: 'Политические технологии и современное общество'
  }, {
    shifr: 1637,
    name: 'Политический PR и политическая коммуникативистика'
  }, {
    shifr: 1638,
    name: 'Политический анализ и прогнозирование'
  }, {
    shifr: 1639,
    name: 'Политический менеджмент'
  }, {
    shifr: 1640,
    name: 'Политическое лидерство и политические элиты'
  }, {
    shifr: 1641,
    name: 'Политическое проектирование'
  }, {
    shifr: 1642,
    name: 'Политология'
  }, {
    shifr: 1643,
    name: 'Полупроводниковые ключи в силовых схемах'
  }, {
    shifr: 1644,
    name: 'Полупроводниковые преобразователи энергии'
  }, {
    shifr: 1645,
    name: 'Порошковая металлургия'
  }, {
    shifr: 1646,
    name: 'Послесварочная обработка'
  }, {
    shifr: 1647,
    name: 'Посредничество в разрешении конфликта'
  }, {
    shifr: 1648,
    name: 'Постановка голоса'
  }, {
    shifr: 1649,
    name: 'Построение индивидуальных программ физической реабилитации'
  }, {
    shifr: 1650,
    name: 'Построение распределённых систем мониторинга'
  }, {
    shifr: 1651,
    name: 'Потенциал и развитие предприятия'
  }, {
    shifr: 1652,
    name: 'Почвоведение'
  }, {
    shifr: 1653,
    name: 'Правила дорожного движения и технической эксплуатации промышленного транспорта'
  }, {
    shifr: 1654,
    name: 'Правила технической эксплуатации железных дорог'
  }, {
    shifr: 1655,
    name: 'Право и история художественной отечественной литературы'
  }, {
    shifr: 1656,
    name: 'Право интеллектуальной собственности'
  }, {
    shifr: 1657,
    name: 'Право социального обеспечения'
  }, {
    shifr: 1658,
    name: 'Правоведение'
  }, {
    shifr: 1659,
    name: 'Правовое обеспечение безопасности предприятий'
  }, {
    shifr: 1660,
    name: 'Правовое обеспечение гостиничной деятельности'
  }, {
    shifr: 1661,
    name: 'Правовое обеспечение деятельности в туристской индустрии'
  }, {
    shifr: 1662,
    name: 'Правовое обеспечение инновационной деятельности'
  }, {
    shifr: 1663,
    name: 'Правовое обеспечение профессиональной деятельности'
  }, {
    shifr: 1664,
    name: 'Правовое обеспечение развития информационных систем'
  }, {
    shifr: 1665,
    name: 'Правовое регулирование в области пожарной безопасности'
  }, {
    shifr: 1666,
    name: 'Правовое регулирование в туриндустрии'
  }, {
    shifr: 1667,
    name: 'Правовое регулирование в туристской индустрии'
  }, {
    shifr: 1668,
    name: 'Правовое регулирование спорта'
  }, {
    shifr: 1669,
    name: 'Правовое регулирование труда в рыночных отношениях'
  }, {
    shifr: 1670,
    name: 'Правовое регулирование труда судей и сотрудников правоохранительных органов'
  }, {
    shifr: 1671,
    name: 'Правовые (хозяйственные и административные) основы деятельности церквей'
  }, {
    shifr: 1672,
    name: 'Правовые основы издательского дела'
  }, {
    shifr: 1673,
    name: 'Правовые основы издательского дела и СМИ'
  }, {
    shifr: 1674,
    name: 'Правовые основы налогового законодательства'
  }, {
    shifr: 1675,
    name: 'Правовые основы природопользования и охраны окружающей среды'
  }, {
    shifr: 1676,
    name: 'Правовые основы противодействия террористической деятельности'
  }, {
    shifr: 1677,
    name: 'Правовые основы СМИ'
  }, {
    shifr: 1678,
    name: 'Правовые основы управления'
  }, {
    shifr: 1679,
    name: 'Практика перевода'
  }, {
    shifr: 1680,
    name: 'Практика перевода (основной иностранный язык)'
  }, {
    shifr: 1681,
    name: 'Практика применения судами трудового законодательства'
  }, {
    shifr: 1682,
    name: 'Практика урегулирования конфликтов'
  }, {
    shifr: 1683,
    name: 'Практикум на ЭВМ'
  }, {
    shifr: 1684,
    name: 'Практикум на ЭВМ 2'
  }, {
    shifr: 1685,
    name: 'Практикум на ЭВМ по гидроаэродинамике'
  }, {
    shifr: 1686,
    name: 'Практикум по аэрогидромеханике'
  }, {
    shifr: 1687,
    name: 'Практикум по возрастной психологии'
  }, {
    shifr: 1688,
    name: 'Практикум по конфликтологии'
  }, {
    shifr: 1689,
    name: 'Практикум по культуре речевого общения (второй иностранный язык)'
  }, {
    shifr: 1690,
    name: 'Практикум по культуре речевого общения (основной иностранный язык)'
  }, {
    shifr: 1691,
    name: 'Практикум по офисному программированию'
  }, {
    shifr: 1692,
    name: 'Практикум по программированию'
  }, {
    shifr: 1693,
    name: 'Практикум по психодиагностике'
  }, {
    shifr: 1694,
    name: 'Практикум по редактированию текста'
  }, {
    shifr: 1695,
    name: 'Практикум по социальной психологии'
  }, {
    shifr: 1696,
    name: 'Практикум по языку СМИ'
  }, {
    shifr: 1697,
    name: 'Практикум решения физических задач'
  }, {
    shifr: 1698,
    name: 'Практикум физического эксперимента'
  }, {
    shifr: 1699,
    name: 'Практическая стилистика в массмедиа'
  }, {
    shifr: 1700,
    name: 'Практическая философия'
  }, {
    shifr: 1701,
    name: 'Практическая экология'
  }, {
    shifr: 1702,
    name: 'Практические методы разрешения психологических конфликтов'
  }, {
    shifr: 1703,
    name: 'Практический курс второго иностранного языка и перевода'
  }, {
    shifr: 1704,
    name: 'Практический курс первого иностранного языка'
  }, {
    shifr: 1705,
    name: 'Практический курс перевода первого иностранного языка'
  }, {
    shifr: 1706,
    name: 'Практический курс русского языка/орфография и пунктуация (практикум)'
  }, {
    shifr: 1707,
    name: 'Практический курс третьего иностранного языка и перевода'
  }, {
    shifr: 1708,
    name: 'Практическое (производственное) обучение'
  }, {
    shifr: 1709,
    name: 'Преддипломная практика'
  }, {
    shifr: 1710,
    name: 'Предохранительные устройства технологического оборудования'
  }, {
    shifr: 1711,
    name: 'Предпринимательское право'
  }, {
    shifr: 1712,
    name: 'Представление и использование знаний в интеллектуальных системах'
  }, {
    shifr: 1713,
    name: 'Преподавание психологии в системе высшего и дополнительного образования'
  }, {
    shifr: 1714,
    name: 'Приборы и системы экологического мониторинга'
  }, {
    shifr: 1715,
    name: 'Приборы и устройства СВЧ'
  }, {
    shifr: 1716,
    name: 'Приборы магнитного контроля'
  }, {
    shifr: 1717,
    name: 'Приборы медицинской диагностики'
  }, {
    shifr: 1718,
    name: 'Приборы специального и таможенного контроля'
  }, {
    shifr: 1719,
    name: 'Приборы УЗД'
  }, {
    shifr: 1720,
    name: 'Приемо-передающие и антенно-фидерные устройства'
  }, {
    shifr: 1721,
    name: 'Прикладная газовая динамика'
  }, {
    shifr: 1722,
    name: 'Прикладная математика'
  }, {
    shifr: 1723,
    name: 'Прикладная механика'
  }, {
    shifr: 1724,
    name: 'Прикладная механика (1)'
  }, {
    shifr: 1725,
    name: 'Прикладная механика (2)'
  }, {
    shifr: 1726,
    name: 'Прикладная термодинамика'
  }, {
    shifr: 1727,
    name: 'Прикладное программирование в автоматизированных системах'
  }, {
    shifr: 1728,
    name: 'Прикладное программирование в технических системах'
  }, {
    shifr: 1729,
    name: 'Прикладное программное обеспечение'
  }, {
    shifr: 1730,
    name: 'Прикладное программное обеспечение в сварочном производстве'
  }, {
    shifr: 1731,
    name: 'Прикладное программное обеспечение для разработки научной и технической документации'
  }, {
    shifr: 1732,
    name: 'Прикладное программное обеспечение для управления предприятиями'
  }, {
    shifr: 1733,
    name: 'Прикладные аспекты теории вычетов'
  }, {
    shifr: 1734,
    name: 'Прикладные методы научных исследований'
  }, {
    shifr: 1735,
    name: 'Прикладные программы в инженерном проектировании'
  }, {
    shifr: 1736,
    name: 'Прикладные программы в инженерном проектировании пищевого оборудования'
  }, {
    shifr: 1737,
    name: 'Прикладные программы в инженерных расчетах'
  }, {
    shifr: 1738,
    name: 'Применение квантовых и оптических приборов'
  }, {
    shifr: 1739,
    name: 'Приобретение прав интеллектуальной собственности'
  }, {
    shifr: 1740,
    name: 'Проблематика СМИ'
  }, {
    shifr: 1741,
    name: 'Проблемно-ориентированные вычислительные системы'
  }, {
    shifr: 1742,
    name: 'Проблемы борьбы с незаконным оборотом наркотиков'
  }, {
    shifr: 1743,
    name: 'Проблемы гражданского договорного права'
  }, {
    shifr: 1744,
    name: 'Проблемы жилищного и наследственного права'
  }, {
    shifr: 1745,
    name: 'Проблемы и теории социального развития молодежи'
  }, {
    shifr: 1746,
    name: 'Проблемы исследования языковой личности авторов текстов различных типов'
  }, {
    shifr: 1747,
    name: 'Проблемы менеджмента в социальной работе'
  }, {
    shifr: 1748,
    name: 'Проблемы наследственного права'
  }, {
    shifr: 1749,
    name: 'Проблемы общения и социально-психологический тренинг'
  }, {
    shifr: 1750,
    name: 'Проблемы региональной ономастики'
  }, {
    shifr: 1751,
    name: 'Прогнозирование и моделирование в спортивной индустрии'
  }, {
    shifr: 1752,
    name: 'Прогнозирование и планирование в организации'
  }, {
    shifr: 1753,
    name: 'Прогнозирование опасных факторов пожара'
  }, {
    shifr: 1754,
    name: 'Прогнозирование остаточного ресурса грузоподъемных кранов'
  }, {
    shifr: 1755,
    name: 'Прогнозирование социально-экономических процессов'
  }, {
    shifr: 1756,
    name: 'Прогнозирование, планирование, анализ и экспертиза в туризме и сервисе'
  }, {
    shifr: 1757,
    name: 'Программирование'
  }, {
    shifr: 1758,
    name: 'Программирование WebGL'
  }, {
    shifr: 1759,
    name: 'Программирование для параллельных вычислений'
  }, {
    shifr: 1760,
    name: 'Программирование и основы алгоритмизации'
  }, {
    shifr: 1761,
    name: 'Программирование и основы алгоритмизации систем управления'
  }, {
    shifr: 1762,
    name: 'Программирование и разработка веб-приложений'
  }, {
    shifr: 1763,
    name: 'Программирование интернет'
  }, {
    shifr: 1764,
    name: 'Программирование клиент-серверных приложений'
  }, {
    shifr: 1765,
    name: 'Программирование компьютерной графики'
  }, {
    shifr: 1766,
    name: 'Программирование контроллеров'
  }, {
    shifr: 1767,
    name: 'Программирование мехатронных и робототехнических систем'
  }, {
    shifr: 1768,
    name: 'Программирование микроконтроллеров для систем управления, сбора и обработки данных'
  }, {
    shifr: 1769,
    name: 'Программирование мобильных устройств'
  }, {
    shifr: 1770,
    name: 'Программирование систем реального времени'
  }, {
    shifr: 1771,
    name: 'Программирование систем управления роботами'
  }, {
    shifr: 1772,
    name: 'Программная инженерия'
  }, {
    shifr: 1773,
    name: 'Программное обеспечение и алгоритмизация'
  }, {
    shifr: 1774,
    name: 'Программное обеспечение измерительной техники'
  }, {
    shifr: 1775,
    name: 'Программное обеспечение измерительных систем'
  }, {
    shifr: 1776,
    name: 'Программное обеспечение мехатронных и робототехнических систем'
  }, {
    shifr: 1777,
    name: 'Программное обеспечение учетно-статистических операций'
  }, {
    shifr: 1778,
    name: 'Программное управление исполнительными системами мехатронных и робототехнических устройств'
  }, {
    shifr: 1779,
    name: 'Программные средства автоматизации бухгалтерского учета'
  }, {
    shifr: 1780,
    name: 'Прогрессивные технологии изготовления изделий машиностроения'
  }, {
    shifr: 1781,
    name: 'Проектирование в высшем профессиональном образовании'
  }, {
    shifr: 1782,
    name: 'Проектирование гидромашин, гидроприводов и средств ГПА'
  }, {
    shifr: 1783,
    name: 'Проектирование гостиничной деятельности'
  }, {
    shifr: 1784,
    name: 'Проектирование и прогнозирование социальных процессов'
  }, {
    shifr: 1785,
    name: 'Проектирование и производство инструментальной техники'
  }, {
    shifr: 1786,
    name: 'Проектирование и расчеты кузнечно-штамповочных машин'
  }, {
    shifr: 1787,
    name: 'Проектирование и технология электронной компонентной базы СВЧ'
  }, {
    shifr: 1788,
    name: 'Проектирование изделий легкой промышленности в САПР'
  }, {
    shifr: 1789,
    name: 'Проектирование инструментального производства'
  }, {
    shifr: 1790,
    name: 'Проектирование интегральных микросхем'
  }, {
    shifr: 1791,
    name: 'Проектирование информационно-управляющих систем'
  }, {
    shifr: 1792,
    name: 'Проектирование информационных систем'
  }, {
    shifr: 1793,
    name: 'Проектирование компьютерных сетей'
  }, {
    shifr: 1794,
    name: 'Проектирование литейных цехов'
  }, {
    shifr: 1795,
    name: 'Проектирование машиностроительного производства'
  }, {
    shifr: 1796,
    name: 'Проектирование микропроцессорных и компьютерных систем'
  }, {
    shifr: 1797,
    name: 'Проектирование микропроцессорных и микроконтроллерных систем'
  }, {
    shifr: 1798,
    name: 'Проектирование мобильных приложений и веб-сервисов'
  }, {
    shifr: 1799,
    name: 'Проектирование новых и реконструкция действующих цехов'
  }, {
    shifr: 1800,
    name: 'Проектирование оборудования и устройств для специальных технологий'
  }, {
    shifr: 1801,
    name: 'Проектирование оснастки'
  }, {
    shifr: 1802,
    name: 'Проектирование оснастки и прессформ'
  }, {
    shifr: 1803,
    name: 'Проектирование предприятий пищевой промышленности'
  }, {
    shifr: 1804,
    name: 'Проектирование предприятий с основами САПР'
  }, {
    shifr: 1805,
    name: 'Проектирование приспособлений'
  }, {
    shifr: 1806,
    name: 'Проектирование программных систем'
  }, {
    shifr: 1807,
    name: 'Проектирование режущего инструмента'
  }, {
    shifr: 1808,
    name: 'Проектирование сварных соединений и конструкций'
  }, {
    shifr: 1809,
    name: 'Проектирование СГПП'
  }, {
    shifr: 1810,
    name: 'Проектирование систем автоматизации и управления'
  }, {
    shifr: 1811,
    name: 'Проектирование систем технологической оснастки и специального оборудования'
  }, {
    shifr: 1812,
    name: 'Проектирование систем управления роботами'
  }, {
    shifr: 1813,
    name: 'Проектирование систем электроснабжения'
  }, {
    shifr: 1814,
    name: 'Проектирование современных образовательных систем'
  }, {
    shifr: 1815,
    name: 'Проектирование социально-экономических систем'
  }, {
    shifr: 1816,
    name: 'Проектирование технологий абразивной обработки'
  }, {
    shifr: 1817,
    name: 'Проектирование технологических процессов сборки изделий'
  }, {
    shifr: 1818,
    name: 'Проектирование транспортной системы предприятий'
  }, {
    shifr: 1819,
    name: 'Проектирование управлений на основе SCADA-систем'
  }, {
    shifr: 1820,
    name: 'Проектирование управляющих программ для ГПМ в ИП'
  }, {
    shifr: 1821,
    name: 'Проектирование художественных систем одежды'
  }, {
    shifr: 1822,
    name: 'Проектирование швейных предприятий'
  }, {
    shifr: 1823,
    name: 'Проектирование электронной компонентной базы'
  }, {
    shifr: 1824,
    name: 'Проектная деятельность'
  }, {
    shifr: 1825,
    name: 'Проектный анализ'
  }, {
    shifr: 1826,
    name: 'Производственная и пожарная автоматика'
  }, {
    shifr: 1827,
    name: 'Производственная практика'
  }, {
    shifr: 1828,
    name: 'Производственно-техническая инфраструктура и основы проектирования предприятий автомобильного транспорта'
  }, {
    shifr: 1829,
    name: 'Производственные процессы и оборудование объектов автоматизации'
  }, {
    shifr: 1830,
    name: 'Производство и ремонт подвижного состава'
  }, {
    shifr: 1831,
    name: 'Производство отливок из сплавов цветных металлов'
  }, {
    shifr: 1832,
    name: 'Производство отливок из стали и чугуна'
  }, {
    shifr: 1833,
    name: 'Промышленная аэродинамика'
  }, {
    shifr: 1834,
    name: 'Промышленная экология'
  }, {
    shifr: 1835,
    name: 'Промышленные автодороги'
  }, {
    shifr: 1836,
    name: 'Промышленный дизайн и конструирование автомобилей'
  }, {
    shifr: 1837,
    name: 'Промышленный транспорт и нетяговый подвижной состав'
  }, {
    shifr: 1838,
    name: 'Противопожарное водоснабжение'
  }, {
    shifr: 1839,
    name: 'Профессиональная этика'
  }, {
    shifr: 1840,
    name: 'Профессиональная этика государственного служащего'
  }, {
    shifr: 1841,
    name: 'Профессиональная этика журналиста'
  }, {
    shifr: 1842,
    name: 'Профессиональное общение в работе с молодежью'
  }, {
    shifr: 1843,
    name: 'Профессиональное общение в социальной работе'
  }, {
    shifr: 1844,
    name: 'Профессиональное общение и этика в работе с молодежью'
  }, {
    shifr: 1845,
    name: 'Профессионально-педагогическая риторика'
  }, {
    shifr: 1846,
    name: 'Профессионально-творческий практикум'
  }, {
    shifr: 1847,
    name: 'Профессионально-этические основы работы с молодежью'
  }, {
    shifr: 1848,
    name: 'Профессиональные особенности действий спасателей в ЧС'
  }, {
    shifr: 1849,
    name: 'Профессиональный иностранный язык'
  }, {
    shifr: 1850,
    name: 'Профилактические мероприятия в ЧС'
  }, {
    shifr: 1851,
    name: 'Процесс сквозного автоматизированного проектирования одежды из различных материалов'
  }, {
    shifr: 1852,
    name: 'Процессорные измерительные системы'
  }, {
    shifr: 1853,
    name: 'Процессы и аппараты пищевых производств'
  }, {
    shifr: 1854,
    name: 'Процессы и операции формообразования'
  }, {
    shifr: 1855,
    name: 'Процессы микро- и нанотехнологии'
  }, {
    shifr: 1856,
    name: 'Процессы получения композиционных и порошковых материалов'
  }, {
    shifr: 1857,
    name: 'Прочность и надежность узлов и деталей станка'
  }, {
    shifr: 1858,
    name: 'Прямые методы в математической физике'
  }, {
    shifr: 1859,
    name: 'Психогигиена'
  }, {
    shifr: 1860,
    name: 'Психодиагностика'
  }, {
    shifr: 1861,
    name: 'Психологическая коррекция'
  }, {
    shifr: 1862,
    name: 'Психологическая подготовка сотрудников ГПС'
  }, {
    shifr: 1863,
    name: 'Психологическая работы с детьми и подростками'
  }, {
    shifr: 1864,
    name: 'Психологические основы конфликтологии'
  }, {
    shifr: 1865,
    name: 'Психологические основы работы с персоналом и проблемы профотбора'
  }, {
    shifr: 1866,
    name: 'Психологические основы управления'
  }, {
    shifr: 1867,
    name: 'Психологические основы управления персоналом'
  }, {
    shifr: 1868,
    name: 'Психологические основы управления социальными и коммерческими учреждениями и их персоналом'
  }, {
    shifr: 1869,
    name: 'Психологические особенности региональной конфликтологии'
  }, {
    shifr: 1870,
    name: 'Психологические проблемы виктимологии'
  }, {
    shifr: 1871,
    name: 'Психологическое консультирование'
  }, {
    shifr: 1872,
    name: 'Психология'
  }, {
    shifr: 1873,
    name: 'Психология высшей школы'
  }, {
    shifr: 1874,
    name: 'Психология девиантного поведения'
  }, {
    shifr: 1875,
    name: 'Психология делового общения'
  }, {
    shifr: 1876,
    name: 'Психология журналистики'
  }, {
    shifr: 1877,
    name: 'Психология зависимого поведения'
  }, {
    shifr: 1878,
    name: 'Психология здоровья'
  }, {
    shifr: 1879,
    name: 'Психология здоровья и стресса'
  }, {
    shifr: 1880,
    name: 'Психология и конфликтология духовной сферы'
  }, {
    shifr: 1881,
    name: 'Психология и педагогика'
  }, {
    shifr: 1882,
    name: 'Психология и социология конфликта'
  }, {
    shifr: 1883,
    name: 'Психология и социология молодежи'
  }, {
    shifr: 1884,
    name: 'Психология конфессиональных конфликтов'
  }, {
    shifr: 1885,
    name: 'Психология конфликта'
  }, {
    shifr: 1886,
    name: 'Психология конфликтологии духовной сферы и образования'
  }, {
    shifr: 1887,
    name: 'Психология личности и группы'
  }, {
    shifr: 1888,
    name: 'Психология общения и предупреждение конфликтов в коммуникационном процессе'
  }, {
    shifr: 1889,
    name: 'Психология одаренности и социально-педагогические технологии работы с талантливой молодежью'
  }, {
    shifr: 1890,
    name: 'Психология политических и международных конфликтов'
  }, {
    shifr: 1891,
    name: 'Психология работы с детьми, подростками и молодежью'
  }, {
    shifr: 1892,
    name: 'Психология развития и возрастная психология'
  }, {
    shifr: 1893,
    name: 'Психология семейной конфликтологии'
  }, {
    shifr: 1894,
    name: 'Психология социализации личности'
  }, {
    shifr: 1895,
    name: 'Психология социальной работы'
  }, {
    shifr: 1896,
    name: 'Психология труда, инженерная психология и эргономика'
  }, {
    shifr: 1897,
    name: 'Психология управления и экономических конфликтов'
  }, {
    shifr: 1898,
    name: 'Психология экстремальных ситуаций'
  }, {
    shifr: 1899,
    name: 'Психолого-педагогические основы работы с молодежью'
  }, {
    shifr: 1900,
    name: 'Психосоциальные основы работы с молодежью'
  }, {
    shifr: 1901,
    name: 'Психосоциальные основы социальных коммуникаций'
  }, {
    shifr: 1902,
    name: 'Психотехнологии в социальной работе в экстремальных и кризисных ситуациях'
  }, {
    shifr: 1903,
    name: 'Психофизиология и нейрофизиология'
  }, {
    shifr: 1904,
    name: 'Психофизиология сознания'
  }, {
    shifr: 1905,
    name: 'Пути и путевое хозяйство промышленных предприятий'
  }, {
    shifr: 1906,
    name: 'Пути сообщения, технологические сооружения'
  }, {
    shifr: 1907,
    name: 'Работа двигателей на альтернативных топливах'
  }, {
    shifr: 1908,
    name: 'Работа с детьми и молодежью, оказавшихся в трудной жизненной ситуации'
  }, {
    shifr: 1909,
    name: 'Работа с одаренной молодежью'
  }, {
    shifr: 1910,
    name: 'Рабочие процессы и характеристики аппаратуры объемных гидроприводов'
  }, {
    shifr: 1911,
    name: 'Радиационная экология'
  }, {
    shifr: 1912,
    name: 'Радиационная, химическая и биологическая безопасность'
  }, {
    shifr: 1913,
    name: 'Радиожурналистика'
  }, {
    shifr: 1914,
    name: 'Радиоэлектронные компоненты и материалы'
  }, {
    shifr: 1915,
    name: 'Развитие и современное состояние мировой автомобилизации'
  }, {
    shifr: 1916,
    name: 'Развитие систем страхования и страхового рынка'
  }, {
    shifr: 1917,
    name: 'Разработка и анализ требований к ПО'
  }, {
    shifr: 1918,
    name: 'Разработка приложений для мобильных устройств'
  }, {
    shifr: 1919,
    name: 'Разработка систем автоматизации технологических процессов и производств на базе современных контроллеров'
  }, {
    shifr: 1920,
    name: 'Распоряжение правами интеллектуальной собственности'
  }, {
    shifr: 1921,
    name: 'Распределительные системы управления электромеханическими комплексами'
  }, {
    shifr: 1922,
    name: 'Расследование пожаров'
  }, {
    shifr: 1923,
    name: 'Расчет и конструирование машин пищевой промышленности'
  }, {
    shifr: 1924,
    name: 'Расчет и конструирование оборудования электронной промышленности'
  }, {
    shifr: 1925,
    name: 'Расчет и конструирование станков'
  }, {
    shifr: 1926,
    name: 'Расчет и проектирование систем обеспечения безопасности'
  }, {
    shifr: 1927,
    name: 'Расчет и рабочие процессы автомобилей'
  }, {
    shifr: 1928,
    name: 'Расчет моделирования и конструирования оборудования с компьютерным управлением'
  }, {
    shifr: 1929,
    name: 'Реабилитационная психология'
  }, {
    shifr: 1930,
    name: 'Региональная экономика'
  }, {
    shifr: 1931,
    name: 'Региональные подсистемы международных отношений в XXI веке'
  }, {
    shifr: 1932,
    name: 'Региональные политические процессы'
  }, {
    shifr: 1933,
    name: 'Региональный язык в профессиональном общении'
  }, {
    shifr: 1934,
    name: 'Регионоведение'
  }, {
    shifr: 1935,
    name: 'Регламентирование в спортивной индустрии'
  }, {
    shifr: 1936,
    name: 'Редактирование газетно-журнальных изданий'
  }, {
    shifr: 1937,
    name: 'Редактирование детской литературы'
  }, {
    shifr: 1938,
    name: 'Редактирование интернет-изданий'
  }, {
    shifr: 1939,
    name: 'Редактирование книжных изданий'
  }, {
    shifr: 1940,
    name: 'Редактирование на радио и телевидении'
  }, {
    shifr: 1941,
    name: 'Редактирование переводов'
  }, {
    shifr: 1942,
    name: 'Редактирование разных видов литературы (учебная, научная, справочная, художественная, переводы)'
  }, {
    shifr: 1943,
    name: 'Редактирование рекламных изданий'
  }, {
    shifr: 1944,
    name: 'Редактирование справочной литературы'
  }, {
    shifr: 1945,
    name: 'Редактирование учебной и научной литературы'
  }, {
    shifr: 1946,
    name: 'Редактирование художественной литературы'
  }, {
    shifr: 1947,
    name: 'Редакторская работа с иноязычными текстами'
  }, {
    shifr: 1948,
    name: 'Редакторская работа с иноязычными текстами СМИ'
  }, {
    shifr: 1949,
    name: 'Редакционно-издательский процесс'
  }, {
    shifr: 1950,
    name: 'Реинжиниринг организации технологических процессов швейных изделий'
  }, {
    shifr: 1951,
    name: 'Реклама в отрасли'
  }, {
    shifr: 1952,
    name: 'Реклама и связи с общественностью'
  }, {
    shifr: 1953,
    name: 'Рекламный менеджмент'
  }, {
    shifr: 1954,
    name: 'Рекреационные комплексы мира'
  }, {
    shifr: 1955,
    name: 'Рекреационные ресурсы и курортное дело'
  }, {
    shifr: 1956,
    name: 'Рекреология'
  }, {
    shifr: 1957,
    name: 'Религиоведение'
  }, {
    shifr: 1958,
    name: 'Религиоведение в системе гуманитарного образования и Русского мира'
  }, {
    shifr: 1959,
    name: 'Религиозно-философская антропология'
  }, {
    shifr: 1960,
    name: 'Религия и политика'
  }, {
    shifr: 1961,
    name: 'Ремонт и утилизация автотранспортных средств'
  }, {
    shifr: 1962,
    name: 'Реструктуризация и развитие предприятия'
  }, {
    shifr: 1963,
    name: 'Ресурсо- и энергосберегающие электрические машины'
  }, {
    shifr: 1964,
    name: 'Ресурсо- и энергосбережение в литейном производстве'
  }, {
    shifr: 1965,
    name: 'Ресурсосберегающие технологии на автомобильном транспорте'
  }, {
    shifr: 1966,
    name: 'Ресурсосбережение при проведении технического обслуживания и ремонта автомобилей'
  }, {
    shifr: 1967,
    name: 'Ресурсы мировой экономики'
  }, {
    shifr: 1968,
    name: 'Референтская деятельность'
  }, {
    shifr: 1969,
    name: 'Римское право'
  }, {
    shifr: 1970,
    name: 'Риски в инновационной деятельности'
  }, {
    shifr: 1971,
    name: 'Риск-менеджмент'
  }, {
    shifr: 1972,
    name: 'Рисунок'
  }, {
    shifr: 1973,
    name: 'Риторика'
  }, {
    shifr: 1974,
    name: 'Робототехнические технологические комплексы'
  }, {
    shifr: 1975,
    name: 'Роль транспорта в современном обществе'
  }, {
    shifr: 1976,
    name: 'Российская политическая идентичность в системе координат восточноевропейского политического пространства'
  }, {
    shifr: 1977,
    name: 'Россия в глобальной политике'
  }, {
    shifr: 1978,
    name: 'Русская литература в зеркале общественно-философской мысли'
  }, {
    shifr: 1979,
    name: 'Русский язык и культура речи'
  }, {
    shifr: 1980,
    name: 'Рынок транспортных услуг и качество транспортного обслуживания'
  }, {
    shifr: 1981,
    name: 'Рынок труда и проблемы занятости молодежи'
  }, {
    shifr: 1982,
    name: 'Рынок труда, технология поиска работы'
  }, {
    shifr: 1983,
    name: 'САПР в метрологии'
  }, {
    shifr: 1984,
    name: 'САПР и дизайн оборудования отрасли'
  }, {
    shifr: 1985,
    name: 'САПР одежды'
  }, {
    shifr: 1986,
    name: 'САПР технологических процессов'
  }, {
    shifr: 1987,
    name: 'САПР электронных схем'
  }, {
    shifr: 1988,
    name: 'Свариваемость конструкционных материалов'
  }, {
    shifr: 1989,
    name: 'Сварка спецсталей'
  }, {
    shifr: 1990,
    name: 'Свободные экономические зоны и оффшорные зоны'
  }, {
    shifr: 1991,
    name: 'Связи с общественностью'
  }, {
    shifr: 1992,
    name: 'Связи с общественностью в политике'
  }, {
    shifr: 1993,
    name: 'Священные тексты религий мира'
  }, {
    shifr: 1994,
    name: 'Сегментация рынка и позиционирование товара'
  }, {
    shifr: 1995,
    name: 'Семейная психотерапия и консультирование в кросскультурном контексте'
  }, {
    shifr: 1996,
    name: 'Семейное право'
  }, {
    shifr: 1997,
    name: 'Сервис в околотаможенной сфере'
  }, {
    shifr: 1998,
    name: 'Сервис в системах транспортного обслуживания'
  }, {
    shifr: 1999,
    name: 'Сервис и фирменное обслуживание автотранспортных средств'
  }, {
    shifr: 2000,
    name: 'Сервис на промышленном транспорте'
  }, {
    shifr: 2001,
    name: 'Сервис на транспорте'
  }, {
    shifr: 2002,
    name: 'Сервисная деятельность'
  }, {
    shifr: 2003,
    name: 'Сертификация'
  }, {
    shifr: 2004,
    name: 'Сертификация продукции легкой промышленности'
  }, {
    shifr: 2005,
    name: 'Сети и телекоммуникации'
  }, {
    shifr: 2006,
    name: 'Силовая электроника в электроэнергетике'
  }, {
    shifr: 2007,
    name: 'Силовые агрегаты'
  }, {
    shifr: 2008,
    name: 'Силовые цепи устройство в энергетической электронике'
  }, {
    shifr: 2009,
    name: 'Синергетика и теория самоорганизации'
  }, {
    shifr: 2010,
    name: 'Синтаксис'
  }, {
    shifr: 2011,
    name: 'Система автоматизированного проектирования станков'
  }, {
    shifr: 2012,
    name: 'Система качества перерабатывающих и пищевых производств'
  }, {
    shifr: 2013,
    name: 'Система международных стандартов финансовой отчетности'
  }, {
    shifr: 2014,
    name: 'Система регулирования ВТО'
  }, {
    shifr: 2015,
    name: 'Система связи и оповещения'
  }, {
    shifr: 2016,
    name: 'Система технологий отрасли'
  }, {
    shifr: 2017,
    name: 'Системно-динамическое моделирование'
  }, {
    shifr: 2018,
    name: 'Системное и прикладное программное обеспечение'
  }, {
    shifr: 2019,
    name: 'Системное программирование'
  }, {
    shifr: 2020,
    name: 'Системное программное обеспечение'
  }, {
    shifr: 2021,
    name: 'Системный анализ'
  }, {
    shifr: 2022,
    name: 'Системный анализ в таможенном деле'
  }, {
    shifr: 2023,
    name: 'Системный анализ технологических объектов'
  }, {
    shifr: 2024,
    name: 'Системы автоматизированного проектирования'
  }, {
    shifr: 2025,
    name: 'Системы автоматизированного проектирования ДВС'
  }, {
    shifr: 2026,
    name: 'Системы автоматизированного проектирования на автотранспорте'
  }, {
    shifr: 2027,
    name: 'Системы автоматизированного проектирования подвижного состава железных дорог'
  }, {
    shifr: 2028,
    name: 'Системы автоматизированного проектирования подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 2029,
    name: 'Системы автоматизированного проектирования средств автоматизация'
  }, {
    shifr: 2030,
    name: 'Системы автоматизированного проектирования средств робототехники и мехатроники'
  }, {
    shifr: 2031,
    name: 'Системы ДВС'
  }, {
    shifr: 2032,
    name: 'Системы и сети хранения данных'
  }, {
    shifr: 2033,
    name: 'Системы искусственного интеллекта'
  }, {
    shifr: 2034,
    name: 'Системы искусственного интеллекта и нейрокомпьютеры'
  }, {
    shifr: 2035,
    name: 'Системы качества'
  }, {
    shifr: 2036,
    name: 'Системы менеджмента качества в локомотивном хозяйстве'
  }, {
    shifr: 2037,
    name: 'Системы мотивации и стимулирования трудовой деятельности'
  }, {
    shifr: 2038,
    name: 'Системы обработки данных'
  }, {
    shifr: 2039,
    name: 'Системы обработки изображений и распознавания образов'
  }, {
    shifr: 2040,
    name: 'Системы охлаждения локомотивов'
  }, {
    shifr: 2041,
    name: 'Системы приводов технологических и транспортных машин'
  }, {
    shifr: 2042,
    name: 'Системы программного управления станками'
  }, {
    shifr: 2043,
    name: 'Системы разработки и постановки продукции на производство'
  }, {
    shifr: 2044,
    name: 'Системы стандартизации и методы принятия решений'
  }, {
    shifr: 2045,
    name: 'Системы тестирования программных средств управления и диспетчеризации'
  }, {
    shifr: 2046,
    name: 'Системы технологий'
  }, {
    shifr: 2047,
    name: 'Системы топливоподачи и управления ДВС'
  }, {
    shifr: 2048,
    name: 'Системы управления литейным процессом'
  }, {
    shifr: 2049,
    name: 'Системы управления швейного производства'
  }, {
    shifr: 2050,
    name: 'Системы управления энергомашинами'
  }, {
    shifr: 2051,
    name: 'Системы числового программного управления'
  }, {
    shifr: 2052,
    name: 'Системы электронного документооборота'
  }, {
    shifr: 2053,
    name: 'Славянский язык (польский язык)'
  }, {
    shifr: 2054,
    name: 'Славянский язык (украинский язык)'
  }, {
    shifr: 2055,
    name: 'Служебное расследование транспортных происшествий'
  }, {
    shifr: 2056,
    name: 'Случайные процессы'
  }, {
    shifr: 2057,
    name: 'Совершенствование технологии работы направлений и системы организации вагонопотоков'
  }, {
    shifr: 2058,
    name: 'Современная внешнеторговая политика'
  }, {
    shifr: 2059,
    name: 'Современная зарубежная литература'
  }, {
    shifr: 2060,
    name: 'Современная зарубежная социология'
  }, {
    shifr: 2061,
    name: 'Современная зарубежная философия'
  }, {
    shifr: 2062,
    name: 'Современная история Европы и Америки'
  }, {
    shifr: 2063,
    name: 'Современная история России'
  }, {
    shifr: 2064,
    name: 'Современная полиграфия'
  }, {
    shifr: 2065,
    name: 'Современная политика и стратегия Ближнего и Среднего Востока'
  }, {
    shifr: 2066,
    name: 'Современная теория управления'
  }, {
    shifr: 2067,
    name: 'Современное жанроведение'
  }, {
    shifr: 2068,
    name: 'Современное издательское дело'
  }, {
    shifr: 2069,
    name: 'Современное медицинское оборудование'
  }, {
    shifr: 2070,
    name: 'Современное таможенно-тарифное регулирование'
  }, {
    shifr: 2071,
    name: 'Современные архивные системы'
  }, {
    shifr: 2072,
    name: 'Современные виброакустические методы контроля'
  }, {
    shifr: 2073,
    name: 'Современные и перспективные электронные системы автомобилей'
  }, {
    shifr: 2074,
    name: 'Современные информационные системы'
  }, {
    shifr: 2075,
    name: 'Современные информационные технологии'
  }, {
    shifr: 2076,
    name: 'Современные информационные технологии в психологии'
  }, {
    shifr: 2077,
    name: 'Современные информационные технологии в социальной работе'
  }, {
    shifr: 2078,
    name: 'Современные информационные технологии в социальных науках'
  }, {
    shifr: 2079,
    name: 'Современные информационные технологии в электроэнергетике'
  }, {
    shifr: 2080,
    name: 'Современные концепции информационного общества'
  }, {
    shifr: 2081,
    name: 'Современные математические методы в науке и технике'
  }, {
    shifr: 2082,
    name: 'Современные международные отношения'
  }, {
    shifr: 2083,
    name: 'Современные методики управления персоналом'
  }, {
    shifr: 2084,
    name: 'Современные методы автоматизированного проектирования'
  }, {
    shifr: 2085,
    name: 'Современные методы анализа и исследования структуры и свойств материалов'
  }, {
    shifr: 2086,
    name: 'Современные методы анализа и контроля компонентов окружающей среды'
  }, {
    shifr: 2087,
    name: 'Современные методы вычислительной математики в решении задач мехатроники и робототехники'
  }, {
    shifr: 2088,
    name: 'Современные методы и средства исследования материалов для изготовления производственной одежды'
  }, {
    shifr: 2089,
    name: 'Современные методы мониторинга опасных и вредных производственных факторов'
  }, {
    shifr: 2090,
    name: 'Современные методы обеспечения устойчивости зданий и сооружений в условиях пожара'
  }, {
    shifr: 2091,
    name: 'Современные методы социологических исследований'
  }, {
    shifr: 2092,
    name: 'Современные научные и прикладные задачи электроэнергетики'
  }, {
    shifr: 2093,
    name: 'Современные облачные хранилища данных'
  }, {
    shifr: 2094,
    name: 'Современные образовательные системы'
  }, {
    shifr: 2095,
    name: 'Современные парадигмы программирования'
  }, {
    shifr: 2096,
    name: 'Современные партии и движения'
  }, {
    shifr: 2097,
    name: 'Современные педагогические технологии воспитания в профессиональном образовании'
  }, {
    shifr: 2098,
    name: 'Современные проблемы автоматизации и управления технологическими процессами'
  }, {
    shifr: 2099,
    name: 'Современные проблемы астрономии'
  }, {
    shifr: 2100,
    name: 'Современные проблемы АФК'
  }, {
    shifr: 2101,
    name: 'Современные проблемы занятости'
  }, {
    shifr: 2102,
    name: 'Современные проблемы и направления развития эксплуатации автотранспортных средств'
  }, {
    shifr: 2103,
    name: 'Современные проблемы инструментального обеспечения машиностроительных производств'
  }, {
    shifr: 2104,
    name: 'Современные проблемы информатики и вычислительной техники'
  }, {
    shifr: 2105,
    name: 'Современные проблемы науки и образования'
  }, {
    shifr: 2106,
    name: 'Современные проблемы науки и производства в электротехнике'
  }, {
    shifr: 2107,
    name: 'Современные проблемы науки и производства в электроэнергетике'
  }, {
    shifr: 2108,
    name: 'Современные проблемы науки и производства в энергетическом машиностроении'
  }, {
    shifr: 2109,
    name: 'Современные проблемы прикладной математики и информатики'
  }, {
    shifr: 2110,
    name: 'Современные проблемы профессионального образования'
  }, {
    shifr: 2111,
    name: 'Современные проблемы реконструкций станций и узлов'
  }, {
    shifr: 2112,
    name: 'Современные проблемы транспортной науки, техники и технологии'
  }, {
    shifr: 2113,
    name: 'Современные проблемы физики'
  }, {
    shifr: 2114,
    name: 'Современные проблемы экологии и природопользования'
  }, {
    shifr: 2115,
    name: 'Современные русский язык: фонетика и фонология'
  }, {
    shifr: 2116,
    name: 'Современные сетевые и телекоммуникационные технологии'
  }, {
    shifr: 2117,
    name: 'Современные социологические теории'
  }, {
    shifr: 2118,
    name: 'Современные тенденции развития обработки резанием'
  }, {
    shifr: 2119,
    name: 'Современные теории социального благополучия'
  }, {
    shifr: 2120,
    name: 'Современные технологии нанесения износостойких покрытий на режущие инструментальные материалы'
  }, {
    shifr: 2121,
    name: 'Современные технологии обеспечения безопасности в транспортном процессе'
  }, {
    shifr: 2122,
    name: 'Современные технологии обеспечения работоспособности режущего инструмента'
  }, {
    shifr: 2123,
    name: 'Современные технологии обеспечения сохранности, реставрации и консервации документов'
  }, {
    shifr: 2124,
    name: 'Современные технологии параллельного программирования'
  }, {
    shifr: 2125,
    name: 'Современные технологии сопровождения молодежи на этапе построения карьеры.'
  }, {
    shifr: 2126,
    name: 'Современные технологии управления образовательными организациями'
  }, {
    shifr: 2127,
    name: 'Современные технологии управления персоналом'
  }, {
    shifr: 2128,
    name: 'Современные учетно-аналитические технологии'
  }, {
    shifr: 2129,
    name: 'Современные финансовые технологии'
  }, {
    shifr: 2130,
    name: 'Современные формы интеграционных процессов'
  }, {
    shifr: 2131,
    name: 'Современные численные методы и прикладные вычисления на ЭВМ'
  }, {
    shifr: 2132,
    name: 'Современные энергетические технологии'
  }, {
    shifr: 2133,
    name: 'Современный банкинг'
  }, {
    shifr: 2134,
    name: 'Современный медиатекст'
  }, {
    shifr: 2135,
    name: 'Современный русский язык в медиакоммуникациях'
  }, {
    shifr: 2136,
    name: 'Современный русский язык: лексикология и фразеология'
  }, {
    shifr: 2137,
    name: 'Современный русский язык: словообразование, морфология'
  }, {
    shifr: 2138,
    name: 'Современный стратегический анализ'
  }, {
    shifr: 2139,
    name: 'Сопоставительное языкознание (близкородственные языки)'
  }, {
    shifr: 2140,
    name: 'Сопротивление материалов'
  }, {
    shifr: 2141,
    name: 'Социальная антропология'
  }, {
    shifr: 2142,
    name: 'Социальная безопасность молодежи'
  }, {
    shifr: 2143,
    name: 'Социальная демография'
  }, {
    shifr: 2144,
    name: 'Социальная журналистика'
  }, {
    shifr: 2145,
    name: 'Социальная защита населения'
  }, {
    shifr: 2146,
    name: 'Социальная информатика'
  }, {
    shifr: 2147,
    name: 'Социальная история России'
  }, {
    shifr: 2148,
    name: 'Социальная квалиметрия, оценка качества и стандартизация социальных услуг'
  }, {
    shifr: 2149,
    name: 'Социальная концепция РПЦ'
  }, {
    shifr: 2150,
    name: 'Социальная культура'
  }, {
    shifr: 2151,
    name: 'Социальная ответственность'
  }, {
    shifr: 2152,
    name: 'Социальная педагогика'
  }, {
    shifr: 2153,
    name: 'Социальная профилактика девиантного поведения'
  }, {
    shifr: 2154,
    name: 'Социальная профилактика девиантного поведения и основы работы с молодыми преступниками'
  }, {
    shifr: 2155,
    name: 'Социальная психология'
  }, {
    shifr: 2156,
    name: 'Социальная работа в условиях глобализации'
  }, {
    shifr: 2157,
    name: 'Социальная работа за рубежом'
  }, {
    shifr: 2158,
    name: 'Социальная работа на предприятии'
  }, {
    shifr: 2159,
    name: 'Социальная работа с молодежью'
  }, {
    shifr: 2160,
    name: 'Социальная работа: маркетинговый подход'
  }, {
    shifr: 2161,
    name: 'Социальная реабилитация'
  }, {
    shifr: 2162,
    name: 'Социальная реклама и PR в работе с молодежью'
  }, {
    shifr: 2163,
    name: 'Социальная философия'
  }, {
    shifr: 2164,
    name: 'Социальная экология'
  }, {
    shifr: 2165,
    name: 'Социально-аналитические аспекты демографии'
  }, {
    shifr: 2166,
    name: 'Социальное моделирование, проектирование, программирование и прогнозирование'
  }, {
    shifr: 2167,
    name: 'Социальное партнерство и медиация'
  }, {
    shifr: 2168,
    name: 'Социальное партнерство и межсекторное взаимодействие в системе социальной защиты населения'
  }, {
    shifr: 2169,
    name: 'Социальное проектирование и управление социальными проектами'
  }, {
    shifr: 2170,
    name: 'Социально-ориентированные программы в регионе'
  }, {
    shifr: 2171,
    name: 'Социально-психологические технологии управления персоналом'
  }, {
    shifr: 2172,
    name: 'Социально-психологический тренинг и коучинг в работе с молодежью'
  }, {
    shifr: 2173,
    name: 'Социально-технологическая культура персонала социального учреждения'
  }, {
    shifr: 2174,
    name: 'Социальные проблемы современной мировой экономики'
  }, {
    shifr: 2175,
    name: 'Социальные технологии работы с молодежью'
  }, {
    shifr: 2176,
    name: 'Социальные учреждения и управление в них'
  }, {
    shifr: 2177,
    name: 'Социальный и психолого-педагогический тренинг в социальной работе'
  }, {
    shifr: 2178,
    name: 'Социальный контроль, социальная экспертиза и квалитология в социальной работе'
  }, {
    shifr: 2179,
    name: 'Социальный менеджмент'
  }, {
    shifr: 2180,
    name: 'Социокультурные проблемы вариативности языка в аспекте перевода'
  }, {
    shifr: 2181,
    name: 'Социолингвистика'
  }, {
    shifr: 2182,
    name: 'Социологические и психологические модели конфликтов и методы их разрешения'
  }, {
    shifr: 2183,
    name: 'Социологические концепции управления организационным развитием и государственная служба'
  }, {
    shifr: 2184,
    name: 'Социологический анализ социальных сетей'
  }, {
    shifr: 2185,
    name: 'Социологическое исследование рынков'
  }, {
    shifr: 2186,
    name: 'Социологическое обеспечение связей с общественностью'
  }, {
    shifr: 2187,
    name: 'Социологическое сопровождение политических процессов и проектной деятельности'
  }, {
    shifr: 2188,
    name: 'Социология'
  }, {
    shifr: 2189,
    name: 'Социология глобальных процессов'
  }, {
    shifr: 2190,
    name: 'Социология города'
  }, {
    shifr: 2191,
    name: 'Социология журналистики'
  }, {
    shifr: 2192,
    name: 'Социология здоровья'
  }, {
    shifr: 2193,
    name: 'Социология коммуникаций'
  }, {
    shifr: 2194,
    name: 'Социология коммуникаций и общественного мнения'
  }, {
    shifr: 2195,
    name: 'Социология культуры'
  }, {
    shifr: 2196,
    name: 'Социология личности'
  }, {
    shifr: 2197,
    name: 'Социология массовых коммуникаций'
  }, {
    shifr: 2198,
    name: 'Социология международных отношений'
  }, {
    shifr: 2199,
    name: 'Социология молодежи'
  }, {
    shifr: 2200,
    name: 'Социология образования'
  }, {
    shifr: 2201,
    name: 'Социология общественного мнения'
  }, {
    shifr: 2202,
    name: 'Социология потребительского поведения'
  }, {
    shifr: 2203,
    name: 'Социология права'
  }, {
    shifr: 2204,
    name: 'Социология пространства и социальная стратификация'
  }, {
    shifr: 2205,
    name: 'Социология рекламы'
  }, {
    shifr: 2206,
    name: 'Социология религии'
  }, {
    shifr: 2207,
    name: 'Социология семьи'
  }, {
    shifr: 2208,
    name: 'Социология семьи и молодежи'
  }, {
    shifr: 2209,
    name: 'Социология труда'
  }, {
    shifr: 2210,
    name: 'Социология управления'
  }, {
    shifr: 2211,
    name: 'Социология языка и литературы'
  }, {
    shifr: 2212,
    name: 'Спасательная техника и базовые машины'
  }, {
    shifr: 2213,
    name: 'Спецглавы конструирования и САПР в энергомашиностроении'
  }, {
    shifr: 2214,
    name: 'Спецглавы физики'
  }, {
    shifr: 2215,
    name: 'Специальная педагогика и психология'
  }, {
    shifr: 2216,
    name: 'Специальная подготовка'
  }, {
    shifr: 2217,
    name: 'Специальная пожарная и аварийно-спасательная техника'
  }, {
    shifr: 2218,
    name: 'Специальная психология и психиатрия'
  }, {
    shifr: 2219,
    name: 'Специальные виды двигателей'
  }, {
    shifr: 2220,
    name: 'Специальные виды литья'
  }, {
    shifr: 2221,
    name: 'Специальные виды промышленного транспорта'
  }, {
    shifr: 2222,
    name: 'Специальные главы математики'
  }, {
    shifr: 2223,
    name: 'Специальные краны'
  }, {
    shifr: 2224,
    name: 'Специальные программы САПР'
  }, {
    shifr: 2225,
    name: 'Специальные разделы математики'
  }, {
    shifr: 2226,
    name: 'Специальные разделы физики (физика электронных и полупроводниковых приборов)'
  }, {
    shifr: 2227,
    name: 'Специальные разделы химии (химические основы технологии электронных средств)'
  }, {
    shifr: 2228,
    name: 'Специальные электрические аппараты'
  }, {
    shifr: 2229,
    name: 'Специальные электрические машины'
  }, {
    shifr: 2230,
    name: 'Спортивная медицина'
  }, {
    shifr: 2231,
    name: 'Спортивное предпринимательство'
  }, {
    shifr: 2232,
    name: 'Спортивный клубный менеджмент'
  }, {
    shifr: 2233,
    name: 'Способы конкурентной борьбы'
  }, {
    shifr: 2234,
    name: 'Спутниковые системы связи'
  }, {
    shifr: 2235,
    name: 'Сравнительная история конфессий'
  }, {
    shifr: 2236,
    name: 'Сравнительная политология'
  }, {
    shifr: 2237,
    name: 'Сравнительная типология'
  }, {
    shifr: 2238,
    name: 'Сравнительное правоведение'
  }, {
    shifr: 2239,
    name: 'Средства автоматизации и управления технологическими процессами и производствами'
  }, {
    shifr: 2240,
    name: 'Средства и методы технологии обработки на станках с ЧПУ'
  }, {
    shifr: 2241,
    name: 'Средства механизации и автоматизации технологических процессов в машиностроении'
  }, {
    shifr: 2242,
    name: 'Средства научной визуализации'
  }, {
    shifr: 2243,
    name: 'Средства разработки динамических графических объектов интернет приложений'
  }, {
    shifr: 2244,
    name: 'Стандартизация'
  }, {
    shifr: 2245,
    name: 'Стандартизация документационного обеспечения архивного дела'
  }, {
    shifr: 2246,
    name: 'Стандартизация документационного обеспечения управления'
  }, {
    shifr: 2247,
    name: 'Стандартизация документационного обеспечения управления органов государственной власти'
  }, {
    shifr: 2248,
    name: 'Стандартизация и контроль качества гостиничных услуг'
  }, {
    shifr: 2249,
    name: 'Стандартизация и сертификация в туристской индустрии'
  }, {
    shifr: 2250,
    name: 'Стандартизация метрологической деятельности'
  }, {
    shifr: 2251,
    name: 'Стандартизация программного обеспечения'
  }, {
    shifr: 2252,
    name: 'Станции, узлы и транспортные коридоры'
  }, {
    shifr: 2253,
    name: 'Старославянский язык'
  }, {
    shifr: 2254,
    name: 'Статистика'
  }, {
    shifr: 2255,
    name: 'Статистика в туристской индустрии'
  }, {
    shifr: 2256,
    name: 'Статистические методы контроля и управления качеством'
  }, {
    shifr: 2257,
    name: 'Стереологические принципы обработки результатов структурных исследований'
  }, {
    shifr: 2258,
    name: 'Стереологический анализ'
  }, {
    shifr: 2259,
    name: 'Стилистика'
  }, {
    shifr: 2260,
    name: 'Стилистика и культура речи в СМИ и ИБД'
  }, {
    shifr: 2261,
    name: 'Страновая конкурентоспособность'
  }, {
    shifr: 2262,
    name: 'Страноведение'
  }, {
    shifr: 2263,
    name: 'Стратегии развития предприятий индустрии гостеприимства'
  }, {
    shifr: 2264,
    name: 'Стратегический и инновационный менеджмент'
  }, {
    shifr: 2265,
    name: 'Стратегический и инновационный менеджмент и сервис при организации перевозок'
  }, {
    shifr: 2266,
    name: 'Стратегический маркетинг'
  }, {
    shifr: 2267,
    name: 'Стратегический маркетинг таможенных услуг'
  }, {
    shifr: 2268,
    name: 'Стратегический менеджмент'
  }, {
    shifr: 2269,
    name: 'Стратегическое управление в тур индустрии'
  }, {
    shifr: 2270,
    name: 'Стратегическое управление в туристской индустрии'
  }, {
    shifr: 2271,
    name: 'Стратегическое управление предприятием'
  }, {
    shifr: 2272,
    name: 'Стратегия кадрового обеспечения государственной службы'
  }, {
    shifr: 2273,
    name: 'Стратегия предпринимательской деятельности'
  }, {
    shifr: 2274,
    name: 'Стратегия предприятия'
  }, {
    shifr: 2275,
    name: 'Страхование'
  }, {
    shifr: 2276,
    name: 'Страхование в отрасли'
  }, {
    shifr: 2277,
    name: 'Страхование в туристской индустрии'
  }, {
    shifr: 2278,
    name: 'Страховая деятельность на транспорте'
  }, {
    shifr: 2279,
    name: 'Строительная механика и металлоконструкции подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 2280,
    name: 'Строительные машины'
  }, {
    shifr: 2281,
    name: 'Струйные машины и аппараты'
  }, {
    shifr: 2282,
    name: 'Структура, свойства и обработка материалов'
  }, {
    shifr: 2283,
    name: 'Структуры и алгоритмы компьютерной обработки данных'
  }, {
    shifr: 2284,
    name: 'Структуры и алгоритмы обработки данных'
  }, {
    shifr: 2285,
    name: 'Судебная медицина и судебная психиатрия'
  }, {
    shifr: 2286,
    name: 'Судебная риторика'
  }, {
    shifr: 2287,
    name: 'Судебная экспертиза'
  }, {
    shifr: 2288,
    name: 'Судебно-бухгалтерская экспертиза'
  }, {
    shifr: 2289,
    name: 'Судебные и правоохранительные органы'
  }, {
    shifr: 2290,
    name: 'Схемотехника'
  }, {
    shifr: 2291,
    name: 'Схемотехника приборов'
  }, {
    shifr: 2292,
    name: 'Схемотехника узлов автоматики'
  }, {
    shifr: 2293,
    name: 'Тайм-менеджмент и управление деловой карьерой'
  }, {
    shifr: 2294,
    name: 'Тактика сил МЧС'
  }, {
    shifr: 2295,
    name: 'Таможенная безопасность'
  }, {
    shifr: 2296,
    name: 'Таможенная и брокерская деятельность'
  }, {
    shifr: 2297,
    name: 'Таможенная логистика'
  }, {
    shifr: 2298,
    name: 'Таможенное администрирование'
  }, {
    shifr: 2299,
    name: 'Таможенное декларирование и таможенный контроль'
  }, {
    shifr: 2300,
    name: 'Таможенное дело'
  }, {
    shifr: 2301,
    name: 'Таможенное право'
  }, {
    shifr: 2302,
    name: 'Таможенные платежи'
  }, {
    shifr: 2303,
    name: 'Таможенные услуги в международной цепи поставок товаров'
  }, {
    shifr: 2304,
    name: 'Таможенный контроль'
  }, {
    shifr: 2305,
    name: 'Таможенный менеджмент'
  }, {
    shifr: 2306,
    name: 'Текст. Стиль. Дискурс'
  }, {
    shifr: 2307,
    name: 'Текстология'
  }, {
    shifr: 2308,
    name: 'Тележурналистика'
  }, {
    shifr: 2309,
    name: 'Телекоммуникационные системы и распределенные вычисления'
  }, {
    shifr: 2310,
    name: 'Телекоммуникационные технологии интеллектуальных транспортных систем'
  }, {
    shifr: 2311,
    name: 'Телекоммуникационные технологии на автотранспорте'
  }, {
    shifr: 2312,
    name: 'Тенденции развития высшего образования в развитых странах мира'
  }, {
    shifr: 2313,
    name: 'Тенденция развития образовательных систем в современном мире'
  }, {
    shifr: 2314,
    name: 'Теневая экономика'
  }, {
    shifr: 2315,
    name: 'Теоретико-дисциплинарные подходы анализа конфликта'
  }, {
    shifr: 2316,
    name: 'Теоретико-правовые основы образования'
  }, {
    shifr: 2317,
    name: 'Теоретическая механика'
  }, {
    shifr: 2318,
    name: 'Теоретическая механика. Механика сплошных сред'
  }, {
    shifr: 2319,
    name: 'Теоретические основы измерительных и информационных технологий'
  }, {
    shifr: 2320,
    name: 'Теоретические основы исследования процессов обработки давлением'
  }, {
    shifr: 2321,
    name: 'Теоретические основы педагогического проектирования'
  }, {
    shifr: 2322,
    name: 'Теоретические основы построения и функционирования информационных систем в производстве изделий легкой промышленности'
  }, {
    shifr: 2323,
    name: 'Теоретические основы соединения разнородных и неметаллических материалов'
  }, {
    shifr: 2324,
    name: 'Теоретические основы технологии производства деталей и сборки машин'
  }, {
    shifr: 2325,
    name: 'Теоретические основы электротехники'
  }, {
    shifr: 2326,
    name: 'Теории (концепции) бухгалтерского учета'
  }, {
    shifr: 2327,
    name: 'Теории измерений социальных проблем молодежи'
  }, {
    shifr: 2328,
    name: 'Теории обучения движению лиц с патологиями'
  }, {
    shifr: 2329,
    name: 'Теория автоматического управления'
  }, {
    shifr: 2330,
    name: 'Теория автоматического управления и автоматика в электромеханике'
  }, {
    shifr: 2331,
    name: 'Теория автоматического управления и автоматика в электроэнергетике'
  }, {
    shifr: 2332,
    name: 'Теория автоматов, формальных языков и методов трансляции'
  }, {
    shifr: 2333,
    name: 'Теория алгоритмов'
  }, {
    shifr: 2334,
    name: 'Теория вероятностей и математическая статистика'
  }, {
    shifr: 2335,
    name: 'Теория вычислительных процессов и структур'
  }, {
    shifr: 2336,
    name: 'Теория горения и взрыва'
  }, {
    shifr: 2337,
    name: 'Теория государства и права'
  }, {
    shifr: 2338,
    name: 'Теория групп'
  }, {
    shifr: 2339,
    name: 'Теория денег и финансовых рынков'
  }, {
    shifr: 2340,
    name: 'Теория диффузионных процессов'
  }, {
    shifr: 2341,
    name: 'Теория и история дипломатии'
  }, {
    shifr: 2342,
    name: 'Теория и конструкция локомотивов'
  }, {
    shifr: 2343,
    name: 'Теория и методика воспитания личности в высшей школе'
  }, {
    shifr: 2344,
    name: 'Теория и методика воспитательной работы'
  }, {
    shifr: 2345,
    name: 'Теория и методика журналистского творчества'
  }, {
    shifr: 2346,
    name: 'Теория и методика личностно-ориентированного образования'
  }, {
    shifr: 2347,
    name: 'Теория и методика обучения базовым видам спорта'
  }, {
    shifr: 2348,
    name: 'Теория и методика опубликования исторических документов (Археография)'
  }, {
    shifr: 2349,
    name: 'Теория и методика физической культуры'
  }, {
    shifr: 2350,
    name: 'Теория и методология истории'
  }, {
    shifr: 2351,
    name: 'Теория и методы анализа внешней политики'
  }, {
    shifr: 2352,
    name: 'Теория и механизмы, правовое обеспечение государственного и муниципального управления'
  }, {
    shifr: 2353,
    name: 'Теория и организация адаптивной физической культуры'
  }, {
    shifr: 2354,
    name: 'Теория и организация государственной службы'
  }, {
    shifr: 2355,
    name: 'Теория и практика аргументации'
  }, {
    shifr: 2356,
    name: 'Теория и практика делового администрирования'
  }, {
    shifr: 2357,
    name: 'Теория и практика перевода (английский)'
  }, {
    shifr: 2358,
    name: 'Теория и практика перевода (второй иностранный)'
  }, {
    shifr: 2359,
    name: 'Теория и практика управления в социальной работе'
  }, {
    shifr: 2360,
    name: 'Теория и практика управления и развитие профессиогенеза сотрудников в социальной работе'
  }, {
    shifr: 2361,
    name: 'Теория и проектирование гидравлического следящего привода'
  }, {
    shifr: 2362,
    name: 'Теория и расчет измерительных систем'
  }, {
    shifr: 2363,
    name: 'Теория и риторика научного текста'
  }, {
    shifr: 2364,
    name: 'Теория и технологии получения порошковых материалов и изделий'
  }, {
    shifr: 2365,
    name: 'Теория и технология нанесения покрытий'
  }, {
    shifr: 2366,
    name: 'Теория и технология получения композиционных материалов'
  }, {
    shifr: 2367,
    name: 'Теория и технология термической и химико-термической обработки изделий'
  }, {
    shifr: 2368,
    name: 'Теория игр и ее приложения'
  }, {
    shifr: 2369,
    name: 'Теория инноваций'
  }, {
    shifr: 2370,
    name: 'Теория интерпретации'
  }, {
    shifr: 2371,
    name: 'Теория информации'
  }, {
    shifr: 2372,
    name: 'Теория информации и кодирования'
  }, {
    shifr: 2373,
    name: 'Теория информации и обеспечение информационной безопасности'
  }, {
    shifr: 2374,
    name: 'Теория информационных процессов и систем'
  }, {
    shifr: 2375,
    name: 'Теория кодирования информации'
  }, {
    shifr: 2376,
    name: 'Теория колебаний'
  }, {
    shifr: 2377,
    name: 'Теория литературы'
  }, {
    shifr: 2378,
    name: 'Теория массовой коммуникации'
  }, {
    shifr: 2379,
    name: 'Теория международных отношений'
  }, {
    shifr: 2380,
    name: 'Теория межкультурной коммуникации'
  }, {
    shifr: 2381,
    name: 'Теория металлургических процессов'
  }, {
    shifr: 2382,
    name: 'Теория механизмов и машин'
  }, {
    shifr: 2383,
    name: 'Теория нечетких множеств в управлении'
  }, {
    shifr: 2384,
    name: 'Теория обработки металлов давлением'
  }, {
    shifr: 2385,
    name: 'Теория оптимального планирования и обработки результатов эксперимента'
  }, {
    shifr: 2386,
    name: 'Теория оптимального управления'
  }, {
    shifr: 2387,
    name: 'Теория организации и организационное поведение'
  }, {
    shifr: 2388,
    name: 'Теория отраслевых рынков'
  }, {
    shifr: 2389,
    name: 'Теория перевода'
  }, {
    shifr: 2390,
    name: 'Теория получения, обработки и представления измерительной информации'
  }, {
    shifr: 2391,
    name: 'Теория поршневых двигателей'
  }, {
    shifr: 2392,
    name: 'Теория принятия решений'
  }, {
    shifr: 2393,
    name: 'Теория принятия решений в метрологии'
  }, {
    shifr: 2394,
    name: 'Теория принятия решений по тушению пожара'
  }, {
    shifr: 2395,
    name: 'Теория программирования'
  }, {
    shifr: 2396,
    name: 'Теория процессов сварки'
  }, {
    shifr: 2397,
    name: 'Теория рабочих процессов ДВС'
  }, {
    shifr: 2398,
    name: 'Теория риска и моделирование рисковых ситуаций'
  }, {
    shifr: 2399,
    name: 'Теория сигналов'
  }, {
    shifr: 2400,
    name: 'Теория систем'
  }, {
    shifr: 2401,
    name: 'Теория систем автоматического управления на подвижном составе'
  }, {
    shifr: 2402,
    name: 'Теория систем и системный анализ'
  }, {
    shifr: 2403,
    name: 'Теория случайных процессов в механике'
  }, {
    shifr: 2404,
    name: 'Теория современного документоведения и архивоведения'
  }, {
    shifr: 2405,
    name: 'Теория социальной работы'
  }, {
    shifr: 2406,
    name: 'Теория социальной работы с молодежью'
  }, {
    shifr: 2407,
    name: 'Теория строения материалов'
  }, {
    shifr: 2408,
    name: 'Теория текста в СМИ и ИБД'
  }, {
    shifr: 2409,
    name: 'Теория тепло- и массопереноса в материалах'
  }, {
    shifr: 2410,
    name: 'Теория транспортных потоков в приложении к интеллектуальным транспортным системам'
  }, {
    shifr: 2411,
    name: 'Теория транспортных потоков и моделирование движения'
  }, {
    shifr: 2412,
    name: 'Теория транспортных процессов и систем'
  }, {
    shifr: 2413,
    name: 'Теория транспортных процессов и специальные методы моделирования'
  }, {
    shifr: 2414,
    name: 'Теория управления электроэнергией и экономика энергосистем'
  }, {
    shifr: 2415,
    name: 'Теория формирования отливок'
  }, {
    shifr: 2416,
    name: 'Теория функций комплексного переменного'
  }, {
    shifr: 2417,
    name: 'Теория экономического анализа'
  }, {
    shifr: 2418,
    name: 'Теория эксперимента в исследованиях систем'
  }, {
    shifr: 2419,
    name: 'Теория эксплуатационных свойств автомобилей'
  }, {
    shifr: 2420,
    name: 'Теория электродуговой плазмы'
  }, {
    shifr: 2421,
    name: 'Теория электронных цепей'
  }, {
    shifr: 2422,
    name: 'Теория электропривода'
  }, {
    shifr: 2423,
    name: 'Теория языков программирования и методы трансляции'
  }, {
    shifr: 2424,
    name: 'Теория, расчет и проектирование измерительных преобразователей и приборов'
  }, {
    shifr: 2425,
    name: 'Тепловое и холодильное оборудование'
  }, {
    shifr: 2426,
    name: 'Тепловой метод неразрушающего контроля'
  }, {
    shifr: 2427,
    name: 'Тепломассообмен'
  }, {
    shifr: 2428,
    name: 'Теплотехника'
  }, {
    shifr: 2429,
    name: 'Теплофизические свойства жидкостей и газов'
  }, {
    shifr: 2430,
    name: 'Терапевтическая техника'
  }, {
    shifr: 2431,
    name: 'Терминально-логистические комплексы'
  }, {
    shifr: 2432,
    name: 'Термическая резка'
  }, {
    shifr: 2433,
    name: 'Термодинамика'
  }, {
    shifr: 2434,
    name: 'Термодинамика и теплопередача'
  }, {
    shifr: 2435,
    name: 'Термодинамика неравновесных процессов'
  }, {
    shifr: 2436,
    name: 'Термодинамика. Статистическая физика. Физическая кинетика'
  }, {
    shifr: 2437,
    name: 'Тестирование и отладка программного обеспечения'
  }, {
    shifr: 2438,
    name: 'Тестирование программного обеспечения'
  }, {
    shifr: 2439,
    name: 'Тестирование программных систем'
  }, {
    shifr: 2440,
    name: 'Техника высоких напряжений'
  }, {
    shifr: 2441,
    name: 'Техника оформления печатных СМИ (компьютерный дизайн)'
  }, {
    shifr: 2442,
    name: 'Техника оформления печатных СМИ (режиссура номера)'
  }, {
    shifr: 2443,
    name: 'Техника оформления прессы'
  }, {
    shifr: 2444,
    name: 'Техника транспорта и подвижной состав'
  }, {
    shifr: 2445,
    name: 'Техника транспорта, обслуживание и ремонт'
  }, {
    shifr: 2446,
    name: 'Технико-экономический анализ'
  }, {
    shifr: 2447,
    name: 'Техническая диагностика и надёжность систем электроснабжения'
  }, {
    shifr: 2448,
    name: 'Техническая диагностика и прогнозирование остаточного ресурса грузоподъемных кранов'
  }, {
    shifr: 2449,
    name: 'Техническая диагностика подвижного состава'
  }, {
    shifr: 2450,
    name: 'Техническая диагностика подъемно-транспортных строительных, дорожных машин'
  }, {
    shifr: 2451,
    name: 'Техническая диагностика электромеханических устройств и систем'
  }, {
    shifr: 2452,
    name: 'Техническая механика'
  }, {
    shifr: 2453,
    name: 'Техническая механика (Механика материалов)'
  }, {
    shifr: 2454,
    name: 'Техническая эксплуатация автомобилей, оборудованных компьютерами и встроенной диагностикой'
  }, {
    shifr: 2455,
    name: 'Техническая эксплуатация железнодорожного транспорта и безопасность движения'
  }, {
    shifr: 2456,
    name: 'Техническая эксплуатация транспорта и средства по обеспечению безопасности движения'
  }, {
    shifr: 2457,
    name: 'Технические способы реабилитации'
  }, {
    shifr: 2458,
    name: 'Технические средства автоматизации'
  }, {
    shifr: 2459,
    name: 'Технические средства автоматизации технологических процессов и производств'
  }, {
    shifr: 2460,
    name: 'Технические средства в управлении'
  }, {
    shifr: 2461,
    name: 'Технические средства и технологические методы обеспечения безопасности на транспорте'
  }, {
    shifr: 2462,
    name: 'Технические средства обеспечения безопасности на железнодорожном транспорте'
  }, {
    shifr: 2463,
    name: 'Технические средства обеспечения безопасности на железных дорогах'
  }, {
    shifr: 2464,
    name: 'Технические средства обеспечения безопасности на промышленном транспорте'
  }, {
    shifr: 2465,
    name: 'Технические средства обеспечения качества инструментальных систем'
  }, {
    shifr: 2466,
    name: 'Технические средства организации движения'
  }, {
    shifr: 2467,
    name: 'Технические устройства контроля техпроцессов в оборудовании электронной промышленности'
  }, {
    shifr: 2468,
    name: 'Технический контроль и метрологическое обеспечение производства'
  }, {
    shifr: 2469,
    name: 'Техническое обеспечение КШП'
  }, {
    shifr: 2470,
    name: 'Техногенные системы и экологический риск'
  }, {
    shifr: 2471,
    name: 'Технологии въездного и выездного туризма'
  }, {
    shifr: 2472,
    name: 'Технологии защиты информации'
  }, {
    shifr: 2473,
    name: 'Технологии и организация туроператорских и турагентских услуг'
  }, {
    shifr: 2474,
    name: 'Технологии информационного поиска в профессиональной деятельности'
  }, {
    shifr: 2475,
    name: 'Технологии компьютерного проектирования'
  }, {
    shifr: 2476,
    name: 'Технологии обработки информации'
  }, {
    shifr: 2477,
    name: 'Технологии обработки материалов концентрированными потоками энергии'
  }, {
    shifr: 2478,
    name: 'Технологии организации и управления безопасным движением тягового подвижного состава'
  }, {
    shifr: 2479,
    name: 'Технологии основных производств'
  }, {
    shifr: 2480,
    name: 'Технологии оценки человеческих ресурсов'
  }, {
    shifr: 2481,
    name: 'Технологии планирования и прогнозирования социально-экономического развития территорий'
  }, {
    shifr: 2482,
    name: 'Технологии политического медиаторства'
  }, {
    shifr: 2483,
    name: 'Технологии программирования'
  }, {
    shifr: 2484,
    name: 'Технологии продаж в туристской индустрии'
  }, {
    shifr: 2485,
    name: 'Технологии продвижения в гостиничном бизнесе'
  }, {
    shifr: 2486,
    name: 'Технологии промышленных производств'
  }, {
    shifr: 2487,
    name: 'Технологии психологической помощи молодежи в кризисных и экстремальных ситуациях'
  }, {
    shifr: 2488,
    name: 'Технологии работы с объединениями и организациями молодежи'
  }, {
    shifr: 2489,
    name: 'Технологии разработки баз данных'
  }, {
    shifr: 2490,
    name: 'Технологии разработки программных продуктов'
  }, {
    shifr: 2491,
    name: 'Технологии разработки туристского маршрута'
  }, {
    shifr: 2492,
    name: 'Технологии самоорганизации и эффективного взаимодействия'
  }, {
    shifr: 2493,
    name: 'Технологии социальной работы'
  }, {
    shifr: 2494,
    name: 'Технологии туристко-рекреационного проектирования и освоения территорий'
  }, {
    shifr: 2495,
    name: 'Технологии управления конфликтами и стрессами'
  }, {
    shifr: 2496,
    name: 'Технологии управления персоналом'
  }, {
    shifr: 2497,
    name: 'Технологии управления развитием персонала'
  }, {
    shifr: 2498,
    name: 'Технологии урегулирования конфликтов'
  }, {
    shifr: 2499,
    name: 'Технологии урегулирования конфликтов и укрепление мира'
  }, {
    shifr: 2500,
    name: 'Технологии физкультурно-оздоровительной деятельности'
  }, {
    shifr: 2501,
    name: 'Технологии формирования политического имиджа'
  }, {
    shifr: 2502,
    name: 'Технологии, методы и языки программирования'
  }, {
    shifr: 2503,
    name: 'Технологическая оснастка'
  }, {
    shifr: 2504,
    name: 'Технологическая подготовка машиностроительных производств'
  }, {
    shifr: 2505,
    name: 'Технологическая сборочно-сварочная оснастка'
  }, {
    shifr: 2506,
    name: 'Технологические методы восстановления деталей подвижного состава'
  }, {
    shifr: 2507,
    name: 'Технологические методы производства заготовок деталей машин'
  }, {
    shifr: 2508,
    name: 'Технологические основы группового автоматизированного производства'
  }, {
    shifr: 2509,
    name: 'Технологические основы производства полимерных материалов'
  }, {
    shifr: 2510,
    name: 'Технологические основы электроники'
  }, {
    shifr: 2511,
    name: 'Технологические процессы в машиностроении'
  }, {
    shifr: 2512,
    name: 'Технологические процессы для оборудования с ЧПУ'
  }, {
    shifr: 2513,
    name: 'Технологические процессы технического обслуживания и ремонта автомобилей'
  }, {
    shifr: 2514,
    name: 'Технологические процессы технического обслуживания, ремонта и диагностики'
  }, {
    shifr: 2515,
    name: 'Технологические процессы финишной обработки деталей машин'
  }, {
    shifr: 2516,
    name: 'Технологическое измерение политических ошибок'
  }, {
    shifr: 2517,
    name: 'Технологическое обеспечение качества'
  }, {
    shifr: 2518,
    name: 'Технологическое оборудование металлургических заводов'
  }, {
    shifr: 2519,
    name: 'Технологическое оборудование отрасли'
  }, {
    shifr: 2520,
    name: 'Технология .NET'
  }, {
    shifr: 2521,
    name: 'Технология автоматизированного производства'
  }, {
    shifr: 2522,
    name: 'Технология гостиничного сервиса'
  }, {
    shifr: 2523,
    name: 'Технология и оборудование для изготовления деталей и узлов медицинских приборов'
  }, {
    shifr: 2524,
    name: 'Технология и оборудование для сварки машиностроительных конструкций'
  }, {
    shifr: 2525,
    name: 'Технология и оборудование сварки давлением'
  }, {
    shifr: 2526,
    name: 'Технология и оборудование сварки плавлением'
  }, {
    shifr: 2527,
    name: 'Технология и оборудование электроплазменных процессов в машиностроении'
  }, {
    shifr: 2528,
    name: 'Технология и организация гостиничной деятельности'
  }, {
    shifr: 2529,
    name: 'Технология и организация гостиничных услуг'
  }, {
    shifr: 2530,
    name: 'Технология и организация пассажиропотоков'
  }, {
    shifr: 2531,
    name: 'Технология и управление работой станций и узлов'
  }, {
    shifr: 2532,
    name: 'Технология изготовления инструментов и инструментальной оснастки'
  }, {
    shifr: 2533,
    name: 'Технология изготовления материалов и изделий'
  }, {
    shifr: 2534,
    name: 'Технология изготовления швейных изделий по индивидуальным заказам'
  }, {
    shifr: 2535,
    name: 'Технология изделий легкой промышленности'
  }, {
    shifr: 2536,
    name: 'Технология ковки и объемной штамповки'
  }, {
    shifr: 2537,
    name: 'Технология конструкционных материалов'
  }, {
    shifr: 2538,
    name: 'Технология контроля и испытаний машин'
  }, {
    shifr: 2539,
    name: 'Технология листовой штамповки'
  }, {
    shifr: 2540,
    name: 'Технология литейного производства'
  }, {
    shifr: 2541,
    name: 'Технология машиностроения'
  }, {
    shifr: 2542,
    name: 'Технология микро- и наноэлектроники'
  }, {
    shifr: 2543,
    name: 'Технология наладки и обслуживания ЭВМ'
  }, {
    shifr: 2544,
    name: 'Технология научного поиска'
  }, {
    shifr: 2545,
    name: 'Технология полупроводниковых материалов'
  }, {
    shifr: 2546,
    name: 'Технология получения первичных материалов для литейного производства'
  }, {
    shifr: 2547,
    name: 'Технология приборостроения'
  }, {
    shifr: 2548,
    name: 'Технология принятия управленческих решений'
  }, {
    shifr: 2549,
    name: 'Технология программирования'
  }, {
    shifr: 2550,
    name: 'Технология программирования и практикум на ЭВМ'
  }, {
    shifr: 2551,
    name: 'Технология программирования процессов автоматического управления'
  }, {
    shifr: 2552,
    name: 'Технология проектирования и администрирования БД'
  }, {
    shifr: 2553,
    name: 'Технология производства гидромашин, гидроприводов и средств ГПА'
  }, {
    shifr: 2554,
    name: 'Технология производства подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 2555,
    name: 'Технология производства электрооборудования'
  }, {
    shifr: 2556,
    name: 'Технология разработки программного обеспечения'
  }, {
    shifr: 2557,
    name: 'Технология разработки стандартов и нормативной документации'
  }, {
    shifr: 2558,
    name: 'Технология редакционно-издательского процесса'
  }, {
    shifr: 2559,
    name: 'Технология станкостроения'
  }, {
    shifr: 2560,
    name: 'Технология формирования и продвижения гостиничного продукта'
  }, {
    shifr: 2561,
    name: 'Технология электронного машиностроения'
  }, {
    shifr: 2562,
    name: 'Типаж и проектирование технологического оборудования'
  }, {
    shifr: 2563,
    name: 'Товароведение сырья, материалов и средств производства пищевой промышленности'
  }, {
    shifr: 2564,
    name: 'Товароведение, экспертиза в таможенном деле'
  }, {
    shifr: 2565,
    name: 'Товароведение, экспертиза, стандартизация'
  }, {
    shifr: 2566,
    name: 'Топология печатных плат и интегральных микросхем'
  }, {
    shifr: 2567,
    name: 'Торгово-технологическое оборудование предприятий питания'
  }, {
    shifr: 2568,
    name: 'Точность измерительных устройств'
  }, {
    shifr: 2569,
    name: 'Традиционные оздоровительные системы'
  }, {
    shifr: 2570,
    name: 'Транснациональные корпорации'
  }, {
    shifr: 2571,
    name: 'Транспорт в туристской индустрии'
  }, {
    shifr: 2572,
    name: 'Транспортирующие машины'
  }, {
    shifr: 2573,
    name: 'Транспортная безопасность'
  }, {
    shifr: 2574,
    name: 'Транспортная география и основы геодезии'
  }, {
    shifr: 2575,
    name: 'Транспортная инфраструктура'
  }, {
    shifr: 2576,
    name: 'Транспортная инфраструктура в решении проблем безопасности дорожного движения'
  }, {
    shifr: 2577,
    name: 'Транспортная логистика'
  }, {
    shifr: 2578,
    name: 'Транспортная психология'
  }, {
    shifr: 2579,
    name: 'Транспортная энергетика'
  }, {
    shifr: 2580,
    name: 'Транспортно-грузовые системы'
  }, {
    shifr: 2581,
    name: 'Транспортное право'
  }, {
    shifr: 2582,
    name: 'Транспортно-накопительные системы'
  }, {
    shifr: 2583,
    name: 'Транспортные сооружения и пути сообщения'
  }, {
    shifr: 2584,
    name: 'Транспортные средства'
  }, {
    shifr: 2585,
    name: 'Тренинг осознанного родительства'
  }, {
    shifr: 2586,
    name: 'Тренинги'
  }, {
    shifr: 2587,
    name: 'Трибология, трение и износ узлов подвижного состава'
  }, {
    shifr: 2588,
    name: 'Трудовое право'
  }, {
    shifr: 2589,
    name: 'Туризм'
  }, {
    shifr: 2590,
    name: 'Туристическое страноведение'
  }, {
    shifr: 2591,
    name: 'Туристские ресурсы мира'
  }, {
    shifr: 2592,
    name: 'Туристские формальности'
  }, {
    shifr: 2593,
    name: 'Туристский рынок'
  }, {
    shifr: 2594,
    name: 'Туристское страноведение'
  }, {
    shifr: 2595,
    name: 'Туристско-рекреационное проектирование'
  }, {
    shifr: 2596,
    name: 'Тяга и торможение поездов'
  }, {
    shifr: 2597,
    name: 'Тяга поездов'
  }, {
    shifr: 2598,
    name: 'Тяга поездов. Тепловозная тяга'
  }, {
    shifr: 2599,
    name: 'Тяга поездов. Электрическая тяга'
  }, {
    shifr: 2600,
    name: 'Убеждающая коммуникация в социальных практиках'
  }, {
    shifr: 2601,
    name: 'Уголовное право'
  }, {
    shifr: 2602,
    name: 'Уголовно-исполнительное право'
  }, {
    shifr: 2603,
    name: 'Уголовно-процессуальное право'
  }, {
    shifr: 2604,
    name: 'Украинский язык'
  }, {
    shifr: 2605,
    name: 'Украинский язык в профессиональной сфере'
  }, {
    shifr: 2606,
    name: 'Украинский язык профессионального общения и деловодства'
  }, {
    shifr: 2607,
    name: 'Управление IT-проектами'
  }, {
    shifr: 2608,
    name: 'Управление бизнес процессами'
  }, {
    shifr: 2609,
    name: 'Управление бизнес-процессами на транспорте'
  }, {
    shifr: 2610,
    name: 'Управление в молодежной политике и инновационные методы работы с молодежью'
  }, {
    shifr: 2611,
    name: 'Управление в молодежной сфере'
  }, {
    shifr: 2612,
    name: 'Управление городским хозяйством'
  }, {
    shifr: 2613,
    name: 'Управление государственными и муниципальными закупками'
  }, {
    shifr: 2614,
    name: 'Управление грузовой и коммерческой работой'
  }, {
    shifr: 2615,
    name: 'Управление грузовой и коммерческой работой и материаловедение'
  }, {
    shifr: 2616,
    name: 'Управление грузовой и коммерческой работой на промышленном транспорте'
  }, {
    shifr: 2617,
    name: 'Управление грузовыми автоперевозками'
  }, {
    shifr: 2618,
    name: 'Управление грузовыми перевозками и логистика'
  }, {
    shifr: 2619,
    name: 'Управление деловой активностью предприятия'
  }, {
    shifr: 2620,
    name: 'Управление запасами в логистической системе поставок'
  }, {
    shifr: 2621,
    name: 'Управление и кадровый менеджмент в социальной работе'
  }, {
    shifr: 2622,
    name: 'Управление и обращение с производственными и бытовыми отходами'
  }, {
    shifr: 2623,
    name: 'Управление изменениями'
  }, {
    shifr: 2624,
    name: 'Управление инвестиционными и инновационным развитием региона'
  }, {
    shifr: 2625,
    name: 'Управление индустрией гостеприимства'
  }, {
    shifr: 2626,
    name: 'Управление инновационным развитием'
  }, {
    shifr: 2627,
    name: 'Управление инновационными проектами'
  }, {
    shifr: 2628,
    name: 'Управление интеллектуальной собственностью'
  }, {
    shifr: 2629,
    name: 'Управление качеством'
  }, {
    shifr: 2630,
    name: 'Управление качеством в сварочном производстве'
  }, {
    shifr: 2631,
    name: 'Управление качеством гостиничных и туристских услуг'
  }, {
    shifr: 2632,
    name: 'Управление качеством и конкурентоспособностью товара'
  }, {
    shifr: 2633,
    name: 'Управление качеством и сертификация персонала'
  }, {
    shifr: 2634,
    name: 'Управление качеством таможенных услуг'
  }, {
    shifr: 2635,
    name: 'Управление качеством швейных производств'
  }, {
    shifr: 2636,
    name: 'Управление конкурентоспособностью организации'
  }, {
    shifr: 2637,
    name: 'Управление конкурентоспособностью спортивной организации'
  }, {
    shifr: 2638,
    name: 'Управление конфликтами в организации'
  }, {
    shifr: 2639,
    name: 'Управление лояльностью персонала и мотивационный менеджмент'
  }, {
    shifr: 2640,
    name: 'Управление манипуляторами в неизвестной среде'
  }, {
    shifr: 2641,
    name: 'Управление международной контрактной деятельностью'
  }, {
    shifr: 2642,
    name: 'Управление организационной культурой'
  }, {
    shifr: 2643,
    name: 'Управление персоналом'
  }, {
    shifr: 2644,
    name: 'Управление персоналом гостиничного предприятия'
  }, {
    shifr: 2645,
    name: 'Управление персоналом образовательной организации'
  }, {
    shifr: 2646,
    name: 'Управление персоналом организаций'
  }, {
    shifr: 2647,
    name: 'Управление поведением участников спортивного бизнеса'
  }, {
    shifr: 2648,
    name: 'Управление потенциалом предприятия'
  }, {
    shifr: 2649,
    name: 'Управление правами интеллектуальной собственности'
  }, {
    shifr: 2650,
    name: 'Управление предприятиями на автомобильном транспорте'
  }, {
    shifr: 2651,
    name: 'Управление проектами'
  }, {
    shifr: 2652,
    name: 'Управление проектами в транспортном бизнесе'
  }, {
    shifr: 2653,
    name: 'Управление проектами разработки программного обеспечения'
  }, {
    shifr: 2654,
    name: 'Управление процессом разработки и освоения производства инновационной продукции'
  }, {
    shifr: 2655,
    name: 'Управление развитием организации'
  }, {
    shifr: 2656,
    name: 'Управление развитием персонала'
  }, {
    shifr: 2657,
    name: 'Управление расходами'
  }, {
    shifr: 2658,
    name: 'Управление рисками в государственной системе управления'
  }, {
    shifr: 2659,
    name: 'Управление рисками, системный анализ и моделирование'
  }, {
    shifr: 2660,
    name: 'Управление риском в реальном секторе экономики'
  }, {
    shifr: 2661,
    name: 'Управление роботами и робототехническими устройствами'
  }, {
    shifr: 2662,
    name: 'Управление социально-техническими системами'
  }, {
    shifr: 2663,
    name: 'Управление спортивной индустрией'
  }, {
    shifr: 2664,
    name: 'Управление спортивной инфраструктурой'
  }, {
    shifr: 2665,
    name: 'Управление спортивными сооружениями и культурно-оздоровительными комплексами'
  }, {
    shifr: 2666,
    name: 'Управление станками и станочными комплексами'
  }, {
    shifr: 2667,
    name: 'Управление таможенным делом'
  }, {
    shifr: 2668,
    name: 'Управление техническими системами'
  }, {
    shifr: 2669,
    name: 'Управление технической службой подразделений ГПС'
  }, {
    shifr: 2670,
    name: 'Управление трудовым потенциалом'
  }, {
    shifr: 2671,
    name: 'Управление туристским бизнесом'
  }, {
    shifr: 2672,
    name: 'Управление финансовыми рисками'
  }, {
    shifr: 2673,
    name: 'Управление цепями поставок'
  }, {
    shifr: 2674,
    name: 'Управление человеческими ресурсами'
  }, {
    shifr: 2675,
    name: 'Управление экспертизой СЭБ'
  }, {
    shifr: 2676,
    name: 'Управление эксплуатационной работой'
  }, {
    shifr: 2677,
    name: 'Управление эксплуатационной работой на промышленном транспорте'
  }, {
    shifr: 2678,
    name: 'Управление электромеханическими системами'
  }, {
    shifr: 2679,
    name: 'Управление электроснабжением в локальных объектах'
  }, {
    shifr: 2680,
    name: 'Управление электроснабжением предприятий и учреждений'
  }, {
    shifr: 2681,
    name: 'Управление эффективностью и результативностью в спорте'
  }, {
    shifr: 2682,
    name: 'Управленческая экономика'
  }, {
    shifr: 2683,
    name: 'Управленческий консалтинг'
  }, {
    shifr: 2684,
    name: 'Управленческий учет'
  }, {
    shifr: 2685,
    name: 'Управленческий учёт'
  }, {
    shifr: 2686,
    name: 'Управленческий учет (продвинутый уровень)'
  }, {
    shifr: 2687,
    name: 'Управленческое консультирование государственных и некоммерческих организаций'
  }, {
    shifr: 2688,
    name: 'Управленческое консультирование и информационно-аналитическая работа'
  }, {
    shifr: 2689,
    name: 'Управляющие вычислительные системы производственных процессов'
  }, {
    shifr: 2690,
    name: 'Управляющие системы мехатронных и робототехнических комплексов'
  }, {
    shifr: 2691,
    name: 'Упрочняющие технологии и покрытия'
  }, {
    shifr: 2692,
    name: 'Уравнения математической физики'
  }, {
    shifr: 2693,
    name: 'Условия перевозок и тарифы в международных сообщениях'
  }, {
    shifr: 2694,
    name: 'Устное народное творчество'
  }, {
    shifr: 2695,
    name: 'Устойчивое развитие'
  }, {
    shifr: 2696,
    name: 'Устойчивое развитие предприятия'
  }, {
    shifr: 2697,
    name: 'Устойчивое развитие спортивной индустрии'
  }, {
    shifr: 2698,
    name: 'Устойчивость и управление движением'
  }, {
    shifr: 2699,
    name: 'Устройства навигации робототехнических систем'
  }, {
    shifr: 2700,
    name: 'Устройство и работа поршневых двигателей'
  }, {
    shifr: 2701,
    name: 'Устройство и эксплуатация пути'
  }, {
    shifr: 2702,
    name: 'Устройство ПК'
  }, {
    shifr: 2703,
    name: 'Утилизация, переработка и захоронение отходов'
  }, {
    shifr: 2704,
    name: 'Учебная практика'
  }, {
    shifr: 2705,
    name: 'Учение о биосфере'
  }, {
    shifr: 2706,
    name: 'Учение о гидросфере'
  }, {
    shifr: 2707,
    name: 'Учение об атмосфере'
  }, {
    shifr: 2708,
    name: 'Учет в банках'
  }, {
    shifr: 2709,
    name: 'Учет в бюджетных организациях'
  }, {
    shifr: 2710,
    name: 'Учет в зарубежных странах'
  }, {
    shifr: 2711,
    name: 'Учет и анализ банкротств'
  }, {
    shifr: 2712,
    name: 'Учет и анализ в отраслях хозяйствования'
  }, {
    shifr: 2713,
    name: 'Учет и отчетность в налогообложении'
  }, {
    shifr: 2714,
    name: 'Факультатив по кроссплатформенному программированию'
  }, {
    shifr: 2715,
    name: 'Факультатив по подготовке к олимпиадам по программированию'
  }, {
    shifr: 2716,
    name: 'Физика'
  }, {
    shifr: 2717,
    name: 'Физика атома и атомных явлений'
  }, {
    shifr: 2718,
    name: 'Физика вакуума'
  }, {
    shifr: 2719,
    name: 'Физика газового разряда'
  }, {
    shifr: 2720,
    name: 'Физика диэлектриков'
  }, {
    shifr: 2721,
    name: 'Физика Земли'
  }, {
    shifr: 2722,
    name: 'Физика конденсированного состояния'
  }, {
    shifr: 2723,
    name: 'Физика низкоразмерных систем и процессы микро- и нанотехнологии'
  }, {
    shifr: 2724,
    name: 'Физика плазмы'
  }, {
    shifr: 2725,
    name: 'Физика полупроводников'
  }, {
    shifr: 2726,
    name: 'Физика ускорителей'
  }, {
    shifr: 2727,
    name: 'Физика фазовых переходов'
  }, {
    shifr: 2728,
    name: 'Физика электротехнологических процессов'
  }, {
    shifr: 2729,
    name: 'Физика ядра и частиц'
  }, {
    shifr: 2730,
    name: 'Физико-механические свойства формовочных материалов'
  }, {
    shifr: 2731,
    name: 'Физико-механический практикум и вычислительная механика'
  }, {
    shifr: 2732,
    name: 'Физико-технологические основы оптимального резания'
  }, {
    shifr: 2733,
    name: 'Физико-химические методы исследования материалов и изделий легкой промышленности'
  }, {
    shifr: 2734,
    name: 'Физико-химические основы моделирования строения и свойств материалов'
  }, {
    shifr: 2735,
    name: 'Физико-химические основы развития и тушения пожаров'
  }, {
    shifr: 2736,
    name: 'Физиологические и биомеханические основы физических упражнений'
  }, {
    shifr: 2737,
    name: 'Физиологические механизмы адаптации у лиц с ОФВ'
  }, {
    shifr: 2738,
    name: 'Физиология и психология труда'
  }, {
    shifr: 2739,
    name: 'Физиология ЦНС'
  }, {
    shifr: 2740,
    name: 'Физиология ЦНС, ВНД и сенсорных систем'
  }, {
    shifr: 2741,
    name: 'Физиология человека'
  }, {
    shifr: 2742,
    name: 'Физиотерапия'
  }, {
    shifr: 2743,
    name: 'Физическая культура'
  }, {
    shifr: 2744,
    name: 'Физическая культура (культура здоровья)'
  }, {
    shifr: 2745,
    name: 'Физическая культура (специальная подготовка)'
  }, {
    shifr: 2746,
    name: 'Физическая культура и спорт'
  }, {
    shifr: 2747,
    name: 'Физическая реабилитация'
  }, {
    shifr: 2748,
    name: 'Физическая реабилитация (терапия) в педиатрии'
  }, {
    shifr: 2749,
    name: 'Физическая реабилитация (терапия) костно-мышечных функций'
  }, {
    shifr: 2750,
    name: 'Физическая реабилитация (терапия) неврологических заболеваний'
  }, {
    shifr: 2751,
    name: 'Физическая реабилитация (терапия) при респираторных и сердечно-сосудистых заболеваниях'
  }, {
    shifr: 2752,
    name: 'Физическая химия'
  }, {
    shifr: 2753,
    name: 'Физическая химия и металлургические технологии'
  }, {
    shifr: 2754,
    name: 'Физические основы измерений и эталоны'
  }, {
    shifr: 2755,
    name: 'Физические основы медицинской диагностики'
  }, {
    shifr: 2756,
    name: 'Физические основы микро- и наноэлектроники'
  }, {
    shifr: 2757,
    name: 'Физические основы неразрушающего контроля'
  }, {
    shifr: 2758,
    name: 'Физические основы сенсорики'
  }, {
    shifr: 2759,
    name: 'Физические свойства материалов'
  }, {
    shifr: 2760,
    name: 'Филологические основы рекламного дела'
  }, {
    shifr: 2761,
    name: 'Философия'
  }, {
    shifr: 2762,
    name: 'Философия VI-XVIII вв.'
  }, {
    shifr: 2763,
    name: 'Философия Древнего Востока'
  }, {
    shifr: 2764,
    name: 'Философия духовного воспитания'
  }, {
    shifr: 2765,
    name: 'Философия здоровья'
  }, {
    shifr: 2766,
    name: 'Философия и история образования'
  }, {
    shifr: 2767,
    name: 'Философия и методология науки'
  }, {
    shifr: 2768,
    name: 'Философия искусства'
  }, {
    shifr: 2769,
    name: 'Философия истории'
  }, {
    shifr: 2770,
    name: 'Философия конфликта и мира'
  }, {
    shifr: 2771,
    name: 'Философия культуры'
  }, {
    shifr: 2772,
    name: 'Философия культуры: основные модели культур ХХI в.'
  }, {
    shifr: 2773,
    name: 'Философия любви'
  }, {
    shifr: 2774,
    name: 'Философия массового сознания'
  }, {
    shifr: 2775,
    name: 'Философия политики'
  }, {
    shifr: 2776,
    name: 'Философия политики и права'
  }, {
    shifr: 2777,
    name: 'Философия права'
  }, {
    shifr: 2778,
    name: 'Философия религии'
  }, {
    shifr: 2779,
    name: 'Философия сакрального'
  }, {
    shifr: 2780,
    name: 'Философская антропология'
  }, {
    shifr: 2781,
    name: 'Философская антропология ХХ в. основные идеи и концепции'
  }, {
    shifr: 2782,
    name: 'Философская риторика'
  }, {
    shifr: 2783,
    name: 'Философские вопросы технических знаний'
  }, {
    shifr: 2784,
    name: 'Философские концепты новых религиозных движений'
  }, {
    shifr: 2785,
    name: 'Философские основы коммуникации'
  }, {
    shifr: 2786,
    name: 'Философские проблемы научного познания'
  }, {
    shifr: 2787,
    name: 'Философские проблемы психоанализа'
  }, {
    shifr: 2788,
    name: 'Финансовая безопасность'
  }, {
    shifr: 2789,
    name: 'Финансовая диагностика'
  }, {
    shifr: 2790,
    name: 'Финансовая информация'
  }, {
    shifr: 2791,
    name: 'Финансовая математика'
  }, {
    shifr: 2792,
    name: 'Финансовая стратегия'
  }, {
    shifr: 2793,
    name: 'Финансовая экономика'
  }, {
    shifr: 2794,
    name: 'Финансовое планирование и прогнозирование'
  }, {
    shifr: 2795,
    name: 'Финансовые и денежно-кредитные методы регулирования экономики'
  }, {
    shifr: 2796,
    name: 'Финансовые расчеты'
  }, {
    shifr: 2797,
    name: 'Финансовые рынки'
  }, {
    shifr: 2798,
    name: 'Финансовые рынки и финансово-кредитные институты'
  }, {
    shifr: 2799,
    name: 'Финансовый анализ'
  }, {
    shifr: 2800,
    name: 'Финансовый анализ (продвинутый уровень)'
  }, {
    shifr: 2801,
    name: 'Финансовый контроль'
  }, {
    shifr: 2802,
    name: 'Финансовый менеджмент'
  }, {
    shifr: 2803,
    name: 'Финансовый менеджмент (продвинутый уровень)'
  }, {
    shifr: 2804,
    name: 'Финансовый менеджмент в коммерческом банке'
  }, {
    shifr: 2805,
    name: 'Финансовый менеджмент в спортивной организации'
  }, {
    shifr: 2806,
    name: 'Финансовый учет'
  }, {
    shifr: 2807,
    name: 'Финансы'
  }, {
    shifr: 2808,
    name: 'Финансы предприятий'
  }, {
    shifr: 2809,
    name: 'Фокус-группы: методология, методика, практика'
  }, {
    shifr: 2810,
    name: 'Формирование издательских портфелей'
  }, {
    shifr: 2811,
    name: 'Фотожурналистика'
  }, {
    shifr: 2812,
    name: 'Функциональная электроника'
  }, {
    shifr: 2813,
    name: 'Функциональное и логическое программирование'
  }, {
    shifr: 2814,
    name: 'Функциональный анализ'
  }, {
    shifr: 2815,
    name: 'Химия'
  }, {
    shifr: 2816,
    name: 'Химмотология'
  }, {
    shifr: 2817,
    name: 'Хладотранспорт'
  }, {
    shifr: 2818,
    name: 'Хладотранспорт и основы теплотехники'
  }, {
    shifr: 2819,
    name: 'Хозяйственное право'
  }, {
    shifr: 2820,
    name: 'Художественное литье'
  }, {
    shifr: 2821,
    name: 'Художественное литье и художественная обработка материалов'
  }, {
    shifr: 2822,
    name: 'Художественно-техническое редактирование'
  }, {
    shifr: 2823,
    name: 'Художественно-эстетическое воспитание в системе профессионального образования'
  }, {
    shifr: 2824,
    name: 'Ценообразование'
  }, {
    shifr: 2825,
    name: 'Церковь и советское государство: особенности взаимоотношений'
  }, {
    shifr: 2826,
    name: 'Цивилистическая теория защиты прав'
  }, {
    shifr: 2827,
    name: 'Цифровая обработка данных в автоматизированных системах'
  }, {
    shifr: 2828,
    name: 'Цифровая обработка сигналов'
  }, {
    shifr: 2829,
    name: 'Цифровая обработка сигналов в системах автоматизации'
  }, {
    shifr: 2830,
    name: 'Цифровые измерительные устройства'
  }, {
    shifr: 2831,
    name: 'Цифровые измерительные устройства и информационно-измерительные системы'
  }, {
    shifr: 2832,
    name: 'Цифровые системы управления'
  }, {
    shifr: 2833,
    name: 'Частная теория перевода'
  }, {
    shifr: 2834,
    name: 'Частные методики адаптивной физической культуры'
  }, {
    shifr: 2835,
    name: 'Человек как философская проблема'
  }, {
    shifr: 2836,
    name: 'Человеко-машинный интерфейс'
  }, {
    shifr: 2837,
    name: 'Численные методы'
  }, {
    shifr: 2838,
    name: 'Численные методы 2'
  }, {
    shifr: 2839,
    name: 'Численные методы в задачах подъемно-транспортного, строительного, дорожного машиностроения'
  }, {
    shifr: 2840,
    name: 'Численные методы в экономических расчетах'
  }, {
    shifr: 2841,
    name: 'Численные методы расчета электромагнитных полей'
  }, {
    shifr: 2842,
    name: 'Численные методы решения гидроаэродинамических задач гидропневмосистем'
  }, {
    shifr: 2843,
    name: 'Численные методы решения задач подъемно-транспортного, строительного, дорожного машиностроения'
  }, {
    shifr: 2844,
    name: 'ЧС эпизоотий и эпифитотий'
  }, {
    shifr: 2845,
    name: 'ЭВМ и периферийные устройства'
  }, {
    shifr: 2846,
    name: 'ЭВМ-эксперимент и машинная обработка информации'
  }, {
    shifr: 2847,
    name: 'Эвристические методы проектирования'
  }, {
    shifr: 2848,
    name: 'Экожурналистика'
  }, {
    shifr: 2849,
    name: 'Экологическая безопасность в чрезвычайных ситуациях'
  }, {
    shifr: 2850,
    name: 'Экологическая геология'
  }, {
    shifr: 2851,
    name: 'Экологические аспекты оптимизации техногенно нарушенных ландшафтов'
  }, {
    shifr: 2852,
    name: 'Экологические проблемы металлургического производства'
  }, {
    shifr: 2853,
    name: 'Экологические проблемы на автотранспорте'
  }, {
    shifr: 2854,
    name: 'Экологические проблемы при эксплуатации ДВС'
  }, {
    shifr: 2855,
    name: 'Экологический менеджмент и аудит'
  }, {
    shifr: 2856,
    name: 'Экологический мониторинг'
  }, {
    shifr: 2857,
    name: 'Экологический мониторинг, теория и практика'
  }, {
    shifr: 2858,
    name: 'Экологическое право'
  }, {
    shifr: 2859,
    name: 'Экологическое проектирование, экспертиза и контроль окружающей среды'
  }, {
    shifr: 2860,
    name: 'Экология'
  }, {
    shifr: 2861,
    name: 'Экология водных и наземных систем и их охрана'
  }, {
    shifr: 2862,
    name: 'Экология и природоохранное обустройство урбанизированных территорий'
  }, {
    shifr: 2863,
    name: 'Экология транспорта'
  }, {
    shifr: 2864,
    name: 'Экология человека'
  }, {
    shifr: 2865,
    name: 'Эконометрика'
  }, {
    shifr: 2866,
    name: 'Экономика'
  }, {
    shifr: 2867,
    name: 'Экономика гостиничного предприятия'
  }, {
    shifr: 2868,
    name: 'Экономика зарубежных стран'
  }, {
    shifr: 2869,
    name: 'Экономика и менеджмент безопасности'
  }, {
    shifr: 2870,
    name: 'Экономика и нормирование труда на предприятии'
  }, {
    shifr: 2871,
    name: 'Экономика и организация инвестиционной деятельности'
  }, {
    shifr: 2872,
    name: 'Экономика и организация НИОКР'
  }, {
    shifr: 2873,
    name: 'Экономика и организация объединений предприятий'
  }, {
    shifr: 2874,
    name: 'Экономика индустрии спорта'
  }, {
    shifr: 2875,
    name: 'Экономика инновационной деятельности'
  }, {
    shifr: 2876,
    name: 'Экономика интеллектуальной собственности'
  }, {
    shifr: 2877,
    name: 'Экономика качества продукции'
  }, {
    shifr: 2878,
    name: 'Экономика общественного сектора'
  }, {
    shifr: 2879,
    name: 'Экономика отраслевых рынков'
  }, {
    shifr: 2880,
    name: 'Экономика отрасли'
  }, {
    shifr: 2881,
    name: 'Экономика пожарной безопасности'
  }, {
    shifr: 2882,
    name: 'Экономика предпринимательства'
  }, {
    shifr: 2883,
    name: 'Экономика предприятия'
  }, {
    shifr: 2884,
    name: 'Экономика природопользования'
  }, {
    shifr: 2885,
    name: 'Экономика стандартизации и метрологического обеспечения'
  }, {
    shifr: 2886,
    name: 'Экономика транспорта'
  }, {
    shifr: 2887,
    name: 'Экономика транспортной отрасли'
  }, {
    shifr: 2888,
    name: 'Экономика труда и социально-трудовые отношения'
  }, {
    shifr: 2889,
    name: 'Экономика туристического предприятия'
  }, {
    shifr: 2890,
    name: 'Экономико-правовое обеспечение профессиональной деятельности'
  }, {
    shifr: 2891,
    name: 'Экономико-правовые основы рынка программного обеспечения'
  }, {
    shifr: 2892,
    name: 'Экономическая диагностика'
  }, {
    shifr: 2893,
    name: 'Экономическая оценка ущерба от дорожно-транспортных происшествий'
  }, {
    shifr: 2894,
    name: 'Экономическая политика стран мира'
  }, {
    shifr: 2895,
    name: 'Экономическая проблематика в СМИ'
  }, {
    shifr: 2896,
    name: 'Экономическая социология'
  }, {
    shifr: 2897,
    name: 'Экономическая теория'
  }, {
    shifr: 2898,
    name: 'Экономическая теория и макроэкономика'
  }, {
    shifr: 2899,
    name: 'Экономическая теория и макроэкономика (продвинутый уровень)'
  }, {
    shifr: 2900,
    name: 'Экономическая эффективность деятельности предприятия'
  }, {
    shifr: 2901,
    name: 'Экономические и политические процессы стран ЦВЕ и СНГ'
  }, {
    shifr: 2902,
    name: 'Экономические методы предотвращения ущерба предприятию'
  }, {
    shifr: 2903,
    name: 'Экономические основы работы с молодежью'
  }, {
    shifr: 2904,
    name: 'Экономические основы социальной работы'
  }, {
    shifr: 2905,
    name: 'Экономические проблемы и организация производства на автотранспорте'
  }, {
    shifr: 2906,
    name: 'Экономические советующие системы'
  }, {
    shifr: 2907,
    name: 'Экономический механизм маркетинга'
  }, {
    shifr: 2908,
    name: 'Экономический потенциал региона'
  }, {
    shifr: 2909,
    name: 'Экономический практикум'
  }, {
    shifr: 2910,
    name: 'Экономическое обоснование научных решений'
  }, {
    shifr: 2911,
    name: 'Экономичные технологии термических цехов'
  }, {
    shifr: 2912,
    name: 'Экотоксикология'
  }, {
    shifr: 2913,
    name: 'Экскурсология'
  }, {
    shifr: 2914,
    name: 'Экспериментальная психология'
  }, {
    shifr: 2915,
    name: 'Экспериментальная психология и психодиагностика'
  }, {
    shifr: 2916,
    name: 'Экспериментальные методы в гидроаэродинамике'
  }, {
    shifr: 2917,
    name: 'Экспертиза и анализ конфликта'
  }, {
    shifr: 2918,
    name: 'Экспертиза качества продовольственных товаров в таможенной деятельности'
  }, {
    shifr: 2919,
    name: 'Экспертиза проектов'
  }, {
    shifr: 2920,
    name: 'Экспертиза сырья, материалов и швейных изделий'
  }, {
    shifr: 2921,
    name: 'Экспертные методы исследования материалов'
  }, {
    shifr: 2922,
    name: 'Экспертные системы'
  }, {
    shifr: 2923,
    name: 'Эксплуатационные материалы автомобилей'
  }, {
    shifr: 2924,
    name: 'Эксплуатационные материалы подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 2925,
    name: 'Эксплуатация гидромашин, гидроприводов и средств ГПА'
  }, {
    shifr: 2926,
    name: 'Эксплуатация и обслуживание машин'
  }, {
    shifr: 2927,
    name: 'Эксплуатация и обслуживание машин пищевых производств'
  }, {
    shifr: 2928,
    name: 'Эксплуатация и ремонт ДВС'
  }, {
    shifr: 2929,
    name: 'Эксплуатация и ремонт технических средств промышленного транспорта'
  }, {
    shifr: 2930,
    name: 'Эксплуатация и ремонт технологического оборудования'
  }, {
    shifr: 2931,
    name: 'Эксплуатация и техническое обслуживание подвижного состава'
  }, {
    shifr: 2932,
    name: 'Эксплуатация приборов'
  }, {
    shifr: 2933,
    name: 'Эксплуатация систем электроснабжения'
  }, {
    shifr: 2934,
    name: 'Электоральная социология'
  }, {
    shifr: 2935,
    name: 'Электрическая часть электрических станций и подстанций'
  }, {
    shifr: 2936,
    name: 'Электрические аппараты'
  }, {
    shifr: 2937,
    name: 'Электрические аппараты и схемы локомотивов'
  }, {
    shifr: 2938,
    name: 'Электрические и электромагнитные методы контроля'
  }, {
    shifr: 2939,
    name: 'Электрические и электронные аппараты'
  }, {
    shifr: 2940,
    name: 'Электрические машины'
  }, {
    shifr: 2941,
    name: 'Электрические машины энергетических систем'
  }, {
    shifr: 2942,
    name: 'Электрические передачи локомотивов'
  }, {
    shifr: 2943,
    name: 'Электрический транспорт'
  }, {
    shifr: 2944,
    name: 'Электрическое оборудование локомотивов'
  }, {
    shifr: 2945,
    name: 'Электрическое освещение'
  }, {
    shifr: 2946,
    name: 'Электричество и магнетизм'
  }, {
    shifr: 2947,
    name: 'Электродинамика'
  }, {
    shifr: 2948,
    name: 'Электромагнитная совместимость'
  }, {
    shifr: 2949,
    name: 'Электромагнитная совместимость электронных устройств'
  }, {
    shifr: 2950,
    name: 'Электромагнитные переходные процессы в электроэнергетических системах'
  }, {
    shifr: 2951,
    name: 'Электромагнитные расчеты в электромеханике'
  }, {
    shifr: 2952,
    name: 'Электромагнитные системы железоотделителей'
  }, {
    shifr: 2953,
    name: 'Электромеханика и мехатроника в автоматизированных системах'
  }, {
    shifr: 2954,
    name: 'Электромеханические переходные процессы в электроэнергетических системах'
  }, {
    shifr: 2955,
    name: 'Электроника'
  }, {
    shifr: 2956,
    name: 'Электроника в электромеханике'
  }, {
    shifr: 2957,
    name: 'Электроника и микросхемотехника'
  }, {
    shifr: 2958,
    name: 'Электронные издания'
  }, {
    shifr: 2959,
    name: 'Электронные методы в физике'
  }, {
    shifr: 2960,
    name: 'Электронные устройства мехатронных и робототехнических систем'
  }, {
    shifr: 2961,
    name: 'Электронные устройства систем автоматики'
  }, {
    shifr: 2962,
    name: 'Электронный бизнес'
  }, {
    shifr: 2963,
    name: 'Электронный учебник'
  }, {
    shifr: 2964,
    name: 'Электрооборудование автотранспортных предприятий'
  }, {
    shifr: 2965,
    name: 'Электрооборудование машиностроительных предприятий'
  }, {
    shifr: 2966,
    name: 'Электрооборудование подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 2967,
    name: 'Электрооборудование промышленных предприятий'
  }, {
    shifr: 2968,
    name: 'Электроснабжение'
  }, {
    shifr: 2969,
    name: 'Электротехника'
  }, {
    shifr: 2970,
    name: 'Электротехника и электроника'
  }, {
    shifr: 2971,
    name: 'Электротехника, электроника и электропривод'
  }, {
    shifr: 2972,
    name: 'Электротехнические материалы'
  }, {
    shifr: 2973,
    name: 'Электротехнические системы потребления предприятий и учреждений'
  }, {
    shifr: 2974,
    name: 'Электрофизиология'
  }, {
    shifr: 2975,
    name: 'Электрофизические и электрохимические методы обработки материалов'
  }, {
    shifr: 2976,
    name: 'Электрофизические методы обработки в электронной промышленности'
  }, {
    shifr: 2977,
    name: 'Электрофизические технологии обработки материалов'
  }, {
    shifr: 2978,
    name: 'Электроэнергетические системы и сети'
  }, {
    shifr: 2979,
    name: 'Элементарная математика'
  }, {
    shifr: 2980,
    name: 'Элементы микророботов'
  }, {
    shifr: 2981,
    name: 'Элементы теории чисел'
  }, {
    shifr: 2982,
    name: 'Энергетика кузнечно-прессового оборудования'
  }, {
    shifr: 2983,
    name: 'Энергетические машины и установки'
  }, {
    shifr: 2984,
    name: 'Энергетические установки подъемно-транспортных, строительных, дорожных машин'
  }, {
    shifr: 2985,
    name: 'Энергетическое обеспечение робототехнических и мехатронных систем'
  }, {
    shifr: 2986,
    name: 'Энергетическое обеспечение робототехнических систем'
  }, {
    shifr: 2987,
    name: 'Энергосбережение в электроэнергетике'
  }, {
    shifr: 2988,
    name: 'Эристика'
  }, {
    shifr: 2989,
    name: 'Эристика. Теория и практика аргументации'
  }, {
    shifr: 2990,
    name: 'Эстетика'
  }, {
    shifr: 2991,
    name: 'Этика'
  }, {
    shifr: 2992,
    name: 'Этика деловых отношений'
  }, {
    shifr: 2993,
    name: 'Этика деловых отношений и международный деловой этикет'
  }, {
    shifr: 2994,
    name: 'Этика и эстетика'
  }, {
    shifr: 2995,
    name: 'Этика редакторской деятельности'
  }, {
    shifr: 2996,
    name: 'Этика управления образовательными системами'
  }, {
    shifr: 2997,
    name: 'Этико-психологические основы профессионального образования'
  }, {
    shifr: 2998,
    name: 'Этико-психологические основы профессиональной деятельности педагога'
  }, {
    shifr: 2999,
    name: 'Этические нормы профессиональной деятельности психолога-конфликтолога'
  }, {
    shifr: 3000,
    name: 'Этические основы социальной работы'
  }, {
    shifr: 3001,
    name: 'Этнология и социальная антропология'
  }, {
    shifr: 3002,
    name: 'Этнополитология'
  }, {
    shifr: 3003,
    name: 'Этнопсихология и проблемы виктимологии'
  }, {
    shifr: 3004,
    name: 'Этнопсихология и этноконфликтология'
  }, {
    shifr: 3005,
    name: 'Этносоциология'
  }, {
    shifr: 3006,
    name: 'Эффективность информационных систем'
  }, {
    shifr: 3007,
    name: 'Эффективный менеджмент'
  }, {
    shifr: 3008,
    name: 'Ювенальная политика и законодательство'
  }, {
    shifr: 3009,
    name: 'Юридическая деонтология'
  }, {
    shifr: 3010,
    name: 'Юридическая психология'
  }, {
    shifr: 3011,
    name: 'Юридическая психология и конфликтология'
  }, {
    shifr: 3012,
    name: 'Ядерная спектрометрия'
  }, {
    shifr: 3013,
    name: 'Язык и стиль СМИ и ИБД'
  }, {
    shifr: 3014,
    name: 'Языковая коммуникация в профессиональной сфере на иностранном языке'
  }, {
    shifr: 3015,
    name: 'Языковая коммуникация в профессиональной сфере на русском языке'
  }
];
