let kafList=[{
    shifr: "2",
    name: "политологии и международных отношений",
    shifrFac: "ГТ",
    zawFio: "Пробейголова Н.В."
  }, {
    shifr: "3",
    name: "психологии",
    shifrFac: "ГТ",
    zawFio: "Скляр П.П."
  }, {
    shifr: "4",
    name: "физического воспитания",
    shifrFac: "ФС",
    zawFio: "Ляпин В.П."
  }, {
    shifr: "5",
    name: "истории спорта и спортивной индустрии",
    shifrFac: "ФС",
    zawFio: "Ермолаева Т.Н."
  }, {
    shifr: "6",
    name: "маркетинга",
    shifrFac: "УП",
    zawFio: "Максимова Т.С."
  }, {
    shifr: "7",
    name: "мировой экономики",
    shifrFac: "ЭК",
    zawFio: "Инговатова В.А."
  }, {
    shifr: "8",
    name: "управления персоналом и экономической теории",
    shifrFac: "УП",
    zawFio: "Чумаченко Г.В."
  }, {
    shifr: "10",
    name: "электромеханики",
    shifrFac: "ЭТ",
    zawFio: "Тарасенко О.В."
  }, {
    shifr: "13",
    name: "иностранных языков",
    shifrFac: "ФЛ",
    zawFio: "Гуковская Т.Г."
  }, {
    shifr: "15",
    name: "журналистики",
    shifrFac: "ФЛ",
    zawFio: "Фесенко Ю.П."
  }, {
    shifr: "17",
    name: "теории и практики перевода германских и романских языков",
    shifrFac: "ФЛ",
    zawFio: "Клименко А.С."
  }, {
    shifr: "18",
    name: "социологии",
    shifrFac: "ГТ",
    zawFio: "Лустенко А.Ю."
  }, {
    shifr: "20",
    name: "гидрогазодинамики",
    shifrFac: "ИМ",
    zawFio: "Мальцев Я.И."
  }, {
    shifr: "21",
    name: "компьютерных систем и сетей",
    shifrFac: "ИТ",
    zawFio: "Попов С.В."
  }, {
    shifr: "22",
    name: "информатики и программной инженерии",
    shifrFac: "ИТ",
    zawFio: "Кочевский А.А."
  }, {
    shifr: "23",
    name: "прикладной математики",
    shifrFac: "ИТ",
    zawFio: "Малый В.В."
  }, {
    shifr: "24",
    name: "менеджмента и экономической безопасности",
    shifrFac: "УП",
    zawFio: "Тисунова В.Н."
  }, {
    shifr: "26",
    name: "станков, инструментов и инженерной графики",
    shifrFac: "ИМ",
    zawFio: "Макухин А.Г."
  }, {
    shifr: "28",
    name: "машиноведения",
    shifrFac: "ИМ",
    zawFio: "Шевченко С.В."
  }, {
    shifr: "30",
    name: "охраны труда и безопасности жизнедеятельности",
    shifrFac: "ИМ",
    zawFio: "Медяник В.А."
  }, {
    shifr: "31",
    name: "материаловедения",
    shifrFac: "ИМ",
    zawFio: "Рябичева Л.А."
  }, {
    shifr: "32",
    name: "технологии машиностроения и инженерного консалтинга",
    shifrFac: "ИМ",
    zawFio: "Витренко В.А."
  }, {
    shifr: "33",
    name: "экономики предприятия",
    shifrFac: "ЭК",
    zawFio: "Максимов В.В."
  }, {
    shifr: "35",
    name: "экологии",
    shifrFac: "ЕН",
    zawFio: "Черных В.И."
  }, {
    shifr: "36",
    name: "физики",
    shifrFac: "ЕН",
    zawFio: "Корсунов К.А."
  }, {
    shifr: "37",
    name: "химии и инновационных химических технологий",
    shifrFac: "ЕН",
    zawFio: "Кривоколыско С.Г."
  }, {
    shifr: "40",
    name: "двигателей внутреннего сгорания",
    shifrFac: "ТЛ",
    zawFio: "Данилейченко А.А."
  }, {
    shifr: "41",
    name: "железнодорожного транспорта",
    shifrFac: "ТЛ",
    zawFio: "Быкадоров В.В."
  }, {
    shifr: "45",
    name: "транспортных систем",
    shifrFac: "ТЛ",
    zawFio: "Нечаев Г.И."
  }, {
    shifr: "46",
    name: "экономической кибернетики и прикладной статистики",
    shifrFac: "УП",
    zawFio: "Велигура А.В."
  }, {
    shifr: "47",
    name: "международно-правовых дисциплин",
    shifrFac: "ЮИ",
    zawFio: "Лазор В.В."
  }, {
    shifr: "48",
    name: "права интеллектуальной собственности и инноватики",
    shifrFac: "ЮИ",
    zawFio: "Калюжный В.В."
  }, {
    shifr: "49",
    name: "государственного управления",
    shifrFac: "ГУ",
    zawFio: "Родионов А.В."
  }, {
    shifr: "50",
    name: "хозяйственно-правовых дисциплин и процесса",
    shifrFac: "ЮИ",
    zawFio: "Куцурубова-Шевченко Е.В."
  }, {
    shifr: "51",
    name: "конституционного и муниципального права",
    shifrFac: "ЮИ",
    zawFio: "Санжаров С.Н."
  }, {
    shifr: "52",
    name: "правоведения",
    shifrFac: "ЮИ",
    zawFio: "Лазор Л.И."
  }, {
    shifr: "53",
    name: "военная",
    shifrFac: "",
    zawFio: "Смирнов Ю.Е."
  }, {
    shifr: "55",
    name: "приборов",
    shifrFac: "ЭТ",
    zawFio: "Мирошников В.В."
  }, {
    shifr: "57",
    name: "финансов и кредита",
    shifrFac: "ЭК",
    zawFio: "Салита С.В."
  }, {
    shifr: "60",
    name: "мировой философии и теологии",
    shifrFac: "ГТ",
    zawFio: "Исаев В.Д."
  }, {
    shifr: "61",
    name: "славянской филологии",
    shifrFac: "ФЛ",
    zawFio: "Нередкова С.С."
  }, {
    shifr: "66",
    name: "легкой и пищевой промышленности",
    shifrFac: "ИМ",
    zawFio: "Дейнека И.Г."
  }, {
    shifr: "72",
    name: "педагогики",
    shifrFac: "ФЛ",
    zawFio: "Фунтикова Н.В."
  }, {
    shifr: "73",
    name: "документоведения и технотронной информологии",
    shifrFac: "ГТ",
    zawFio: "Каминская О.В."
  }, {
    shifr: "75",
    name: "отечественной и всеобщей истории",
    shifrFac: "ФЛ",
    zawFio: "Бельдюгин В.А."
  }, {
    shifr: "77",
    name: "социальной работы и организации работы с молодежью",
    shifrFac: "ГТ",
    zawFio: "Васюк А.Г."
  }, {
    shifr: "81",
    name: "промышленного и художественного литья",
    shifrFac: "ИМ",
    zawFio: "Гутько Ю.И."
  }, {
    shifr: "82",
    name: "проблем человека и философии здоровья",
    shifrFac: "ФС",
    zawFio: "Мечетный Ю.Н."
  }, {
    shifr: "83",
    name: "туризма и гостиничного хозяйства",
    shifrFac: "УП",
    zawFio: "Свиридова Н.Д."
  }, {
    shifr: "87",
    name: "обработки металлов давлением и сварки",
    shifrFac: "ИМ",
    zawFio: "Стоянов А.А."
  }, {
    shifr: "88",
    name: "аварийно-спасательных работ",
    shifrFac: "ГЗ",
    zawFio: ""
  }, {
    shifr: "89",
    name: "пожарной безопасности",
    shifrFac: "ГЗ",
    zawFio: "Дмитриенко Д.В."
  }, {
    shifr: "90",
    name: "техносферной безопасности",
    shifrFac: "ГЗ",
    zawFio: "Клюев А.А."
  }, {
    shifr: "92",
    name: "промышленного и городского транспорта",
    shifrFac: "ТЛ",
    zawFio: "Губачева Л.А."
  }, {
    shifr: "93",
    name: "электротехнических систем электропотребления",
    shifrFac: "ЭТ",
    zawFio: "Половинка Д.В."
  }, {
    shifr: "95",
    name: "информационных и управляющих систем",
    shifrFac: "ИТ",
    zawFio: "Горбунов А.И."
  }, {
    shifr: "96",
    name: "автоматизации и компьютерно-интегрированных технологий",
    shifrFac: "ИТ",
    zawFio: "Колесников А.В."
  }, {
    shifr: "97",
    name: "электронного машиностроения и промышленной электроники",
    shifrFac: "ЕН",
    zawFio: "Луцкий Д.В."
  }, {
    shifr: "98",
    name: "микро- и наноэлектроники",
    shifrFac: "ЕН",
    zawFio: "Войтенко В.А."
  }, {
    shifr: "99",
    name: "учета и аудита",
    shifrFac: "ЭК",
    zawFio: "Ефременко Е.В."
  }
];
